[
  {
    "title": "Impact of IITs on migration",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [
      "Written by: Sruthi SubramanianEdited by: Soumyadeep DattaDesign by: Zehaan Naik",
      "Athrav Jiwane"
    ],
    "content": [
      "Disclaimer: The opinions expressed below are the opinions of the writers and theirs alone.",
      "",
      "Does joining a top 5 IIT make someone more likely to go for research? Or does someone’s interest in research make them more likely to join a top-5 IIT? Prithwiraj Choudhury, Ina Ganguli and Patrick Gaule from the NBER (National Bureau of Economic Research) in the US have recently published aworking paperanalysing the effect of studying in one of the Top 5 IITs on migration for graduate studies. As students of one of the top 5 IITs, we were curious as to what the researchers conclude about us.",
      "The authors acknowledge the contribution of highly skilled immigrants to US technological innovation, and observe that “they study in elite universities in their home countries before getting advanced degrees abroad. For example, many successful Indian immigrants in the technology industry—including Sundar Pichai, the CEO of Alphabet Inc./Google, and Arvind Krishna, the CEO of IBM—are undergraduate alumni of the selective Indian Institutes of Technology (IITs).” Therefore, they study the extent to which the elite-institutions of India facilitate migration, focusing on the Indian Institutes of Technology (IITs), mainly the top 5 ones(including IIT Madras, IIT Bombay, IIT Delhi, IIT Kanpur and IIT Kharagpur), which are prestigious highly-selective universities, with an acceptance rate that is lower than the Ivy league colleges.  They conclude that while students from one of the top 5 IITs are morelikely to migrate for graduate studies, no significant difference is observed in migration for work.",
      "The paper focuses on the top scorers in the JEE 2010 examination, who could have gotten admission in one of the top 5 IITs. While 9 out of the top 10 scorers have migrated, the percentage decreases with lower JEE scores with 62 among the top 100 and 360 among the top 1000 choosing to migrate. The percentage of migration is sizable throughout the sample. Most of the students migrate for graduate school – 83% of the individuals migrated to pursue a Masters or Ph.D, while only 17% migrated for work.",
      "Research methodology",
      "The authors found it difficult to get data on high performing students in public domain. Since few past surveys have been conducted with similar focus, the lack of relevant data makes it challenging to study migration patterns, since it requires information both about the migrants as well as the stayers. To overcome this, the authors with the help of a dedicated team used the data of JEE 2010 that was leaked publicly, which included the full names and JEE scores of the students along with their final allotment (chosen IIT and branch). They used various platforms including LinkedIn, Github, ResearchGate, AngelList and alumni yearbooks to locate the migration outcomefor roughly the top 2,500 scorers in the general category. They also compared migration outcomes of individuals with the same JEE scores, and hence the same available choices. Finally, the researchers ran a regression to analyse the effect of the score, whether they attended one of the top 5 IITs or not, the gender and the major of students, on their migration status.",
      "",
      "Discussion on migration mechanisms",
      "The relationship between attending a top 5 IIT and subsequent migration is observed from the regression results on the main sample of 2,470 top scorers.It is seen that someone is 4.9% more likely to migrate for graduate school given that they attended a top 5 IIT, and in particular a 5.4% increased likelihood of migrating for Ph.D. One possible reason for the effect of attending a top 5 IIT on migration is the difference inhuman capital, since students with similar ranks might opt for different majors in the top-5 IITs as opposed to other IITs and engineering institutions. The course selectivity or major doesn’t appear to be correlated with migration, suggesting that human capital differences in terms of the major areas of study doesn’t significantly impact migration probabilities.",
      "",
      "Another possible reason could be the signalling value of theIIT brand name.To understand the effect of this, they did a case study on the Banaras Hindu University (BHU), which was converted into an IIT in 2012. While this change was brought about, there was no change in its staff, curriculum, or admission system, allowing the study of the impact of the IIT brand name alone. Comparing BHU students graduating before and after it received the IIT designation, a clear increase of 5.4% is seen in the share of students migrating for graduating school after it became an IIT (2014 and 2015). Hence, the IIT brand name itself appears to promote migration. While the increase is sizable, the migration percentages are still smaller in comparison to the top 5 IITs which perhaps provide a stronger signal.",
      "Lastly, the effect ofalumni networkon migration was analysed. We would guess that alumni networks would play an important role in migration as it can lower the costs for migration by providing students information about opportunities, and can also facilitate access to particular programs where they might have influence over the admission decisions. The results show that the presence of an alumnus from one’s own IIT in a particular destination increases the probability of enrollment there by 30%, while the number of IIT alumni from other IITs doesn’t seem to impact the decision.",
      "In conclusion, we note that the authors broadly conclude the positive impact of alumni network, IIT brand signalling, and studying from top 5 IITs on migration for graduate studies (and especially Ph.D. programmes) while no significant difference is observed for migration driven by work. We can point out attwopossible shortcomings of this research –firstly,the authors are not clear on how they separate enrollment in graduate programmes from the eventual transition of graduates to the industry, andsecondly, the authors have not considered the impact of other social factors such as caste and class on the migration patterns. Overall, this is an interesting study with insights that can potentially influence US immigration policy. We hope you enjoyed this review as much as we did!",
      "",
      "The above article is based on the below quoted research paper. We are sincerely grateful for their contribution.",
      "Prithwiraj Choudhury, Ina Ganguli, Patrick Gaulé, Top Talent, Elite Colleges, and Migration: Evidence from the Indian Institutes of Technology, Journal of Development Economics, Volume 164, 2023, 103120, ISSN 0304-3878,https://doi.org/10.1016/j.jdeveco.2023.103120.",
      "",
      "",
      "Written by: Sruthi SubramanianEdited by: Soumyadeep DattaDesign by: Zehaan Naik, Athrav Jiwane",
      ""
    ]
  },
  {
    "title": "Orijit In-Sen: A tête-à-tête with Indian Graphic Artist",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "Vox brings to you a conversation with Orijit Sen who visited IITK for a comic workshop. He is the co-founder of People Tree, an extraordinary artist, storyteller, activist, social documentarian and India’s first graphic novelist. From creating comics to editing anthologies, from teaching to writing, he has been an active and influential figure in the comics scene in India.Orijit conceptualized – and led a team that executed – one of the world’s largest hand-painted murals, installed at the Virasat-e-Khalsa museum. His work has been widely published, exhibited, and awarded within India as well as internationally.",
      "——————————————————————————————————————",
      "Vox: How did you end up choosing art as a career path?",
      "Orijit: I became quite serious about becoming an artist sometime around high school. It was a bit of a struggle against my parents, teachers, and others. When he was young, my elder brother was rebellious and inspired me a lot.",
      "Back then, the only choices were becoming a doctor, an engineer, or a lawyer. The other options didn’t even exist. When I tried to tell my parents I wanted to be an artist, they were aghast. My parents tried to convince me to be a doctor, but eventually, I announced I would not. I want to be an artist. I remember they were seriously worried. I was among the top five six students in my class. As long as I kept showing reasonable academic results, it would be much harder for me to become an artist. So I deliberately started failing my exams, to a point where my parents were driven to so much despair that they agreed.",
      "When I look back now, it’s funny, but I wonder at that age what gave me the self-belief to say, no, I will do this only while everybody is telling me from every side that you will be struggling in life. It will be miserable, and you won’t make money. I was like yeah, I get it, but that’s fine. That’s part of being an artist. You have to struggle.",
      "Vox- In the 1990s, you published graphic novels. Why did you choose that medium when no other artist in India was using it? Why did you shift to platforms such as Instagram and a more digital art form?",
      "Orijit: I’ve always been fascinated by comics. I used to draw comics as a kid too. I was always told that this is not a serious artist’s medium. Making comics one step worse, like you’re wasting your time making comics. But I was always really drawn to it and convinced of the medium’s power. I remember I went to the library in the college once. I had access to amazing comics from all over the world, including comics based on politics, adult comics, etc. That is how I knew it was a medium. Back then, there was no internet, and as a kid growing up in India, you had no access to information from anywhere else. You only had what you had around you.",
      "We used to read Phantom, Andre, Individual, and all these things. Tintin was a big influence on me as a kid. It used to make me feel like I was entering into the world with Tintin. So I was very inspired to draw comics.",
      "In 1984, Art Spiegelman’s Maus went on to win the AZA Prize. It was featured on the cover of Time Magazine, and it was yet another one of my inspirations! Like- This is what I’m talking about!",
      "Vox – How did you first start making memes and satirical posters on digital media?",
      "Orijit: In 2010, Binayak Sen was arrested by the Chhattisgarh government, and I was part of a campaign demanding his release. I made a poster about it and posted it on Facebook. That’s probably the first time I used this kind of art. I just posted it in the evening, and I fell asleep. In the morning, I woke up, and there were so many messages and comments from Facebook! It was fascinating! Then two days later, I saw that people protesting in Chhattisgarh, Raipur, had printed out that image and were marching with that poster as a kind of image for which they had taken into their march. That’s when I realized that this is a very powerful tool.",
      "I also liked the fact that nobody needed anybody’s permission. I just posted on Facebook. They took it from there, made blackouts, and started marching. The fact that one night I was sitting in Delhi talking about Binayak Sen and suddenly became part of the landscape of the protest in Raipur. I’d never experienced anything like that! That’s when I realized the power of this whole thing. So I started doing more such work.",
      "Vox: How do you describe your art style? How would you characterize your art style?",
      "Orijit: This question is particularly interesting because I don’t feel like I’m following any style. I’m just drawing the way I feel like drawing. Many people have told me that they can recognize my style when they see it, but this is not something I’ve done consciously or ever done consciously. I just draw what I want to draw with whatever tools at hand.",
      "Vox: Is there a process to making art? What goes into your head when you are sort of creating an art piece in terms of ideation, planning, and execution of it?",
      "Orijit: I do many different kinds of work, for example, big murals and large artworks, comics, and graphic novels. In addition to that, I do these one-off memes and satire about what’s going on in the country. Those are the ones that I am most known for because that’s what goes out on social media and reaches the masses. The process for making each of these kinds of work is different.",
      "I like to do a lot of visual research. We are such a textual society that all our ways of recording our histories are that we write them. Lately, photography and video have become possible, and people use it a lot. We associate photography and video with on-the-spot current events kind of reportage, but I use it in a longer reflective way to show imagery and visuals to tell stories which I feel are very important. So for me, usually when I start on a longer project, I do spend months, sometimes more than even a year, just researching my subject visually.",
      "I focus on the essence of the scene because I’m not going to be drawing every detail, you know! I’ll look at your body language, I look at the way you express yourself through your clothes or your posture. These things, to me, are a more essential viewing of things. I look at it, and I internalize it. For example, let’s say I want to do a mural in Punjab. So I visit Punjab, start meeting people, and start drawing things, and those things become internalized. I take photographs, but more importantly, I always draw. Even though it’s quick sketches, it becomes part of my mental, visual vocabulary for creating the work.",
      "With social media pieces, it’s different. If I feel a lot of anger or pain about something that’s happening around, I make relevant artwork to channelize those feelings. I take around half an hour to produce a meme. Once I have an idea or I’ve read something that’s inciting strong emotions, I need to deal with it, and my way of dealing with this is by creating a meme that I can share with others. I give myself a very short deadline to do that, it’s very instantaneous in a way, and there’s a logic to that. The creation of it is instantaneous, the absorption is also instantaneous. You know, it spreads immediately, and people see it.",
      "Vox- A related question is that when when you have commissioned art, how do you sort of balance between giving in to, say, your client’s requirements and artistic integrity?",
      "Orijit: It depends. Some clients have more specific things, like the Punjab mural was done for the government, right? I have to be subversive in criticizing the government. I do it but in a very subversive way because my work is always very sprawling with a lot of detail, so you can hide a lot of things there. The people in charge, who are representing the government, are usually some bureaucrats or somebody appointed. They don’t necessarily usually know too much about art, nor are they interested, they’re just supposed to do their job. So you can slip in a lot of things, a lot of things by which they don’t realize what’s going on. It can look like a nice scene, but when you look a bit deeper, there are all kinds of other things being shown in that scene. That’s what I usually do. I try to slip things and subvert the idea that is being presented. At one level, it seems to be about a happy picture of Punjab with progress and technology and all that, but if you look a little closer, you see there are a lot of other things going on which are actually contradicting this narrative of peaceful, happy Punjab.",
      "Vox – Is it important to you that your art is recognized by your name?",
      "Orijit: One of the good things about social media is that it helped me engage with an audience. Suppose my work gets published in a magazine or a book or it gets shown in a gallery. First of all, there’s very little opportunity for direct interaction with my audience. They may come and see it, and they may like it or not like it, or they may have opinions.",
      "But on social media, there are immediate reactions. People say things, critical things, and I value that. I value the fact that social media gives me this chance to interact with my audience and for me to get feedback from people. So I don’t want it to be anonymous. I do want my work to be associated with me because it’s essential for a kind of conversation to happen.",
      "Vox: What did you think of the financial aspect of your career when you decided to pursue art?",
      "Orijit: I was aware that I would’ve to sacrifice to be an artist. I was prepared for it. Of course, as a kid, you don’t know what sacrifice really means, right? You don’t know what it really means to be broke to live without a job. But at least in my imagination, I had accepted that my life could be one of these.",
      "Initially, it was up and down. I’ve had long periods of being very broke. I did regret it at one point after I made River of Stories. I spent three years doing this, and nobody was interested in it when it came out. Nobody knew what it was. There was no reaction. There was no response. I thought to myself that I was going to be hailed as this great artist, but nothing, nobody cared. At that time, I felt quite disheartened. Moreover, this was the same year my daughter was born, and suddenly I felt like, what am I doing- I’m living this sort of fantasy life, and how am I gonna bring up my family? How am I going to pay for my daughter’s education? So for a couple of years, I stopped making comics and started to do commercial projects. But that didn’t last very long. I went back to making comics soon enough. When we first moved to Goa, we were broke a lot of the time. Fortunately, in my daughter’s school, the fee was 15 rupees a month. Even for those 15 rupees, we had to go to the bank, make a demand draft for 15 rupees, and pay the school.",
      "It has been up and down, but all in all, I would never replace the life I have had for something else. If I look at the struggle that people, who didn’t choose that hardship, have to go through, they have to live within this world without any agency. At least whatever hardship I have been through, I’ve chosen. It has been up and down, and it went down, and then I came up. But you know, for a lot of people in that world, that option is not even there.",
      "Vox: How many countries have you been to, and can you tell us some of your experiences in those countries? How does community art differ across the places you have been to? What is the importance of art apart from recreational purposes?",
      "Orijit: Ah! I have lots of interesting stories because normally when you travel, you end up meeting interesting people – especially when you are traveling as an artist, you are meeting other artists. My trip to Palestine definitely stands out in my memory. It was like traveling and meeting people who are not necessarily artists in a self-described way but who use art as part of their struggle. For example, the scene of painting murals. A lot of the West Bank area in Palestine has, over time, been quite destroyed by attacks. So there are a lot of either broken buildings or uninherited architecture, and people use those walls to create artwork. What excited me in Palestine was that there is no professional art scene or galleries. People are using these public walls and spaces to create art.",
      "Even during the Shaheen Bagh Protests, art was created publicly in the places where people were gathered, like on the walls. When there is a situation where people are struggling and fighting for their rights somehow, art comes to the forefront. Also, in such times we realize how important art is for us, for our identity, our expression for freedom – of being able to express what we feel. When there is a very organized, peaceful society, then eventually, art resigns to the periphery, like gallery spaces, and becomes secondary. It perhaps becomes not necessary but something that you enjoy, it becomes a form of entertainment.",
      "Although I do show my work in galleries from time to time, to me, that is not the primary place for art. We create the artificial spaces in which we are supposed to go and view art, performances, theatre or music. We always create these confined and well-controlled, sanitized kinds of spaces to engage with art. To me, that is actually not what is the most exciting or powerful aspect of art, the art that gets separated from the mainstream life of society. You know, as an artist or performer, you do want to have the best of conditions in which to show your art like audio, lighting etc. But in that process of showing off your art at its best, you are taking it away from the mainstream of society. So I am always trying to work with forms of art that allow me to reach out to people.",
      "When I travel, I always seek out art and artists who are working in the public domain rather than in privatized spaces. That was one of the things that really moved me about my time in Palestine. I was just talking to a professor of Japanese languages. We were chatting about the various things that I’ve seen in Japan in terms of art.",
      "Although it’s not like that much in the public domain, there’s something strong about art in Japanese culture because of the media. I was fascinated by the manga culture of Japan. And it’s not in the public domain, but it reaches into the public sphere because of the popularity of the medium. When I travel in the Delhi metro, for instance, 99% of people are on their phones. In Japan, I was amazed that people are reading manga. That’s their form of getting immersed into something, and there is manga for every kind of person. There are so many varieties of manga, and everybody has their own kind of connection.",
      "Vox: Coming back to India specifically when you released provocative art like, say, Vadnagar man or Punjaban – did you fear any backlash when creating or publishing it? And also, how do you deal with it? And then the light question is, is there some element of self-censorship that creeps in?",
      "Orijit: Yeah, so I do feel quite afraid when I post some of this stuff. The thing is that in most situations, let’s say before social media, I was doing work that was critical of the government and authorities. Before that, if you were critical of the government or the authorities, there would be a certain level of, let’s say, disapproval. But I don’t recall feeling afraid at any point back then.",
      "Now I do. It does come to my mind every other day, and I do feel afraid, but I have to overcome that because that is exactly what you’re talking about. Self-censorship is something that is, on the whole, objective of the government. Censoring a few things to make an example of those things in order to put an atmosphere of fear in people so that they censor themselves. Then the government doesn’t have to physically censor each and everything. Basically, it just creates fear so that people then start censoring themselves. So when I put out my stuff, I feel scared, and I feel like, should I be posting this? When I did ‘River of Story,’ there was the publishing organization, and there were others in the organization, and it was like a collective responsibility, but when you’re posting by yourself on social media, on the one hand, you reach a lot of people very quickly, but then there’s nobody to warn you. As an artist, when you create something, it’s very hard to be objective and say if this crosses a line or am I stepping into a thing that’s going to get me into trouble? So it’s very difficult to know that. But usually, when I put out something which I feel is kind of borderline in terms of what it’s saying or doing, I do hesitate and think about it. But to date, I have never stopped myself from it. Even though I feel afraid, I still go ahead and post it.",
      "Vox: Do you get trolled, or do you receive threats?",
      "Orijit: Oh yes, lots of online trolling, online threats, phone calls. Even midnight calls! A couple of times, it even got quite scary. Interestingly, I was talking about this the other evening when I met a human rights lawyer because of one of these more serious kinds of threats. She looked into my work and suggested quite an interesting idea. She suggested that people are usually afraid to go after someone who is visible in the public space because then they are afraid of a certain amount of backlash. So ironically, probably the way to be safer is to create more such work because then you continue to remain in that public eye, and they will think twice about doing something. She gave the example of someone like Arundhati Roy. She said they’re scared to actually touch her because she’s too well-known a person, and if they arrest her, there will be a lot of protests from all quarters, not only within India, but that’s so she said if you’re in this position now, I would suggest you do more. It’s like riding a tiger, and you can’t once you’re on it, you can’t get off, you just have to go faster and faster on it.",
      "I feel like I have gotten used to it by now, I think courage is not about not feeling fear, courage is about fighting that fear. And that is why self-censorship is something I keep talking about it. Don’t censor yourself. Don’t let that fear permeate into you.",
      "Vox – Do you think psychedelics help artists in any way?",
      "Orijit: I think that depends on the artist. I wouldn’t say it’s a necessity or every artist must do it, but I think it gives you a different perception about certain things, such as colors. It also depends on your personality and what you’re trying to do, what interests you. I was never one for using any of these substances simply for recreation.",
      "I think what psychedelics do is that through artificial means, they put your brain into a kind of state which may be somewhat like that heightened consciousness that comes with maybe deep meditation or spiritual experience. But I have seen a lot of people who just end up getting lost in that whole thing because they are just doing it out of the sense of some kind of sensory experience, and maybe there’s a limit to that, right? I’m not somebody who propagates psychedelics, but if you know why you only use it and you are kind of doing it with a larger purpose, and you’re interested in it, then sure, why not?",
      "Vox: Do you have a message that you want to give to the readers?",
      "Orijit: It will sound very cliche, but sometimes cliches are cliche because they are true. You must have some kind of faith in yourself in whatever you do, and if you feel passionate about something, consider yourself lucky. Passion is what will take you places, it is what will drive your life, and it’ll take you through bad times.",
      "It’s not always necessary to pursue it professionally. You could do a day job and still be passionate about music. I think that’s what is going to save you. Art saves those it seduces. If you are seduced by art or by anything, then it’ll save you at the end of the day, provided you go with it and you have faith in it.",
      "Credits- Abhimanyu Sethia, Aditya VS, Gauravi Chandak, Mayur Agrawal, Nishanth S, Rahul Jha, Shreya Nair, Zehaan Naik",
      "Edited by- Aarish Khan, Mutasim Khan, Sanika Gumaste",
      "Thumbnail- Praneat Data"
    ]
  },
  {
    "title": "IITK Alumni help India Breathe: Conversation with Ashutosh Ranka",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "In these dreaded times, initiatives taken by citizens personally can help someone cross the line between life and death. One such initiative termed‘Breathe India’, is being led by a team of IITK Alumni, who are striving in order to help the needy through this campaign, by collecting funds and then using them to provide oxygen concentrators to the hospitals. The hard-working alumni team leading the initiative consists of Ashutosh Ranka (Y13, BT in MSE), Isha Agarwal (Y11,BT-MT in EE), Nikhil Asati (Y13, BT in MSE), Kavya Eluru (Y12, MSc. in MTH), Randhir Shah (Y9, BT-MT in ME), Mounica Sarla (Y11, BT-MT in BSBE) and Gundeep Kaur (Y11, BT in CHE).",
      "We had the privilege of talking to Ashutosh, who answered some of the prevalent questions in one’s mind regarding the campaign.",
      "You partnered with the SaveLife Foundation last year too in an initiative to transport migrants back to their homes. Tell us about the experience and how did the campaign fair?",
      "The motive last year was quite ad-hoc and I got involved with the foundation on a rather short timeline and got to fundraising. We could collectively raise ~INR 20 Lakh which aided in arranging 20 buses to transport close to ~500 migrants back to their home states. While this number is quite minuscule on the scale of the crisis, I got cognizant of the ground realities and the constraints that could arise in a campaign like this. This year, I have a team of alumni onboard that are striving endlessly to make this campaign impactful. So to sum up last year’s initiative, I would say that it sure was impactful, but there was a lot of personal learning for me in the process too that I am applying now.",
      "The first phase of the campaign has been a great success and the team has now proceeded into the second phase of the campaign. How are the funds being utilized and what has the team achieved so far?",
      "The first phase sure has been successful. We surpassed our initial target of INR 1 Crore and managed to raise over INR 2.4 Crore within five days. My team and I wholeheartedly want to thank all contributors for their support of the campaign. Our team has placed an order for 250 Oxygen concentrators (with another 50 in the pipeline) which should be arriving in Delhi by the end of this week. The advantage of concentrators over conventional oxygen cylinders is that there is no requirement of refilling and the concentrators function on electricity. Once received, the concentrators shall be handed over to the Delhi Government and they would provide these supplies to hospitals on a need basis. The current situation is quite volatile and we are hopeful that this initiative should aid in easing out the situation eventually.",
      "Given the overwhelming response in the first phase, what is your team’s vision for the second phase?",
      "The second phase aims to aid beyond Delhi. While Delhi is still nowhere close to self-sufficient in medical equipment, we wanted to move forward and do our bit in other states’ crisis as well. We have now partnered with RightWalk Foundation, an NGO based in Lucknow that works with slum communities in eleven districts of U.P. We have so far raised about Rs 80 Lakhs for the second phase and the orders have been placed with the current funds for supplying to U.P. We have made it a point to dispense the funds on a rolling basis wherein we wait for a certain benchmark to hit and place wholesale orders upon hitting the target. This eases distribution and aids the needy as soon as possible.",
      "What can the general IITK junta learn from this initiative and how do you think they can support in these times, if not financially?",
      "These are pressing times and I feel that every citizen of this country has a duty to perform. While staying at home should be continued as it has been, there is a lot that people can do with the resources they have. The financially independent people, the alumni are encouraged to support various fundraising campaigns that seek to bring immediate medical support to patients across the country. One of the alumni of our institute returned to his hometown, Jhansi, during covid and helped set up a helpline that provided real-time updates to the number of beds and oxygen cylinders in the city. Current students can take inspiration from such initiatives and help in their own way which may not necessarily be monetary. Helping set up oxygen cylinder fill-up stations, helplines, plasma donation camps in your neighbourhood could be your contribution to this mammoth revival mission.",
      "Apart from all this, we need to be there for each other in these trying times, as there is a lot of sorrow and melancholy that has been engulfing each of us individually. This too shall pass and I hope that we all triumph over the virus!",
      "Through the means of Vox Populi, we aim to spread more awareness about this initiative and seek the help of any kind, ranging from donations to expanding our reach. The first phase has already been successful and the same is hoped for the second one, and it would only be possible through the benevolence of the donors and the hard work of all of the people working behind the scenes in this campaign. We encourage our readers to support this campaign at the link provided below. Everyone can help by spreading awareness and making donations of any amount.",
      "Here’s the link for the fundraiser:https://milaap.org/fundraisers/support-arrange-oxygen-concentrators-in-delhi",
      "Writing Credits: Lavanya Ingle, Akshat Goyal"
    ]
  },
  {
    "title": "Interview with Mr. Anil Swarup",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "The Academics and Career Council IITK hosted a talk by Mr. Anil Swarup, who is an author and a retired officer from the Indian Administrative Service. In 38 years of his bright career, he served as the School Education & Literacy Secretary of India and the Coal Secretary of India. He is most popular for his book “Not Just a Civil Servant”. Vox Populi IITK had the privilege to take his interview.",
      "In a very large population of civil services aspirants we get to observe that they have a variety of perceptions about the civil services and various motivating factors to prepare for the UPSC CSE exam – Perks and amenities and Power in many of the cases. How is this common perception of the civil services different from the ground reality of it?",
      "It would be wrong to say that most of those who aspire to be civil servants, don’t do that for the power. Yes, each individual aspires to become powerful.  But the most important question is, what gives you power? For example, helping a poor helpless person could give you power or wielding a baton can give you power – it depends on how you define power, and each individual will have to determine for themselves what power means for them.",
      "Power means influencing the minds and actions of other people. Now, how would you want to do that- with a YES? Or with a NO? That is again very personal to every individual. Speaking for myself, over a period of time, I discovered that the power of YES was much higher than the power of NO. The power of NO goes away once you are no more a civil servant; however, the power of YES lingers on even after you have quit the service, and that is where your true worth gets discovered.",
      "More than that, it is all a question about what gives you a ‘kick’ – whether abusing someone gives you a ‘kick’ or helping someone gives you a ‘kick’? Again, as I said, it is very personal – each individual has to decide for themselves. In my own career, helping others gave me enormous ‘kick,’ hence, that was power for me.",
      "For the civil services, if you already have too many preconceived notions, then it could be troublesome because a civil servant is not perhaps as powerful in tradition as it is understood otherwise. Whereas you can become very powerful by using whatever that is given to you in helping others – the support system around you becomes so huge that you do feel powerful.",
      "It is from your support system rather than through coercion that you get your power!",
      "Being a civil servant for over 38 years, you have an experience of working different generations of civil servants. What is your expectation from the next generation of civil servants and how have these expectations evolved from your time till today?",
      "The times keep changing, and so do the roles of the civil servants in each period. When India gained independence, the civil servants had a very different role from what they had in my time or what they have today. The functions have evolved, and my expectations from the coming generations of civil servants is that you should discover for yourself what you like and do the same. Do not do things that you would want to show off to others, instead do the things that give you your ‘kick.’ It is when we try to achieve something to show off or display to others, numerous problems arise.",
      "You have worked very closely with the Education sector for a significant period. According to you, how are the higher education institutions of India, like the IITs, contributing to the nation building process? And, what more must we do, in order to achieve greater heights?",
      "I believe that there should be a higher association of the IITs with the industry and the government. The interface with the government and the industry needs to increase for the students studying in these institutes to get a better hang of the practical dimension of what they are learning. Similarly, both the government and the industry will benefit if they interact with the IITs because the students will give a perspective that is currently not available to the government and the private businesses, hence it is a win-win situation for all the parties.",
      "You have worked with the sector of school education as well. Frequently we get to read about issues like shortage of teachers in the government schools of rural areas, scams related to mid-day meal schemes, very poor attendance etc which paint a very negative image of the state of affairs in the “Sarkari Schools” of India. Having travelled to many states and gained a deeper insight into the public schools of India, what is your opinion on the correctness of this image of the public schools, and what measures are being taken to tackle these issues?",
      "A generalized comment may not be very appropriate because India is a very diverse country. There are states where the government schools are doing exceptionally well – Navodaya Vidyalaya, Kendriya Vidyalaya to name a few. You have to segment them to be able to identify clearly what is going wrong and where. Once you know that, it becomes effortless to find solutions – many states are already doing it.",
      "Look at Rajasthan, Karnataka, Chattisgarh; they have revived the government schools big time! There is a lot to learn from them; though the situation is terrible in some of the states, in their government schools, several states have already taken initiatives to turn this around, and they are doing it excellently.",
      "Whereas it is partly correct that a large number of government schools do indeed enjoy a poor reputation, a lot can be achieved given that a lot has already been achieved in many states.",
      "",
      "Credits: Aditya Raghav Trivedi"
    ]
  },
  {
    "title": "Interview with Mr. Mayur Dixit",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "As a part of Policy Conclave 2020, Students’ Opinion Society organised a talk on “From engineering to bureaucracy” by Mr Mayur Dixit, an IITK Y4 alumnus, who graduated with rank 1 as a Mechanical engineer and thereafter joined IIM Bangalore. He cleared UPSC CSE 2012 with AIR 11 and is currently the Chief Development Officer at Udham Singh Nagar, Uttarakhand. Vox got an opportunity to interact with him and discuss his journey over a quick QnA session.",
      "What made you choose bureaucracy over engineering or management as your career option?",
      "This was my personal choice. Despite having a slight inclination towards civil services, I wasn’t completely sure back then if that was truly meant for me. Managerial and monitoring work interested me which motivated me for choosing MBA instead of starting to work after graduation or going ahead in my domain of engineering. However, after working in the industry for 3 years, the monotonicity and profit driven nature of work along with the experiences and motivation I received from some friends and college seniors working in the public sector, inspired me to pursue my long-held dream finally. The diverse nature of any public service job personally excites me. Additionally, interest in working and living in my own country over settling abroad was also a contributing factor. I had come to this realisation that a person doesn’t require large amount of deals in life. All they need is everything in only moderate amount. Of all the many more reasons, these were perhaps the major ones to make me choose this path.",
      "What does your schedule look like?",
      "Some things are planned but most things are unplanned. I get to the office by around 9.30 or 10 am. Uniqueness of my job is that I have the freedom to plan my day further. I decide my own work and plan its appropriate distribution and operation. If there’s some minister or VIP coming in, then duties usually differ. But otherwise, we have routine meetings, discussions, inspections or reviews along with monitoring work. We would need to go into the field to review the work progress and check if the planning done is actually getting implemented. We also meet with different stakeholders, political executives, beneficiaries or scheme planners to discuss their implementation process. Under some law and order situation, or natural disaster, work is nonstop regardless of day or time. It’s a hard press job during such situations of emergency.",
      "What has been your hardest posting or your biggest challenge in your line of duty?",
      "During my first posting, the biggest challenge I faced was a law and order breakdown. I was the SDM (Sub-divisional Magistrate) in Roorkee and the city witnessed communal riots during that time. Maintaining peace and managing them was very challenging since I was also very new to the service. We had to impose a 10-15 days curfew and administrating the process was a testing task. Thankfully with the support of seniors, we were able to manage it through. From that incident, I realised that different sections or parts of government need to function together or else the system can’t run as needed. Winning the confidence of local people and maintaining good relations with opinionated leaders of conflicting societies also helps in such times of crisis as they can be of benefit in times of emergency like such. Rather than talking to a crowd which has no identity, it’s better to talk with their delegates or people possessing certain influence over their communities.",
      "Since you have been from sought after colleges, how did you balance your study with personal life and other work?",
      "It’s not unusual to study in such colleges. I don’t classify myself as any extraordinary. All you need to do is work hard and show commitment towards your goal. Never have a slightest doubt on your potential. Even if you suffer failure, rethink your strategy and not your personality. Be convinced that whatever you have decided is in your best interest. And once if you decide you want to write the UPSC exam then there’s no looking back. Commitment is fundamental. Having a job while preparing was profitable for me as I learned in a different way rather than mugging and reading so many books. I strictly adhered to the syllabus by concentrating only on reading about the relevant topics, daily newspaper and following my very own notes for revision. Scarcity of time led to a smart preparation. Since I worked in finance industry, that particular topic was much easy for me to write about in the exam, as I was updated with the latest economics, finance terms and operations I handled during my job. Other topics were very interesting for me because they were very different from my routine work profile. For me the preparation was joyful and relaxing. Needless to say, that one will have to make certain sacrifices also to maintain a constant routine of studying and keep focus on their target.",
      "What kept you motivated through the challenging preparation phase?",
      "I enjoyed working in the private sector, but after a certain point the work had got monotonous. My domain was financial modelling for a certain number of companies, and so was of my senior with slight variation for just a larger set of companies. I did not wish to be at their position after 5 years or so which led me to thinking about my future career prospects. I wanted to switch to something that could provide me diversity, experience various fields and civil services fits much well to that category. In it, after having a decent amount of experience in various departments, one gets to choose their specialisation and work in its scheme structuring/policy making or even study further in that particular discipline. The work is all directed towards nation building and private sector work is more oriented towards profit making. Although private sector is very essential for growth of country as government cannot provide jobs to everyone, for me personally, I’m not interested in working where only profit is the backend reason for doing the task.",
      "Any inspiration from within the family or any acquaintance of yours?",
      "My father used to motivate me to at least consider civil services as a possible option, but I mostly neglected it. But finally, when I had the realisation myself, I felt that he was right all throughout. My wife also has been my constant support system, because she’s the one who manages our home as the work timings can be often very abrupt. I need to keep myself healthy also through this as it’s essential to manage personal life along. I don’t consume sugar in any form whatsoever, do not smoke or drink alcohol. Although my work structure doesn’t usually permit me, I try exercising regularly.",
      "Has there been an incidence where you faced certain pressure by ministers?",
      "Never. No pressure. I don’t even know of anyone of being in such a situation. These events are extremely unlikely. They are also elected government officials and know what they’re doing. And if I know I’m honest, aware of what my duties and rights are, then I can never land in any such scenario. If someone is asking me to do something which I know is not right, I just need to tell politely that such and such is not possible due to whatever reason as per law. There’s nothing they can do about it. Arrogance should never be reflected in your demeanour as your dealings are often with officials much senior to you in the hierarchy. A polite refusal is never taken in wrong direction.",
      "Any word of advice to those who aspire to become civil servants and a message for the students of IITK?",
      "Set your goal firm if you really want to be a civil servant. If your personality is so that you want to help people and be their voice, and wish to contribute in nation building, then work hard with great dedication. There’s nothing that can hold you back if you have a firm resolve. No matter what hardships you face, if you keep on moving forward, they will all eventually vanish.",
      "IITK would always have a special place in my heart. It’s my alma mater. I achieved so much from this place. It is one of the best institutions in India. I feel I wasn’t able to utilize all the facilities which was a lack on my behalf, but I would give this suggestion to all students that utilize your time on campus well. This time shall never return.",
      "",
      "We thank Sir for taking out the time to talk to us and sharing his experiences.",
      "",
      "Credits: Dhruv Chhabra"
    ]
  },
  {
    "title": "Interview with Mr. Abhishek Gupta",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "Mr. Abhishek Gupta, the Chief India Economist at Bloomberg was invited to our campus as a part of the Policy Conclave 2020 organized by the Students’ Opinion Society, aiming to promote policy research on campus. Vox had the chance to interview him. Here is an overview of the conversation.",
      "",
      "Sir, can you please describe the aspects of your job at Bloomberg as the Chief India Economist?",
      "I am Abhishek Gupta, and I am the Chief India Economist at Bloomberg. What the role involves is essentially observing and analyzing the macro-economic data to help investors, i.e. making it easier for the investors to make sense of the Indian macroeconomic landscape. So, on a regular basis, I would look at all new incoming data-points namely inflation, GDP growth, unemployment, currency movements etc. and then forecast through the help of these data-points. Also, we deep dive into the policies impacting these macroeconomic variables.",
      "So, previously you also worked at Bank of America Merrill Lynch. How do you compare the two jobs – one at an American bank, and the other as an Indian economic analyst at Bloomberg?",
      "Even in the previous one, I was an Indian economist. I was working from Mumbai. The difference was that in Merrill Lynch, I was at the junior level. I was supporting the senior economist there. After doing that for a few years, I got an opportunity in Bloomberg for a lead economist, so I graduated into a lead one. As a junior economist, you can learn much, you gain knowledge from your senior, you can wonder about interesting policy topics that investors might care for. It helps you to train yourself to become an independent economist.",
      "In my role at Bloomberg, obviously there’s greater responsibility too, which comes with the role because you are now in charge of the team. As a junior, you don’t have to do a lot of ideation, but now I have to ideate and become creative as I can concentrate on interesting research ideas and then execute those ideas. It’s a very innovative role.",
      "Coming to the Indian economy, India’s GDP growth in the previous quarter was just 4.7%. But recently, our Hon’ble Finance Minister, Ms. Nirmala Sitharaman stated that “If the ship is steady and moving forward, then everything’s well” implying that even if the GDP growth is stable at a lower value, it is a good sign for the economy. Do you think that currently, India is going through an economic slowdown? How is the new budget going to help in tackling this situation?",
      "There are two interesting data-points released recently. A lot of people just focus on the 4.7% GDP Growth rate in the December quarter. In my point of view, the more interesting inference was what the trend was pointing towards. Initially, what many people thought was that the growth rate has slightly gone up, so the economy has started recovering.",
      "But that is not what the true picture is; if you might know, the numbers for the September quarter were revised upwards and since that was revised upwards, what this tells you is that the downtrend is still continuing which is the most worrying sign. The weak slowdown that the economy has been experiencing for the last many quarters and a few years shows that the economy needs more policy support.",
      "So, from that perspective, if you look at the latest budget, it doesn’t do justice to the economy; because the fiscal situation is going to be even more contractionary, as the government is saying that it wants to reduce the fiscal deficit. But on the monetary side, there’s some incoming data support. That balances a little, but overall, the recovery would be slow at best. Another influence is of the global situation, where growth has become stagnant because of the coronavirus spread and fear. Although the Indian economy has been fairly stable with respect to this issue, it would still have some slight impact.",
      "Overall, we need policy stimulus, to ensure that the economy does not slip further into a deeper slowdown.",
      "Do you have any advice for the budding economists at IIT Kanpur, the ones who have taken engineering but are more interested in economics now?",
      "I guess that’s an independent decision. More often than not, it’s your passion which leads you to a new field. Once you get there, it’s the combination of your passion, dedication, and motivation which leads you beyond. Coming to the engineering and economics point, if you have a strong mathematical background, it would only help you get there faster. Even today the way economics is taught, the catch-up time for an engineer would be a lot lesser than say, a person with a humanities background.",
      "Lastly, how was your experience in IIT-K, and considering Policy Conclave, do you have any suggestions for the next year to improve the overall learning impact?",
      "It was my first time at IIT Kanpur; it’s a lovely campus. One thing that I’d recommend for the Policy Enclave in the future years is to involve the faculty more. I noticed that the event was completely student-driven, which on one note signifies how much students can operate and achieve on their own but on the other hand, if the faculty gets involved, they might be able to put in their own positive and experienced views in the event organization. This might also result positively in a way that the output and learning from these events could be incorporated directly into the course curriculum and much wider economic discussions and debates might occur in the classrooms itself, which would bring a very constructive impact on the students.",
      "Credits- Devansh Parmar, Ankur Banga"
    ]
  },
  {
    "title": "In Conversation with Shri. Ramesh Pokhriyal ‘Nishank’",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "Shri. Ramesh Pokhriyal ‘Nishank’, our Hon’ble Union Minister of Human Resource Development, visited IIT Kanpur as the Chief Guest for our Foundation Day Celebration on 02/11/19. Vox got the opportunity to interact with him personally and get his opinions over a quick QnA session. Here’s the full interview:",
      "Ques- How has your visit to IIT Kanpur been so far?",
      "Ans- It has been nice, very nice. IIT Kanpur has a long history of its own. As I have already said, IIT Kanpur hosts the scent of India’s independence as well. Feelings of patriotism will lead our nation to make strides forward, and IIT Kanpur will most definitely play a big role in this process.",
      "Ques- There has been a lot of discussion throughout the nation on the issue of MTech. fees hike in IITs. What do you have to say about it?",
      "Ans- There is a faulty notion in place here. The truth is, we want students to do MTech. When we analyze this issue, we are actually just taking the required fee from them. What has been happening till now is that students who really want to pursue MTech andgo into the research field are being deprived of opportunities while others, in the name of MTech, prepare for something else. A sizeable chunk of them did not come here for MTech, but rather just for the resources. They waste seats that could have been used by students really interested in research. But even then, the government hasn’t taken any measure on its own. It has left the decision to be made by the institutions. If they feel like increasing their fees, they can. We, in fact, encourage students to go for MTech. We have a lot of scholarship programs in place for deserving students. Our intentions are for the good of the students.",
      "Ques- As the Minister of Human Resource Development, what challenges do you face and how do you plan to tackle them?",
      "Ans- The biggest challenge right now is to take our country to the peak, and to figure out innovative ways to do so through a combination of modern knowledge, science, and technology with our culture and ancient practices. Our new education policy will include all these elements and increase our population’s employability. We will implement a very “India-centric” education system. As our Prime Minister has said, we need creation in this new India. We need a prosperous, healthy and united India, which is recognized by the whole world. Not only do we want this India to fulfill its citizens’ demands, but also be the central point for the world’s expectations. In fact, it is already on that path.",
      "Ques- What are the Ministry’s plans for Research and Development in our country?",
      "Ans- As PM Modi has said, when our country gained its independence, our borders were not secureand we were going through a severe grain shortage. At that time, Lal Bahadur Shastri gave the slogan of“Jai Jawan, Jai Kisan”(Hail the soldier, hail the farmer). The nation successfully tackled the situation. When Atal Bihari Vajpayee came, he realized that we needed more development in the field of science, and thus he added the phrase“Jai Vigyan”(Hail science). And today, as is evident from projects like Chandrayaan 2, we have made immense progress in science. Our PM has now added the phrase“Jai Anusandhan”(Hail research) to the slogan. And for that, our government is establishing the ‘National Research Foundation’ or the NRF. With the help of IITs, Germany and India are working together in fields of mutual and interdisciplinary research.Through our initiatives likeSwayam Prabha, we are running a lot of courses. We are also working in fields of higher education.",
      "",
      "Interviewers:- Anmol Chaman, Manjeer Majumder",
      "Translation by:- Dravya Marwaha"
    ]
  },
  {
    "title": "The correct model for success: In conversation with Dr. Pullela Gopichand",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "Photo credits: IIT K Media Center",
      "Usually, there are two classes of people- those who know how to do a great job and others, who can teach the next generation how to do a great job. Are these classes mutually exclusive? Well, Veteran badminton player Pullela Gopichand is a counter-example no one can refute.",
      "Recently, IIT Kanpur was fortunate to witness the badminton legend, who not only had a glorious career as a player but also contributed to the sport, by coaching a generation of star players like Saina Nehwal, PV Sindhu, and Parupalli Kashyap. The 2001 All England Champion imparted some invaluable lessons as he delivered his masterclass-” Be The Change” on Friday. Dr. Gopichand, was here to receive his honorary doctorate, during the 2019 Convocation. His humble persona and insightful advice made the session a huge success.",
      "Gopichand kicks off the session with a story of a young girl at his academy, who could not catch shuttles thrown at her during training. The girl then asked Gopichand,” Sir, Please teach me how to catch”. Her inability to perform the basic exercise forced him to look into several coaching books and manuals. But how do you teach someone how to catch a shuttle?–there was no definite answer. He said, “There are kids, who cannot run, dive, catch, hit and perform other basic exercises. Like the inability to count, write and perform basic calculations, the inability to perform the most basic sports activities like running and catching, is something which can be termed as Physical Illiteracy. In the past few years, there has been substantial growth in alphabetic and numerical literacy, but in our country, physical literacy still lags behind. I failed in mathematics as a kid, I could still manage a smooth life, but if someone fails in the most basic sports and games, there would be huge problems at every stage of his or her life”.",
      "“I come from a typical Telugu family, and my parents wanted me to become a doctor/engineer like my elder brother, who was studying Engineering at IIT Madras. Not clearing the Engineering Entrance, helped me pursue badminton more seriously,” jokes the former All England Champion, who was asked by his parents to take one year off to try a career in Badminton. “There was a lot of pressure from my family, I had to play consistently well to convince them I was good enough”, he recalls. The session was followed by a short interaction, where he answered questions on his transition from a player to a coach, challenges that he faced while setting up his academy and the future of badminton in India.",
      "1. How do we deal with failure, especially in sports? Let’s say we stumble on the court and everyone starts laughing. How does one cope up with all the mocking and still continue?",
      "“Understanding is needed by everyone. But for a player, the journey is very personal. Let’s not look at referential excellence as a model, and start valuing personal excellence. You are running something today, you should ask yourself what you can do tomorrow? Some people start with an “opening balance”, some do not, hence the comparison is unfair. Also in the longer run, it matters whether or not you love what you are doing. It’s not about whether or not I ran 100 meters in 13 seconds or 10 seconds. If you really love running and have the passion to do that for life, it will drive you to excel, and numbers or performances won’t matter much then”.",
      "2. Was there a time when you thought of giving up badminton? Also, If you were asked to choose a sport today, except badminton, which sport would you play?",
      "“If I had cleared the Engineering Entrance, I would have been forced by my parents to give up badminton. Actually during my multiple surgeries, especially in 1992 and 1994, I could have easily left Badminton, it was the kid within that forced me to play more and not give up. Also in my case, since it was the only thing I was good at and enjoyed the most, I had to continue. For the second question, I would like to take up football, if I could stay away from injuries. Also, Athletics– I have always admired it as a sport”.",
      "3.During the early stages of the Gopichand Academy, what were the challenges you had faced, in terms of logistics and finances, and how you eventually tackled them?",
      "“As a kid, I had to run around for the most basic things in life, there was no pool, no shuttle –the court was not vacant a few times. I wanted all these facilities in my academy, to be available at all times. We got a piece of land in Hyderabad for the academy and started with the construction. As an all England champion, you’re meeting everyone, businessmen, entrepreneurs, etc. and everyone tells you that they would support your idea. I signed autographs, posed for pictures and attended all social functions, with a hope that people would help me out. I made presentations, attended meetings, and pitched my idea to everyone. But slowly people stopped taking my phone calls. 2 years of running around got me only Rs. 46 lacs. Sponsors claimed that nobody would watch badminton. I eventually had to mortgage my house, which I had bought after the All England and was sanctioned a 3cr loan. I then had to fight a 6-year court case, over a land dispute. But I made sure that the players were unaffected, there was not a single session when there were no shuttles or any other equipment. It was possible because I had support from family, it was just not me, it was the Gopichand Academy–my wife and parents, that stood behind me”.",
      "4. You are one of the few players who have won both the Khel Ratna and the Dronacharya. How was the transition from a champion player to a champion coach?",
      "“I think as a player you really focus on yourself. In a lot of ways, it is the same, when you’re a coach. You just have to reverse the mirror on the other side. You have to put yourself in the player’s shoes and think about what works best.  As a player, I had gone ahead and learned by trial and error, as a coach I had to transfer that knowledge, as it would help the player grow faster.”",
      "5. Badminton, unlike Cricket, has not emerged as a Pan-India Sport. There is a certain region that amounts to most of our international representation. How long would it take for badminton to grow in other regions as well?",
      "“I think in the next 5 years we are going to get there. A huge number of people have started playing badminton in other regions– be it western, northern or eastern India. A lot of good academies have also emerged. The journey would be slow, but we can expect the next badminton stalwarts from other regions of India in 5-6 years.”",
      "6. You have had a great career as a sportsperson, But are there any mistakes/ regrets that you would like to share?",
      "“Honestly, I think If I was to start over again, I would love to do things exactly as I did, I won’t change much. Except for the irrational mistakes I did while I was playing on the court, I really feel that things could not have gone in a better way. I am completely satisfied with how all this went.”",
      "",
      "Correspondence: Yash Kuwade, Aditya Trivedi",
      "Interview and Edits: Pulkit Deshmukh"
    ]
  },
  {
    "title": "Rivigo revokes placement offers!",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "",
      "Rivigo is a technology-enabled logistics company that had visited IIT Kanpur on Day 1 and 2 of the 2018-19 placement season offering roles in Algorithms, Business Analysis and Software Development. In a sudden incident on 13th June, Rivigo revoked the placement offers of all their incoming fresh hires, out of which 11 were from IIT Kanpur. In the mail, Rivigo mentioned “slowdown in the economy and the related market pressures and dynamics of the industry” as one of the main reasons they were forced to review the offers they had made.",
      "While the incident has been rather unfortunate, Rivigo, as conveyed to us by one of the 11 students, is putting in the best of their efforts to make sure these students get placed in equivalent if not better positions. Rivigo has personally contacted companies like NoBroker, Shuttl, Cleartax, etc., and has shared the details of the on-campus interviews conducted, and has been scheduling telephonic interviews for the students with them as well. The HR team of Rivigo is in constant touch with the students, keeping track of the scheduled interviews. In case, these companies don’t shortlist these students, another set of companies will be approached as well.",
      "This was about the efforts from the side of the external party in question, but what about the steps from the internal organization, that is the Students’ Placement Office. A former Overall Placement Coordinator, in conversation with Vox, remarked,“This is actually a rare case and hence every further procedure which needs to be followed is still under discussion. As of now, we are working on casualties by finding opportunities for those students. The procedure is nothing less than blacklisting, but finding relevant opportunities precedes everything as of now.”",
      "Economic pressure and market dynamics are some factors that often lead to harsh corporate decisions. Although Rivigo took the responsibility of offering equivalent interviews in other companies, this still raises questions about how slots are allocated during the placements by the Students’ Placement Office and the overall process of jobs being offered by the companies.",
      "Moreover, the factors used in calling and assigning slots to companies during placements also fall under scrutiny and whether or not rigorous background checks should be even more prioritized over other criteria like the number of offers, CTC and the placement percentage, is a big question that the SPO would have to answer. Long delays in communication of offer letters is also an auxiliary problem that aggravates instances like these and can affect students negatively. We can only hope that the efforts of these students don’t go in vain and that they are given placements they deserve.",
      "A student from the graduating batch, who was closely associated with the placement season said-“SPO invests fewer resources for contacting companies sooner. If the efforts start a bit earlier, not only will they have enough time to consult other colleges where the company has hired in the past, have a good background check and avoid such situations but also have a greater chance to convert bigger and well established companies to get hold of the prime hiring slots instead of growing startups, which depend highly on market dynamics and economy.”",
      "While we laud the continuous efforts of the SPO, evident by the fact that IITK has had the best placement percentage amongst all IITs for the last two years, this certainly is not their brightest hour.",
      ""
    ]
  },
  {
    "title": "A Study in Perseverance: In Conversation with Medha Patkar",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "Ek Ayodhya ke Mandir or Masjid par kab tak ladenge, yaar! Humko toh hamare astitva ke sangharsh kahi jyada zaroori lagte hain.",
      "Medha Patkar is a social activist working on various crucial politicaland economic issues raised by tribals, Dalits, farmers, labourers and women facing injustice in India. She is the founder member ofNarmada Bachao Andolan(NBA) in the state of Madhya Pradesh, Maharashtra and Gujarat. NBA has been engaged in a struggle for justice for the people affected by the dam projects related to the Sardar Sarovar dams project, especially those whose homes will be submerged but have not yet been rehabilitated. She is also one of the founders of the National Alliance of People’s Movement (NAPM), an alliance of hundreds of progressive people’s organisations",
      "She was in IIT Kanpur for a talk on 9th March, Day 3 of Techkriti’19, and the introductory lines are an excerpt from the QnA session after her talk. After that, Vox Populi got a chance to interview her with the cooperation of the Techkriti’19 organising team. Here are some excerpts from the same.",
      "Q1. Yours has been a long journey of activism, being a woman shapes the journey in a different way, very often in a negative way. So would like to share certain experiences where being a woman has shaped your journey.",
      "Ans. Well, bad experiences were not because I am a woman activist. For example, one night, I was returning late from work and no public transport was available. So I had to ask a truck driver for a lift and thereafter he attempted to assault me. I had no option but to run away.The point that I am trying to make is that this could happen to any woman and I was not targeted particularly for being a woman activist.In fact, my gender brings certain advantages to activism. We can reach out to the‘chulha’which men activists certainly can’t. Also, we are more perseverant and therefore do not let go of the tasks until goals are met. For example, the [Sardar Sarovar] dam has been made completely but we are still trying to expose the problems with it.This does not mean that we don’t change our ways or our views even a bit, we need to have that openness as well because whatever steps we take must benefit the people. Apart from this, women have an inherent bonding with nature and therefore battles fought in the interest of natural-resources based communities are mostly led by women.",
      "Q2. What is it that women bring to the table that compels the government to answer?",
      "Ans. I will give you an example of a World Bank employee whose collar had been grabbed by a lady. The same World Bank official is now giving lectures on what he has learned from [the] Narmada [Andolan]. Today, the inspection panel formed in the World Bank has been formed due to [the] Narmada [Andolan]. The action of the lady to persuade the official on that day shows its effects even today. Women know really well how to convince someone in their own way.",
      "Q3. As a legacy of our nationalist struggle, the makers of our constitution determined that we would be a democratic nation committed to civil liberties and socio-economic justice for all. What is or should be the role of students in realising this vision?",
      "Ans. Much-much can be done by the students. First of all, they should be open to what is happening around and seek information, not only from the media but by becoming the medium themselves. These days, you mostly see panel-based discussions on TV channels and in-depth information is lacking in the news. Youth should do their research first and then build a perspective of their own.We have startedJeevanshalasin Adivasi areas where the Adivasi youth are our teachers. We need many more people to continue our work and the youth can come ahead for it. Students also need to participate in these alternative ways of reconstructing(the society), each one with their own knowledge. But then career and payment become a limiting factor not allowing many people to come with us.",
      "Q4.In recent times, we have seen a major crackdown on people working for the rights of marginalised workers, Dalits and Adivasis. On March 6, we came to know of the arrest of Lingaraj Azad. Sudha Bharadwaj, who is also an IITK alumna, was detained last year. What impact do these actions have on the community of activists? Does this create a crisis within a democracy where even constitutionally legitimate forms of dissent are criminalised? What do you think is the way out?I think their [government’s] intention is to suppress our vigour and our commitment, but that does not necessarily happen. Activists working for glamour and prestige may actually feel intimidated. However, those who are thoroughly invested in it feel even more committed after such a crackdown and the communities around them also rise up to the occasion. When I was imprisoned in 2017, people outside were more worried than me! Sometimes, these repressive measures become the ones that provide force to the movement.However, these days the suppression of activist movements is happening in a really violent way, sometimes even leading to deaths of people involved. Many are denied justice in court. It is really a serious issue and more and more people should stand against it.Q5. A distrust is being formed against the activists and people like you are being labelled as so-called ‘urban naxals’. There is somehow this community of people who believe that this community of activists are not really contributing to the nation. What are your views on that and what measures can you suggest to counter this ideology?",
      "Ans. These allegations are baseless and people try to serve their own interests using them.We have hearings of defamation cases dating back to 2000, where there have been allegations on us that we are foreign-funded.The reality is that we do not even touch the monetary part of the international awards for our work. Had we been using those sums of money, we would not have had to struggle for funds for theAndolan. But if we become like those big funded organisations, our way of working would completely change and we don’t want that to happen. Many people tell us that we need to take funds from wherever possible, but I think that we would not remain this impactful if we do so. Farmers contribute to us, the land for our office was given to us free of cost and even the bricks were given to us for free, all this has happened only due to the fact that we didn’t touch any of the award money given to us. When the first award was to be presented to us, a meeting of 300 people went on for the whole night and we all decided to reject the money. If we take the money we get many allegations for which have to fight a legal battle, it is better not to waste time in countering those allegations, as they cannot do anything to us as the work we do is visible to all.",
      "I would urge those who feel that we are obstructing development to understand that what constitutes development, in itself, is a huge question.We have experienced a lot of things during our struggle and I have learned that if you stay firm on your path and keep working, your work answers to all those who are questioning you. I am not saying that we should completely ignore what people talk about us. Amongst those people, there are some with a closed mindset and we cannot do much about them but we should definitely try to reach out to the open-minded ones and appeal to actually listen to what is said about the issues we raise and the kind of solutions that are proposed. Many times, we are also restricted to our own circles only which needs to be changed. This is why I always like to come to institutes like IITs and IIMs and request the students to come and spend some time with us.",
      "Interviewed and written byAbhas Goyal,Archana SinghandSoumyadeep Datta"
    ]
  },
  {
    "title": "In Conversation with Mr. Shashi Shekhar",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "Mr. Shashi Shekhar Vempati has been the Chief Executive Officer of Prasar Bharati Broadcasting Corp. since June 2017 and has been its Part-Time Director since February 19, 2016. An IIT Bombay alumnus, he has worked as a Product Strategist and Digital Innovator at Infosys for more than 16 years and was responsible for incubating many cutting edge technology-based Digital Innovations and Initiatives working globally with Fortune 500 clients across various sectors including Retail/CPG to Mobile, Digital Services and Energy/Utilities and others.In April 2013, he shifted gears and joined a News Media Platform named NitiCentral.com as the CEO. He has also played a crucial role in Prime Minister Narendra Modi’s Mission 272+ during the General Elections 2014. Shashi Shekhar Vempati has also been crowned with the Dataquest Pathbreaker Award for Innovation 2014 on behalf of PM Narendra Modi’s Digital Campaign for 2014 elections. Vox Populi got the opportunity to interview Mr. Shashi Shekhar Vempati during his visit to the campus.",
      "Q. There’s a lot of discussion about fake news that needs to be controlled in journalism. How can established media bodies, which have accountability over their content as compared to perpetrators of fake news, combat fake news, given the high pace at which fake news spreads?",
      "I believe that we need to address fake news at multiple levels. The most common form of fake news is morphing photographs or putting up wrong photographs. This form can be tackled easily through technology if all the industry bodies come together. Collective action to ensure verifiability of available content is easily achievable and important at the baseline level. The second step is the fact-checking websites that authenticate content. But often even the fact-checkers get it wrong or the time involved in the verification process allows the fake-news to spread to a large number of people. The fastest counter to these problems is an individual response. If you’re someone who verifies content credibly and consistently then your influencer base will trust you as far as flagging fake-news is concerned.I don’t think that any one solution will solve it and we’ll have to address the issue at all these levels. The need of the hour is a culture of vigilance. Most of the people unthinkingly consume information, assuming it to be true because their relatives or friends shared the information. There is no natural instinct to question the available information even if it doesn’t look to be true. So what we need to create is that culture of vigilance and questioning so that you don’t just automatically take what is dished out and put in the effort to go to the next level of checking. I think that if that happens together with all these measures then we can combat fake-news.",
      "Q. DD News and All India Radio are probably not that popular with the youth of the country. How can we increase the popularity of such mediums so that the youth is motivated to consume more from these channels?",
      "The first step for this is engagement, because if we don’t engage with the youth then we don’t know what they want. One of the things that I have been pushing is to have more engagement with the audience. The easiest way to engage is through social media. We’ve taken the first step towards achieving this and have created a social media presence. Right now it’s a one-way conversation where we are just blasting information and we are not really listening. The next step will be to start listening to people and engage better. The third step is through our app where we’ll have more interactive features to take feedback and do surveys. The fourth step that we have planned is going to be the most interesting step. We plan to involve the youth in content creation. One day of the week we plan to invite students to run the newsroom. These kinds of experiments will ensure that we develop the kinds of formats that the youth can relate to. Being more open to experimentation and innovation is ultimately what will get us that engagement.",
      "Q. How can we improve the global reach of public broadcasting channels to have a greater presence in international journalism?",
      "There are two paths to this. The first one is the traditional path of terrestrial TV, satellite TV and so on. On that front, we have to tie-up with various entities as we have done with Korea. Subsequently, we’ll move on to other countries for collaboration to get us the traditional reach. The other, faster path will be the digital path. We’re not looking for mass reach by targeting the entire population of other countries. Rather, we want to target the opinion makers and influencers, a large part of whom are moving to digital media in most democracies. Our approach for them would be to have DD India along with our app and all our international content from our radio be packaged in a digital interface which can then be used to target these segments in other countries. These will be the two paths that we will use.",
      "Q. There appears to be a gap in what the rural population is consuming and what the urban population is consuming. For example, print media is still popular in rural areas whereas it’s not as popular in urban areas. Is it necessary to bridge that gap?",
      "No, I don’t think that it’s necessary to reduce that gap. In a democracy of our size, we often miss out on this and this is my biggest complaint with the foreign media as well when they report on India. They go by the opinion of the English media of Delhi which is catering to a micro-minority of the country, while India is a much more diverse and a much more complex. If you look at it, the US is the next closest democracy and is one-fourth of our size. So basically when you are reporting on India, that means you are reporting on four United States put together. We need to take in mind the complexity and diversity of India and understand that this is not going to change overnight. Hence, I don’t think that we have to bridge the gap, instead, we have to understand why those different gaps exist and report accordingly. For example for the north-east, English is very important apart from their local languages. So some of my best English content is actually getting created in the north-east.",
      "Q. Would it be possible to create quality content for both the sectors, given that we have a divide in what the two sectors consume?",
      "That precisely is the challenge of the public broadcast sector. The private sector will never report in 23 languages and 178 dialects as we do in the public broadcast sector. We have to be relevant in all those segments and all those languages and yet do it in an interesting way. And hence, technology is going to be important in the way forward. For example, if I create some high-value content, I should not have to produce the same thing in a hundred languages. Instead, technology should allow me to disseminate that content in all these languages.",
      "Q. What should be the role of campus journalism bodies in campuses like IITs and IIMs and how should these journalism bodies be progressing?",
      "I have a very strong view that campus journalism is a natural segue to public broadcast. If you look at the United States, for example, many of the public radio stations are actually operated of campuses. The community radio model is a viable method, but that has limited reach. I think that there should be a lot more synergy between the talent within campuses and the airtime on public broadcasting so that a lot more content is generated and to enhance our engagement with youth.I believe that there is a second aspect to campus journalism. When we were in IITs, it was a different era where the IITs were a little shy of taking a stance on the larger issues of the country. IITs were like an island, completely disconnected from the rest of the country in that sense. Campus journalism has a second role which is to spread more awareness and to ensure more engagement with the issues of the country. In that light, campus journalism is essential in engaging the broader community with the IITs.",
      "Q. Any final message for the young readers who follow Vox Populi.",
      "I think it’s a great time to be young. You have the right kind of leadership and the right kind of environment in the country. An enabling environment has been created across India where we have access to technology and capital and a lot of investment is being made in the country. When we were graduating, to think of a start-up was just impossible because you wouldn’t have had the money or the ecosystem which would have incubated you and given you a springboard. Now all of that exists and it’s a great time to be here. So don’t think small and don’t think individual, think big and think for the country.",
      "Credits:Kushagra Gupta, andAnmol Chaman"
    ]
  },
  {
    "title": "In Conversation with Flavia Agnes",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "A pioneer of the Women’s Movement in India, Flavia Agnes has worked on the subjects of gender and legal reform. As a lawyer and social activist, she has played a vital role in raising issues about women’s rights in the legal system. In 1991, Flavia Agnes co-founded Majlis, a legal and cultural resource centre, with the aim of providing quality legal services to women and children. A proponent of legal pluralism, she has played an important role in reforming the Christian Personal Law. Of late, she has been actively engaging in the issues of democracy, socialism and identity politics. Vox Populi got the opportunity to interview Flavia Agnes during her visit to the campus.",
      "Q: There is a prevalent belief on campus that the attempts to uplift women are creating a system with an unfair bias in favour of women. What is your response to this?",
      "Flavia: I don’t think that these beliefs are justified. For a long time systems have been biased against women. There are very few women in IITs and they do not feel welcome. It has been a male-dominated sphere for many years and few people questioned it. Now that systems in favour of women are being created, men should not find it to be unfair. The system has been biased against women for long and can not suddenly become equal. It has to first be biased in favour of women, and gradually, it will create an equal society. In fact, men should be equal partners in this venture to promote equality.",
      "Q: There are people who agree with the idea of gender equality but feel that the manner in which this goal is being pursued forces men to make unfair sacrifices. How would you convince them to be more accepting?",
      "Flavia: People agree with a ‘nice idea’ like equality but have an issue when its implementation affects them. If you believe in gender equality, you must be prepared to make some sacrifices. To ensure equal opportunities for women, we have to create space for them. Previously, there were very few women in politics, so we created 50 per cent reservation in gram panchayats for them. Similarly, we have job reservations for women too.",
      "Q: There is a view on campus that the Women’s Cell is not a neutral body and does not give a fair hearing to the defence of the accused. What would you like to say to this?",
      "Flavia: Yes, any woman can file a complaint against anybody, but the Women’s Cell or ICC are duty bound to conduct a proper investigation and go by evidence. They can not just go by the words of the woman. It is important to understand that a body like Women’s Cell is necessary to create a safe space for women and provide them with redressal mechanisms. In fact, these committees do not comprise only of women; there are male members too. The presence of men on such committees is important in ensuring fairness.",
      "Q: Moving on to some issues in the current political discourse. How, according to you, can we reconcile feminist ideas that conflict with religious beliefs?",
      "Flavia: Let’s take my example. I am a Christian woman, I believe in the teachings of Christianity and I believe in justice. I want my belief system to incorporate justice for women in it. It is a very tough battle. Similarly, let’s look at the Sabarimala Case. The women devotees didn’t ask for entry into the temple. They wish to seek Lord Ayyappa’s blessings and not anger the lord by enforcing their rights. Young lawyers went to the Supreme Court with the petition, not the devotees of Lord Ayyappa. I believe that reform must come from within. Members of a community must demand justice for themselves. It won’t work if other people raise these demands on their behalf.",
      "Q: How do you see the condition of women improving in Indian society?",
      "Flavia: Change is inevitable. It will come gradually, in an organic manner. Changes in socio-economic situations and migration of people bring about a change in attitudes. You cannot have radical changes being enforced from the top. You cannot bring about social reform with the stroke of a pen; it has to come from the ground.",
      "Q: In the light of the #MeToo movement, where do you think the current feminist movement is headed?",
      "Flavia: Recent developments like the #MeToo movement have provided women with a confidence and a language to speak about the crimes committed against them. When the system doesn’t resolve the complaints, people will shift to alternate systems like social media. These alternate systems have broken a wall which prevented issues from coming out in the open. Now, issues like consent and workplace sexual harassment are a part of the public discourse and are shaping the feminist movement. If women did not speak, no one would be talking about such issues.",
      "A prolific writer, Flavia Agnes has provided incisive analysis of many social trends and legal reforms including domestic violence, gender justice and human rights. Flavia Agnes is an active blogger and is very vocal on several issues of social importance. Among her many publications is her autobiographical book ‘My Story Our Story … Of Rebuilding Broken Lives’ in which she writes about the hardships and struggles she faced in her life.",
      "Interviewed by :Siddharth Jayashankar,Kushagra Gupta,Bani BhattacharyaWritten by :Siddharth Jayashankar,Kushagra Gupta."
    ]
  },
  {
    "title": "“Ideas are overrated” – A tete-a-tete with Ronnie Screwvala",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "During his recent summer internship at UpGrad in Mumbai, Simrat got the opportunity to interact with Ronnie Screwvala. He is a serial entrepreneur known best for being the founder and CEO of UTV. He talks about how startups are not just about the ideas behind them and how funding is an overrated concept in today’s environment.",
      "",
      "SS : What do you see in an idea when you are approached by someone to validate or invest in it?",
      "RS : An idea is not the be all and end all of what an investor sees. A fair amount of success is determined by the clarity of vision of the people behind the idea. A lot of it also depends on the size of the market or the appetite of the population to adopt a new product or service. Having said that, sometimes it is very exciting even if a market doesn’t exist. The most important thing is the clarity of thought of the people in charge and the execution plan. Execution is going to be ten times more difficult and more important to understand than the idea. If you get passionate about an idea and get involved, but there is no logic after that, the plan is destined to tank. Unless there is an in depth understanding of how it is going to unfold, ideas are a little overrated.",
      "SS : What has changed since you started up to now. Has it become easier because of the awareness or is the competition a deterrent?",
      "RS : I don’t think the competitive environment is an issue because with increased awareness, new sectors open up. The entrepreneurial ecosystem has definitely changed. I think it is much more out there and today, being an entrepreneur doesn’t put you in the category of second class citizens like it used to. During my time when one was starting up, people felt that nobody wanted to hire you so you had to become an entrepreneur. Most families still feel that security will only come with a job. So from the perspective of socio economic reasons, it sounds like a very high risk endeavour. Therefore the ability for you to get support from family, is challenging. In a western context, it is much easier because at 16, you move out of home and study somewhere else. The ecosystem in the Indian culture is such where you stay in a joint family till quite late. So the obligation for you to listen to elders is much higher. The things you learn when you have actually moved out of the house and are genuinely independent at 16 makes it easier to be an entrepreneur at 21. You have the conviction to convince your elders about being able to survive alone. But today, the big challenge still is the risk factor and how everyone perceives entrepreneurship. The security of steady income is still very attractive. You need to have a very high threshold for risk to become an entrepreneur. It is not an environment where people will encourage you and say, “Don’t you want to start something of your own?” It also reflects the fact that we don’t have too many great role models in this country. Role models invite you and make you passionate. We definitely have a few, but its too few for a country of 1.3 billion. Similarly in sports, we do have role models but its just 10 or 15 of them. These are not enough top inspire a country to take up sports as a career. I brought up sports because there too, you are becoming an entrepreneur of sorts. You are taking a risk to train at the cost of a job and hoping that you’ll be able to make a professional career out of it.",
      "SS : You belong to the era when if you wanted to start up, it was your own savings or your family’s. Does external funding douse the fire of success since it is not your own money which is at stake?",
      "RS : The problem with external funding is two fold. Firstly, people feel that until they get it, they cannot start. People want to become entrepreneurs and the only reason they are not is because they haven’t got funding. This is absurd because if you want to start something of your own, why should funding stop you. You should cut your coat according to your cloth and get on. Secondly, the earlier you get your funding the sooner you reach the crossroads to decide what business are you building. Most of the times when you are raising funds, you are concerned about how somebody else is going to view your business and what they’re looking for. But it is not relevant. Investors are coming to help and support you for your idea, it should not work the other way round. If you are starting to build a business based on what your investor wants, then your incentives are skewed and it is neither your vision nor the investors. That today is the biggest risk when you are raising funds at the early stage because you have already started to cater to what you think somebody else might want from your business. You are already compromising your vision for the company and that is a major disaster. That is why if you can get your business some distance on your own resources, it is a good idea.",
      "SS : Many students get bit by the entrepreneurial bug while still in school or college. What is the right way to satiate that hunger? Work then startup or right out?",
      "RS : You need to pick up a lot of experience because being bit is very different from going out there and starting up. The probability of you making mistakes on your first time are always very high. So, if you can do it in an environment where there are other people with more experience, it could save you from making half the mistakes you are going to make. The other half, you would at least make at somebody else’s expense which is always better. When you work with a large organisation you probably won’t experience the learning that you want to have to become an entrepreneur. But in early startups too, there is a risk because everybody is learning there. So it may not help your learning curve. You need to be in a company that is at least 4-5 years old and has a good team. Startups like these which have gotten somewhere take care of the risk of decreased learning because of an inexperienced team.",
      "Written bySimrat Singh",
      ""
    ]
  },
  {
    "title": "Vaccines and Viruses : A tete-a-tete with Devika Sirohi",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "Devika Sirohi recently won acclaim for her role in a team of seven scientists and researchers which successfully decoded the structure of the Zika virus. Incidentally, she was also the youngest member there.She graduated, having completed her course in Biochemistry (Hons.) from Delhi University,obtainedher Master’s Degree from the Tata Institute of Fundamental Research and is nowpursuinga Doctoratein the study of flavivirusesfrom Purdue University.She was invited to this year’s  Techkritianddelivereda talk on the looming danger of viruses and how structural studies and cryo-electron microscopy are changing the research on infectious diseases.The following is an excerpt from the interview with",
      "VP: As someone who has studied biological sciences in both India and abroad,in your opinion, do there existdifferences in the approach and perception of the field?",
      "DS: I get asked this question a lot! I studied in TIFR which was a top-notch institute, so I didn’t see a drastic difference, but there are certain cultural differences andthere aredifferences in resources, so yes, therearedefinitelyaredifferences.",
      "VP:A common notion abouteducation in India, especially at the undergraduate level, is that it is more academically rigorous and moreinclined towards soundtheoretical knowledge as compared tothat abroad?",
      "DS: In the US, education ismorecentred on the practical aspectsof the subject.The other thing I really like about the US system is that you keep having exams throughout the semester instead of having a comprehensive exam towards the end. So I think thatthis wayyou learn a lot more instead of studying everything towards the end, which also helps you grasp a lotmore content. They have more opportunitiesto work in labs, even at the undergraduate level. In fact, undergrad students also work with us in our lab at Purdue. I think theystart focussing on researchfar quicker, just because there are more opportunities and really, there aremanymore research labs. I think that’s the difference.",
      "VP: Is biological science a hard field to base a career on?",
      "DS: Biological science has a lot of research going on and that is the reason I think it attracts so many PhDs. Owing to the large number of students working in the field, it is very competitive. Maybe there are fewer exit options out so you go into academia or pharmaceuticals. Like in engineering, there are different ‘branch-outs’ so you can exit a littleeasier. But having said that, the career you are always feels the hardest, right?",
      "VP: From an economic perspective, is biological science something you have to study very hard and very long before you can make a successful career?",
      "DS: That is true, I’ll not deny that. Research is a very long career and you have to be persistent, make a lot of publications because the ‘good academic’ jobs are limited and you have to cut the crack, so it’s very very competitive. At least in the US, I think you survive in science only if you are extraordinary. It’s harder to survive if you are mediocre because the funding for research, most of which comes from the taxpayer’s money, and there is limited taxpayer money, goes to the best groups. But if you are good, sky is the limit, so it goes both ways.",
      "VP: A lot of undergrad students really have no clue about what they want to do later in life. So,how was yourthejourney from BSc Biochemistry to specialized research on flaviviruses? When did revelation strike? Any interesting anecdotes?",
      "DS: I don’t think Ihavehadever made up my mind that this is what I wanted to do and even now I question whether what I am doing is what I should be doing. I think this self-evaluation is important. If you feel for along set of daysprolonged period of timethat what you are doing is not good enough then figure out a different strategy. But sometimes you need to evolve and fit wherever you have to go, so keep your mind open to opportunities and be exposed to different kinds of things. Unless you try new things you won’t know whether you are good. Everything looks good on paper but you have to go and actually do it. So, you have to keep your mind open to opportunities that come and not be pigeon-holed.",
      "VP: Shifting focus back to your field of specialization and the talk you delivered, how susceptible is the world to sudden outbursts of pandemic disease andhow did the Zika virus breakout happenwhy is it that all such breakouts originate from South-Central America, Africa and  Southwest Asia?",
      "DS: Very susceptible. We are fighting a dynamic, unheard-of enemy and sometimes we don’t know what we are up against. As for the virus breakout origins, that’s a really good question. Usually in Africa a lot of people are in contact with animals. So sometimes it happens that a lot of these ‘zoonotic’ viruses make a jump from animal to man. If you cohabitate with animals, some of them evolve somehow and then spread onto men. Wherever there is more contact like in China; influenza, H1N1 and other outbreaks happened as there were a lot of “live-markets”.",
      "VP: Yousaid in your talkmentioned earlierthat this research on pathogens has to be done quickly else these diseases burn out. What does this ‘burn out’ mean?",
      "DS: Burning out means thatyou havethe virus hasinfected so many individuals that they have alldevelopedimmunity against it, soyoucarriersare not spreading the disease actively.  Some diseases like Ebola burn out literally because they kill the people infected, before the disease could be transmitted. In other times if you have 60% or 70% immunity in the population then you do not have enough infected individuals to transmit the diseases. But then it comes up again after 20 years when you have lost the generation of people who have antibodies.",
      "VP: Earlier in your talk, you stated that your laboratory believes in ‘bridging the gap between knowledge of the structure and functions’ . Isn’t it very counter-intuitive that even after you know the inside-out of what something is made of, you still don’t know how it works?",
      "DS: When people decoded the genome, they thought that all the problems will be solved once they had the genome. Now we know the genome and we are not exactly better off, right? Structure does not have all the answers. We still do not know why things that look exactly the same do very different functions. In biology, there is no single answer for everything. You need to couple all kinds of techniques and look at problems from a multi-dimensionalperspective.",
      "VP:What are your thoughts onthe future of infectious disease research and drug research?",
      "DS: I think it looks very promising. It’s going to be hard to figure out which pathogens are going to be a priority. You start with Ebola, so what about the Ebola vaccine, how are you going to test it? What about when an epidemic goes on? How are you going to test the zika virus? Which are the next pathogens we are going to decide upon? Are we going for MERS or SARS, or which one are you going to make. I think that’s the hard part really, to figure out which area to work on But it is a very fertile area, because I think there will always be viruses. There will always be these threats so if you get good at it, there is a lot that can be done.",
      "VP: Any specific field that you plan to pursue in the future?",
      "DS: I think I am going to be associated with infectious diseases. I haven’t chosen what kind of virus I am going to work on, but I would like to go for something that is tractable so you have more technology to work on it and more ranges to work on. That’s my forte, I like viruses whether it’s in making vaccines or any aspect of it. I like fundamental knowledge also, but my best areas are sort of at the bridge between fundamental and application.",
      "VP: Apart from your love for viruses, what hobbies do you pursue?",
      "DS: Well I have given up really and I used to dance a lot and I’m not doing that and I feel I should have not done that. So once I finish my studies, I plan to go back to the gym regularly…I think it’s important to be active and whichever way one goes you should not be giving up on your hobbies. I think hobbies are important and staying with them is as important as anything else.",
      "VP: How does Techkriti compare to the fests you’ve attended earlier? In the US, for example.",
      "DS: They have conferences but I don’t think they have these kinds of talks. I think it’s very new and a nice initiative. I think compared to others it is all student organised and very high-level. Ph.D students would go to a conference for a day but I don’t think there would be a 3-4 day fest so this is very nice. Those are more restricted symposiums. This is sort of like everything… people from all walks of life… I think it is very inclusive…which is very good because people who are attending the festival get to see all spaces and get to know where they fit in best. I wish more people did that because sometimes people just don’t want to see what may work for them, you do not go and seek out the opportunity. You have to try and see what works for you, I think. You shouldn’t hesitate in trying, because you might find something which you like. I mean what’s the worst that can happen, right?",
      "Interviewed and Written bySiraj Singh SandhuandSambhav Mattoo",
      ""
    ]
  },
  {
    "title": "Talking about Religion and Odourless Chemistry with Prof. Henry Schaefer",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "The keynote speaker at Techkriti ’17, Prof. Henry Schaefer is truly a scientist beyond compare. A computational chemist by profession, he is the Graham Purdue Professor of Chemistry at the University of Georgia. Apart from being one of the most cited scientists in the world, his views about religion and it’s compatibility with science make him an extremely interesting conversationalist. Read on to find out what the Vox team chatted with him about.",
      "VP: Could you please enlighten us a bit about computational chemistry?",
      "HS: It’s chemistry without test tubes; odourless chemistry. You can study molecules that have never been made, you can study those which have been made but experimentally unavailable. I could have never have been a practical chemist, as my professor once prophesied.",
      "VP: Of all the countries you’ve visited, and they are a lot, did you find anything particularly different about India and the way we approach a problem in the research environment?",
      "HS: That’s a good question. I think there is in a difference in the following sense. In India the theoretical chemistry community is very rigorous, very theoretical, very mathematical. The theoretical chemists take on mathematics, and they are pretty good at it. There aren’t so many in betweens in the US.  Cultures also play an important role. Japan for example, is very disciplined, whereas in India, China, US things are more wide open. So they’re different. Theoretical chemistry is more or less the same, but different emphasis in different places. For example in France, there wasn’t much contribution to chemistry. They used to argue about questions no one cared about, but it has changed.",
      "VP: On a lighter note, students sometimes find it difficult to maintain a balance between academics and extracurricular activities. Your achievements and your life story reveals that you enjoyed both of these facets to the fullest. Any advice you want to give us?",
      "HS: You need a work life balance. Some people get it and others don’t. Some people work all the time and I think if you work all the time, you hurt your efficiency. You need to have something else in your life. Like the homecoming queen (as he refers to his wife), you need something else besides work. But you do need to work hard. Earlier, when I was at Berkeley, we used to work 80 hours a week. I had to get my research group to a level where they enjoyed each other’s company. Now I work only 50 hours a week. Once the research group starts to have its own identity, it’s not as hard.",
      "VP: Was there a time when your research hit a dead end? How did you deal with such situations, if there were any.",
      "HS: I never saw a dead end in theoretical chemistry, because when I started, things were so bad they could only get better. It was so bad that when I was trying to choose a research group, one of the professors I wanted to work for (once a theoretical chemist himself, now an experimentalist), said “No, I am not taking theoretical students anymore, they won’t be able to do anything bigger than Lithium Hydride. A diatomic molecule with four electrons.” So, the future was always very bright. And it’s been pretty steady, getting better and better.",
      "VP: What’s your favourite project you’ve worked on?",
      "HS: I am really excited about the project we are working on now. We are working on a molecule called cyclooctatetraene. (And then he asked us if we knew any chemistry at all, and thankfully we did) We seem to have coincidentally come across a completely different structure. The paper is almost ready with only a few computations to go, but apart from that, I am very excited about this.",
      "VP: We found some very interesting references in your talk about Christianity and religion. It’s so rare among scientists. There is a general conception that science and religion are at odds. What is your take on this?",
      "HS: Most of the great scientists were Christians. Historically, there has been some good faith. There are some atheists now, no doubt about that, but they are in the minority. Most scientists believe in God in some way. So I don’t think there is a conflict.",
      "VP: But the concept of God itself, you can’t possibly say that it stands up to a scientific enquiry.",
      "HS: Let me disagree with that a little bit. There is a particular type of science I am interested in, we might call that real time science. A hallmark of this is reproducibility. People read our paper and try to reproduce the results. Now if we do something great and it’s reproduced, we become famous. But if we do something that we thought was great and is wrong, well, that’s not good. So this was real time science. Now there is a completely different type of science, other than what we do, historical science. You know, we can’t reproduce extinction of the dinosaurs 70 million years ago. It happened once; it had something to do with an asteroid hitting the earth. So we have the idea but it’s not reproducible. The big bang, you wouldn’t want it to be reproducible. Similarly when we talk about the spiritual world, it’s ok to talk about both, the parts of it that are observable scientifically and the historical part. The historical part of Christianity is life, death and resurrection of Jesus Christ. So I think that there is an analogy, between the way we think about the spiritual world and the way we think about the scientific world. In Christianity there is evidence, NOT proof, for the existence of God. And we have faith in science. We believe that mathematics is true. We believe the scientific method works. There are lot of things we believe. We believe in Coulomb’s law. These are all things we believe in based on evidence, and not proof. They are the axioms which cannot be proven but are true.",
      "VP:  Can you tell us about what made your conviction so strong?",
      "HS: I was always looking for something. I was always curious. I always believed that nature was orderly and comprehensible. I just had these ideas vaguely, though. I was searching for something. I wasn’t searching very diligently, but I was searching and eventually I was found by God.",
      "VP: So do you have any message for us?",
      "HS: Work hard, is all that comes to mind. And it was wonderful being here. I would say that you should interact more with these people who deliver you the talks. We all are here because we love students. So my message is that you walk up to them, ask questions and you’ll learn a lot. It’s a great opportunity. I’ve been asked to go to many other institutes, I was asked to go to deliver one in IIT Guwahati, in IIT Roorkee, these Techfests seem to like me (chuckles). There was some controversy during my initial visits, and I think they like that. I think they like the students to be thinking. And I think it’s good to question.",
      "Interviewed byAditya Jain,Shashank Gupta",
      ""
    ]
  },
  {
    "title": "“Donald Trump’s policies might slow down Global Warming” – Richard Muller",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "One cannot help but be impressed when they hear about Dr. Richard Muller – particle physicist, Earth scientist, professor emeritus, mentor to a Nobel prize winner, climate change skeptic, global warming activist, entrepreneur, consultant, writer, avid blogger, hiking enthusiast and a racquetball player. Naturally, we at Vox Populi were eager to find out – what exactly makes this man tick? Our conversation with him covered a variety of topics, from the Indian research environment, the ideal work-life balance, to Trump’s policies on the world energy crisis and climate change.",
      "An Indian PhD Student",
      "Having interacted with the Indian professors and students at IIT Delhi, NIT Trichy and IIT Kanpur, Dr. Muller feels that the primary difference between the research scene in India and the USA is that there is a much greater focus on the engineering aspects, as compared to fundamental science in India. This in turn means that the Indian students have a more analytical approach to science, with a greater emphasis on problem solving. Seeing it as a conscious decision taken by the country, he feels that it is paying off really well, and reflects directly in the choices made by the Indian students who go abroad for further studies, with a considerably higher number of them going for PhDs in applied sciences. Ultimately, however, he feels that there is really no difference between the students from India, and those from the USA. “The fundamental love for science, which is present everywhere, unites people across nationalities, backgrounds and areas of specialization”, he says, “the similarities are much greater than differences. It is part of what makes science so beautiful – it is universal across all cultures.”",
      "Perspective on the Education System",
      "Having served as the Chairman of the admissions committee for graduate students multiple times, Muller has always emphasized on admitting students with a broad background. He says, “A well-rounded education is fundamental for a graduate student, as opposed to proficiency in just Math and Science. The student must be good at writing, speaking, basically, anything that shows the ability to express oneself. These qualities are essential for a fundamental physicist, in my opinion. When you are trying to do something different or contradictory than what has been done before, you need to be able to convince others about your ideas. While getting the right answer and discovering surprising things is great, it may not always be enough.” This is something that he feels tends to be under emphasized in the Indian curriculum. He goes on to say, “The admissions committee is always looking for people with an experience of doing things. Students who just like to think and live out of the laboratory, we don’t accept too many of those people.” He feels strongly that the importance of experimental work should never be disregarded. “The people who truly love their subject, and discover important things, are the kind that like to do things with their hands, the people who know how difficult it really is to build something and make it work. And some people don’t like that, they aren’t comfortable in the lab. If you just want to do abstract theory, then we aren’t too interested. Theory is what you do as an undergraduate. Most of the important things come from people who work with their hands.",
      "Focus",
      "Muller says, “I believe early focus is a mistake. You can imagine an athlete who focuses completely on running a 100m track. Even if he devotes all of his time to practicing, odds are, he’s not going to win the Olympics, or maybe even the track meet. But afterwards, when he doesn’t win, he’s not left good at anything else.” He goes on to say that a challenge that we all face here, at the IITs, is having to decide early what we are going to do, which can often be harmful. He is of the opinion that we should get to study a broad range of engineering subjects, and only after we are familiar with a lot should we specialize. This way, we’ll be able to bring in ideas from one discipline to solve problems in another, enabling us to contribute more to the subject. “Early focus may help you get your first job, and that’s why there is a lot of pressure. However, if students get a broad education, they can go much further in the end. But you don’t have that option.” Dr. Muller believes that diversifying interests is important not just in academics, but also in life in general. He says that activities like hiking, which he is a great fan of, help him achieve a spiritual peace, a peace which gives him the drive to approach his projects with renewed vigour and enthusiasm. “For every hour that I hike, I gain two hours of research…I hike at least twice a week. I think I get more done because of it.” He believes taking care of one’s body is just as important, which he does through regular sessions of racquetball. He says the mind cannot do much if one’s body is not well-taken care of, for they are ultimately parts of the same whole. And the best way to take care of one’s body, he feels, is through sports – where a healthy competition makes you enjoy exercise so much, you don’t even realize you’re doing it.",
      "Quora",
      "“I believe that a fundamental instinct in all humans is not just to have children, but to teach and raise them. When you nurture a child and see it grow into a productive human being, it gives you enormous pleasure. This is the kind of joy that you get out of teaching. If you’re truly devoted to it and care about your students, you can see when they’ve learnt something – their faces light up, it’s a wonderful experience. I’m not teaching anymore, and I think Quora has substituted that experience for me. When I give a piece of advice on Quora, and people write back with their appreciation, it makes me feel really good inside. In a way, it’s a spiritual experience, to have helped somebody – and to me, that truly is one of the most rewarding things one can do in his life.”",
      "Popularising Physics",
      "On asking him on how he feels about popularising physics through Quora, he says, “It’s the scientist’s duty to popularize science amongst the public. After all, they’re the ones who are paying for his research. So he has a responsibility to make them understand what he’s doing. It is not enough to say that he will make discoveries which will make their lives better, and thus pay his debt. I firmly believe that to popularize physics, what all physicists need to do is convey why they enjoy it so much. I think most people do find physics interesting, they’re just intimidated by not being able to understand it. But that’s where the physicist comes in – it is part of his duty to help them understand.”",
      "Dichotomy between Career and Personal Life",
      "A common cause of concern for almost all of us, Dr. Muller says that there shouldn’t be a choice at all between career and life. He says, “Life isn’t easy, but extreme specialisation is not the solution to it. You may think you’ll be better off by specialising only in your career completely, but that is not true. The most successful and the most productive scientists are those which have a happy family life.”  Speaking about his experience, he says that as many as 30 people have worked under him and he has always made the effort to ensure all of them have a happy family life. “If they’re sacrificing their family life for their career, their career isn’t going to go very far. You have to balance them. It’s bad to focus on one or the other. It is difficult, but it can and must be done.”",
      "Trump’s Policies on Renewable Energy Sources and Global Warming",
      "Dr. Muller is known for his unconventional stances on climate change and global warming. He is of the firm opinion that renewable energy sources are not the solution to global warming. Hence, even if Trump’s policies sideline them, it may not matter after all. “What matters is the stress that he claims he will give to nuclear energy and natural gas.” He finds it misguided and misinformed to say renewables can solve the problem of global warming. They are too costly and inefficient and will not develop fast enough to reach the level where they can counter the effects of global warming. He finds it highly ironic that although Trump does not believe in global warming, his policies could do much more to mitigate and slow down the effects of global warming than Obama’s policies ever would and ever did. “Though Obama is a strong believer in global warming, his plans would have only encouraged China’s reckless and unsustainable growth. His plans had no slowdown proposed till 2030, until when it would have been too late. But Trump’s policies will effect a slowdown, which will provide the world with some breathing room to come up with a solution to the problem.”",
      "Combating Global Warming at Berkeley Earth",
      "Dr. Muller and his daughter have been trying out “the engineering approach” (rather than trying to target countries and assign blame) to find a solution to global warming, without placing specific burdens on any country, at Berkeley Earth. “Global warming is real. CO2 emissions are increasing, but from where? – China, India and developing world. The solution to this cannot be to ignore these countries and focus on reducing your own carbon footprint. Developing nations will develop and generate CO2 in the process. So a solution must be found which will allow these countries to develop in a sustainable way, while reducing the emission of air pollutants and other causes of global warming.” In his opinion, three things that he considers necessary for combating global warming include",
      "He finds solar energy to be an overly hyped concept. Statistically, solar energy meets 0.04% of India’s total energy consumption, and 0.06% of China’s. He says, “To believe in solar is idealistic. As scientists and engineers, we cannot afford to be idealists. Look at China for example. China has been heavily subsidizing companies that are going into solar power, but these are going to go bankrupt as soon as the subsidies are removed.”",
      "With this, our twenty-five minutes with this extraordinary gentleman who inspires generations with his witty and heartfelt observations came to an end. Even with his parting words, he impressed us with his intelligence, sincerity and thoughtfulness. In this short span itself, he managed to infect us with an irrepressible energy, and we came to understand how this man manages to achieve success in such a wide variety of fields. His ideas made us question the very stereotypes and assumptions we base our lives around. It felt refreshing to come across a broader outlook and realise how someone who’s determined to live their life with energy, love and passion for himself, can. We hope our readers found this interaction as stimulating and inspiring as we did.",
      "Written byShashank Gupta,Shruti Joshi",
      ""
    ]
  },
  {
    "title": "Re-Monetization?",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "“Hide your white money for a black day”,this Arabic proverb perfectly explains the situation faced by the country on the eve of 8th November when PM Narendra Modi, in his address to the nation announced the demonetization of Rs. 500 and 1000 notes currently in circulation, effective by midnight that day. He also introduced the new Rs. 500 and 2000 notes brought in place of the banned currency.",
      "This new move by the government included measures to protect the interests of common citizens. The old notes could be deposited in bank accounts till 30 December while the Rs. 500 notes could be used for transactions in certain places till 15 December, Rs. 1000 notes could not be used for any transactions except being deposited in bank accounts.",
      "Even though the government claims that the measure was taken to curb the menace caused by counterfeit currency used for terrorism as well as to destroy the black money in the country, this measure met with huge criticism for its mismanagement and lack of organization with our previous PM Dr. Manmohan Singh calling it a“monumental management failure” and a case of “organised loot and legalised plunder.”",
      "Vox Populi had the opportunity to interact with Prof. Surajit Sinha of the department of Economics at IIT Kanpur. He shares his views about the step taken by the Government.",
      "“We in India have a currency economy. And in such an economy holding cash is a normal practice. Everyone, be it businessmen or working professionals, have cash. And having some cash is necessary for day-to-day transactions. But the large amount of unaccounted cash that isn’t used and is stored without the knowledge of Income Tax Department can be classified as black money. The main problem with black money is that the government doesn’t get the tax revenue on the unaccounted wealth.",
      "I think the main motive behind this move is to destroy some of the black money possessed by the people. I don’t think this measure will help in preventing the accumulation of black money in future.",
      "But even the idea of destroying black money by demonetizing currency notes comes with an assumption that all the black money in the country exists in cash form, which is obviously not true. A lot of black money is stored in the form of investments in gold, property, etc. The value of these goods is index to inflation. So, as inflation increases, their prices increase too. Contrary to cash, the value of which may decrease with increase in inflation.",
      "One of the reasons why property prices had been going up for the past couple of years was due to the large amount of unaccounted money flowing into the industry. For the same reason, the property prices may go down after the demonetization of currency.In the real estate industry, making receipts of value less than the original prices of the property is a regular affair to cover up the balance money which is unaccounted.So, if the government wants to hit black money hard, then demonetization won’t do much.",
      "On the other hand, even demonetization doesn’tstopthe generation of black money as the new currency is not going to be replaced for a long while now.",
      "One remarkable thing about this scheme is that there is no penalty for black money holders turning in their wealth. Although there will be high tax rates on the money being deposited.",
      "Another aspect of demonetization is the implementation of this policy and the problems caused by this.",
      "In rural areas, most people don’t have bank accounts and the number of bank offices are less too. So the people would face a lot of difficulty in getting their notes exchanged. Even in the urban areas where the number of ATMs and bank offices is high, a lot of commotion can be seen in the lines outside bank ATMs.",
      "The daily wage workers who get their salary on a daily basis would be facing a problem in exchanging the money possessed by them in older denominations. Because given the situation outside banks, for them standing in a queue means losing out a full day’s wage. In the case of shopkeepers, the bank is making a deviation from its limit of Rs. 4000 a day allowing them to exchange more than Rs. 4000 into new currency as they need cash for their businesses. But a business owner is not given such privileges. So, they won’t be able to pay their workers working on daily basis. A lot of people will go unpaid, especially the poor section of the society.",
      "So, in the short run, along with black money holders, other people including poor people and people in urgent need of money are going to be affected.",
      "My son, being sick, had to be hospitalized and the money I withdrew before the demonetization of currency is now worthless for the private hospital where he is admitted. There is no facility given in the banks for the people facing such emergency. I remember a daily wage worker whose wife had been admitted to a nursing home in Kalyanpur Hospital, and the bill after a week came out to be Rs. 33000, an amount quite huge for him. Even though the faculty members want to help him financially, we are facing difficulty due to shortage of cash. So, this move can bring inconvenience to people in urgent need of cash.",
      "Now keeping these personal opinions aside, the main concern I have regarding this is that the economy would be hit hard. A cash economy like ours works on the basis of spending, because by spending, we generate income for someone and the person in turn spends the cash again, generating income. This entire process of spending will slow down tremendously ultimately affecting the country’s GDP and the real economy of the country in short run.",
      "Even though in the long run, this would allow the RBI to have an estimate of the amount of black money destroyed by this step comparing the number of notes returned by the given deadline with the number of notes in circulation according to their database. The addition revenue generated by taxing the black money being deposited into bank accounts is also a plus point. But there are huge amounts of costs involved with this too. People are dying in hospitals because of the shortage of cash, in lines outside ATMs to withdraw cash. There is even an added cost of printing the new notes. I believe that the government must have had an estimate of cost of printing new notes and the revenue generated from tax. So, there is no net cost to the government while there is a net cost to the society in the form ofOpportunity Cost. But the main goal to be achieved in long run, something the government has not been able to achieve is curbing the generation of black money. Something which requires an efficient set of guidelines and staff to implement.”",
      "",
      "On being asked about his views on a similar ban on Rs. 1000 notes imposed in 1978 by the Morarji Desai Government, these were his remarks.",
      "“At that time, the real value of Rs. 1000 notes was very high as compared to now. So, only a small section of the society possessed those notes and henceit was not costly to the societyto demonetize those notes. At that time, the common man was not affected adversely. But now, even the poor sections of the society may possess Rs. 500 notes which poses a problem for them. Rs. 500 and 1000 notes have become a common currency for many which is why the demonetization of these notes brings high costs to the society.”",
      "Will this affect the value of currency in the world market?",
      "“The value of currency is basically its purchasing power. As inflation goes down, the value of currency will increase. With this measure, people will naturally purchase less bringing down the demand of the goods.This may bring down the prices of goods assuming the supply function to be the same. Just like in the property business, theproperty prices may go downwith a lot of unaccounted money flowing out of this industry. So, in a way, thevalue of currency may actually go up. But the decrease in expenditure will affect the real economy hurting the GDP growth rate of the country.”",
      "Has the government taken any preventive measure to curb the laundering of black money?",
      "“Not many spectacular reform measures have been taken, however some small acts have been passed regarding import of gold and taxes on the same. This is done because people now would buy gold using their black money and try to convert their black money into white through assets like gold. People were buying gold even with their white money because they didn’t find confidence in spending their money or investing it elsewhere. Even the transactions in the bank have become more tedious as compared to before. If I try to withdraw a large amount of cash, the cash teller asks me to reveal my PAN card and get it verified. The system has information about all my transactions which are being monitored before verification. The government is definitely trying to reduce money laundering through the public sector.”",
      "What do you think about the casual savings done by people which may get piled up to a limit that it may be considered as black money?",
      "“Simple casual savings is usually done by housewives, even my wife does that. Now if these savings cross a certain limit, then the money when deposited may raise concerns. In that case, we may have to provide justification about the money. “",
      "Anything else you would like to say about this measure?",
      "“I would like to say that I am not against any political party, in fact I would like to say that the government is going some really good work. But the demonetization will just remove the symptoms, black money is still plundering our country like a disease.”",
      "Written byRicheek Awasthi",
      "",
      ""
    ]
  },
  {
    "title": "In conversation with: Vikas Swarup",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "Vikas Swarup, best known as the author of “Q&A”, which was later adapted into the Oscar winning motion picture “Slumdog Millionaire”, is the official spokesperson of Ministry of External Affairs and recently visited our campus during Techkriti’16. Following is our conversation with him regarding his book Q&A, MEA , India and much more!",
      "VOX POPULI:How has your experience been at Techkriti’16 and IIT Kanpur so far?VIKAS SWARUP:I find the IITs enormously inspiring, because the creme de la creme from the young generation have come to the premier technological institutes in the world. I don’t say top institutes of just India because I rate the IITs as high as say for example MIT. If you look at the top CEOs in the world, of Indian origin, many have come from IITs. It’s a different matter that they found success in another country and not our own. The fact is that the base for their achievement was set by the rigorous academic discipline that is characteristic of the Indian institutes of Technology.",
      "So whenever I get the opportunity to come to an IIT, I do that. I’ve been to IIT Delhi, IIT Guwahati, now I’ve come to IIT Kanpur. I wanted to come IIT Kanpur as my wife is also from Kanpur and I’m from Allahabad, so there was this emotional attachment as well.",
      "VOX POPULI:Your diplomatic career has been mostly hidden from the public eye and you are recognized primarily as an author. Did you find it hard to reconcile with the fact of your passion gaining more recognition than your profession?VIKAS SWARUP:But that’s the way things are supposed to be! Bureaucrats are the faceless people while the ministers get to be the face of the government. This is where lies the contradiction between a writer’s role and a diplomat’s role. Writers are required to be out there promoting their work. Daphne du Maurier famously remarked that ‘Writers should neither be seen, nor heard. They should only be read’ but, that time is gone. These days writers are now much more in the public eye than they used to be but they still have their anonymity. Being a writer, save exceptions like Chetan Bhagat (laughs), you are not immediately recognised in a crowd. Take for example Stephen king, do you remember his face? No, you know his works.",
      "VOX POPULI:In one of your interviews you said that you’ve never actually visited Dharavi. So how were you able to depict it in such detail in your book Q&A?VIKAS SWARUP:The thing is that all of us Indians have seen slums. In India, you cannot live on an island, isolated from your surroundings.. Even if you are in a five star luxury flat, driving a Mercedes, when the car stops at traffic signal, you’ll find beggars there. The lives of the rich and the poor constantly intersect. So I had not seen Dharavi, but, I had seen slums. To compliment my experiences, I read about Dharavi. I read a book by Kalpana Sharma, books by other writers, saw pictures of Dharavi. In my mind, I tried to imagine Dharavi and I wrote from that perspective.",
      "VOX POPULI:While writing your first novel, you completed it in a short span of two months. So how were you able to manage your time between your diplomatic commitments and passion of writing?VIKAS SWARUP:If you have the passion then you find the time. At that time I was posted in London, was the political counsellor and the Second Gulf War was being fought. So I was required to report everyday. So from 9 to 9, I would be in office and then I would do research, late at night. I would write only on weekends. So I wrote this novel in actually eight or nine weekends.",
      "The whole idea came to me as a package, and the advantage of your first novel is that you write un-self-consciously. When you write subsequent novels, you compare it with the first one, in terms of sale, appreciation, acceptance etc. But when you write your first novel, you have no concept of success or failure. My first novel took 2 months, the second and third took 1 and ½ years and then it regularly took about the same time.",
      "VOX POPULI:In continuation with the previous question, the concept of having Q&A background was clear to you, but how did you choose to include the slums?VIKAS SWARUP:Slums were indeed very important, because for me the eureka moment was when KBC began. In KBC, the organisers themselves say, this is not about your knowledge, it’s about “Do you know the value of money?” I wanted to show that the person who comes for the show, has no interest in money, on the top of it, he is not even literate. Because my main aim was to show, “That the biggest teacher in world is life itself”. Schooling is one aspect of learning but what life teaches you is completely different and the ones who are able to pass the school of life can face any situation.",
      "VOX POPULI:You have worked for the Foreign services in various countries like USA , UK , Japan , South Africa … What difference have you observed in the work cultures between India and these places? Where can we improve as a nation?VIKAS SWARUP:The advantage of having worked in foreign countries is that you get a yardstick to compare your own country against. The countries I have worked in lie at both ends of the spectrum. There have been countries India can take inspiration from and there are many for whom India is an inspiration. India has shown the way to the world in areas like Right to Information and the Green Revolution.Every country has its merits and demerits and it is not prudent to cut and paste policies across geographies.",
      "VOX POPULI:Many students here at IIT Kanpur choose to become IAS officers but IFS doesn’t seem to be top on the list for them? How would you like to inspire these students to seriously consider IFS as a career option?VIKAS SWARUP:Being the head of the External Publicity Division of MEA, I am aware about this issue and to take care of it, the ministry is releasing a video titled ‘WMD – What ministry does’. The film Airlift did bring the ministry some publicity by depicting that they had a role to play in the evacuation. The problem is in the lack of appreciation for the work done by the MEA. People feel that the only thing we do is ‘protocol and alcohol’. Ninety percent of the people don’t even know that the MEA and not the MHA issues passports.",
      "There is immense satisfaction associated with the job. What bigger responsibility than representing your country in a foreign country and upholding the respect of the flag on foreign soil. Today’s globalised society gives immense opportunity to serve your nation’s interests through the implementation of foreign policy. One of the most important areas where we make an impact is security of the nation. The terrorism in Pakistan directly affects India and we need to take measures to stop that from happening.",
      "",
      "Interviewed bySimrat SinghandMayank Chauhan"
    ]
  },
  {
    "title": "In conversation with: Dr. Lyn Evans",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "The director of Linear Collider Collaboration at CERN talking about LHC, why Physicists hate “the God particle”,  India, importance of Science and much more",
      "Vox:You’ve been to India quite a number of times. What are some of the things that excite you about India?Dr.  Evans:I have been to IIT Madras, IIT Bombay, IIT Guwahati and visited India many times during the collaboration for Large Hadron Collider. So, I know quite a bit of India and Indians. I think India is a great country. For the past twenty years of my work, I have been visiting India and actually a lot of things have changed. Now India is technically a very advanced country and I find that Indian students like you people are very enthusiastic and bright.",
      "Vox:How was your life as a college student and what were the things you were involved in, and the subjects you enjoyed the most?Dr. Evans:Well, during my college life I had always been interested in science, especially in laser physics, before I moved to particle accelerators. After that I spent my whole career working on CERN’s great projects. And the last one in which I was responsible for the design and the construction of the Large Hadron Collider, was the most interesting and most challenging.",
      "Vox:We came to know that you found it difficult to pass the O’ level examination in French for getting admission into university. What is your opinion regarding the importance of language and other non-technical skills for a physicist or a scientific leader?Dr. Evans:Well, for me it is essential. I think that CERN in its very nature is a mixture of French and English. I probably spend most of my day speaking French, not English. That’s a particular case of CERN. But science is getting more international these days, and we have to admit that the common language of science is English and so a good command of English, is essential for science.",
      "Vox:Apart from the sciences were you interested in any other disciplines?Dr. Evans:I was interested in history and also in all other disciples of sciences. I was fascinated by biological sciences and astronomy. I also have a small telescope.",
      "Vox:What was the spark which ignited “Physics” in you and motivated you to lead a team of around two thousand engineers? It might would have been difficult to coordinate and guide those intelligent minds to develop something which seemed to be impossible till yesterday, how did you do so?Dr. Evans:I think doing a big project is a mixture of physics,engineering, and also politics. There is a lot of politics involved in getting the money together to make this project and getting the cooperation of other countries outside of the twenty member countries of the CERN. India was one of them along with Japan, Russia, United States. It was a whole mixture of science, engineering, politics. And it is said that if you can be a physicist, you can be anything!",
      "Vox:How do you think that economic situations and politics of a country impact the research of a country?Dr. Evans:Well, you see, that when the LHC project was approved in 1994, that was a time of very bad economic climate in Europe. It was the time of reunification of Germany. There was a maastricht criteria, where all governments had to push their budgets as low as possible. But they still realized the importance of international collaboration in science and the Large Hadron Collider. So I hope that it would always be the case, there always will be problems somewhere in the world, sometime. But in spite of that, these big international projects are very important.",
      "Vox:How do you think that this knowledge of fundamental particles can transform the life of a common man, and what do you see as the future of scientific community and humanity as a whole, after fifty years or so?Dr. Evans:Humanity as a whole is very difficult to note. We are following from time immemorial, a quest for new knowledge. We could have stopped in the Stone Age and not progressed. What we do is very sophisticated and it is very difficult to explain Higgs Boson to the general public. But nevertheless, what we do has huge spin-offs in the World Wide Web. All the technologies that we are developing, we must never reside. We did not set out to build the World Wide Web, we built it because we needed it and that profited the society. Ours is a more indirect way. I think that there are two other aspects that are extremely important: one is education, inspiring young people through these big projects, it’s not easy these days in Europe and America. I don’t know about India. But you need to get more young people interested in science, second is bringing nations together. And I think we do much better job than United Nations at it.",
      "Vox:Thanks to you and people like you that we now know that the God Particle exist. But what do you think about the existence of God himself? That has forever been a debatable topic.Dr. Evans:I am not going to give my views on existence of God. First of all,“God Particle” is a stupid name, we physicist hate it. It was coined by Leon Lederman, who is actually a friend of mine. Leon wrote a book, and the best way to sell a book is to give it a sexy title. And so he called it as God Particle. There is nothing God-like about it. Except, it gives mass to other particles, so it is on a different level.",
      "",
      "Interviewed byPratyush RaiandMegha Agarwal"
    ]
  },
  {
    "title": "In Conversation with Porter’s founder: Vikas Choudhary",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "How was Porter born?",
      "It all started with Pranav and me spending our free time discussing potential startup ideas while Pranav was at JP Morgan. Our first serious idea was to organise the black and yellow cabs in Mumbai but as we dwelled on that idea, the ‘unionbaazi’ emerged as a big hurdle and the realisation dawned that Ola would eventually enter this space. So it was a no go. We then noticed that the tempos plying the streets were disorganised and the market had great potential.",
      "To start things off, we talked informally to the tempo drivers and tried to understand the business. Questions like ‘number of trips per day’, ‘wage per trip’, ‘usual customers’ gave us a lot of insight. We noticed that the problems they were facing were much more complicated and numerous than the cab drivers. So, the challenge of an unexplored and convoluted market convinced us to dive into it. We began work on this project in February, 2014 and spent our time till August, researching. It involved more serious surveying of the drivers and meetings with potential customers like shopkeepers and even larger institutions like ITC.",
      "",
      "“ThePorter is a revolutionary approach that makes intra-city pickups and deliveries thoroughly efficient and reliable. We have a varied fleet of vehicles under our command, ranging from Tata Ace to Tata 909, spread all over Mumbai. Our partnered drivers are tracked on real-time basis, ensuring that a mini-truck that exactly satisfies the customer’s requirement is made available to him, within 60 minutes. We intend to give structure to this largely unprofessional and unregulated industry. It’s as simple as calling a cab: Just go ahead and give it a try.”",
      "When were you bitten by the entrepreneurial bug?",
      "I always had the entrepreneurship ‘keeda’ and was sure that I wanted to do something on my own even before entering IITK. I tried to satiate this hunger by exploring some startup opportunities while on campus but nothing materialised. I even attended lectures conducted by the E-Cell but there wasn’t much to learn there. One thing that did remain constant throughout my stay in campus were the late night ‘bullas’ on startup ideas. I would listen to my friends’ ideas, share my own and hours would be spent in this process. These sessions helped immensely in preparing us for the ideation process of ThePorter.",
      "How did you secure the all-important funding? Any memories of feeling intimidated?",
      "I have to admit that we were lucky when it came to securing funding. Big names in the industry like SAIF, Nexus had just started doing smaller rounds. A friend of ours was an analyst in Nexus and through her, Nexus approached us. At this point, we were not even looking for funding. We met with the MDs of all the big firms but it turned out that we were too small to secure backing from them. We got introduced to Kae Capital through SAIF and received our first funding from them.",
      "I would say that securing funding is indeed a bit daunting but we overcame it by being well prepared. Instead of rushing out to grab funding, we sat down and acted as the Devil’s Advocates for our startup and found solutions for all the foreseeable roadblocks. The people in charge of the VC Funds have a strong hold on both numbers and business. They can catch an unprepared pitcher in minutes and as soon as you fumble to find an answer to their question, that’s where their interest ends.",
      "This is where all those hours of ‘bulla’ and the extensive ideation during our time at our respective years helped. We had gone over all possible situations and had a ready answer for every question thrown at us.",
      "It must have been an awesome experience starting up. What are the important lessons you have been able to take back?",
      "The first thing that I realised was that prospective founders should start saving money early. It really helps when you need to bootstrap in the early stages.",
      "Being a young company, we have not faced too many problems till now. The biggest obstruction to operations till now was the opposition from unions. We had to shut down a large percentage our operations due to this issue. They leaders were not happy about us organising the sector because it would diminish their nuisance value. After all unions are all about gundagardi. To solve this issue, we hired a guy who would handle the meetings with the union leaders since we had no experience in interactions of this nature.",
      "It did not seem like the leaders were in any mood to compromise their stand but we kept holding these meetings. In each of these we made it a point to meet the drivers personally. We tried to convince them of the advantage of signing up with our platform. The perseverance finally paid off as we got some drivers on board, inspite of the opposition from the unions.",
      "Forgive me for this cliched question about family but I would still request you to answer it.",
      "The cliche exists for a reason. I come from a service background which has nothing to do with business. When I first broke the news, it came as a shock to them. But the atmosphere in the country at that time worked in my favour. Television advertisements were dominated by Flipkart, Snapdeal and other startups. This instilled some confidence in them but they were still reluctant. They had no idea about the technical aspects of startups like funding so it aggravated their apprehension. Finally a deal was reached in which I promised to give ThePorter time only till March ’15 and no more. The rest is history, I guess.",
      "All of our readers would love to hear of your life at IITK. Could you share some experiences?",
      "The boring stuff first. I graduated from the EE Department and had an interest in Communication Theory. Finance was also something that captured my imagination while at IITK. I was around resident of Hall 5.",
      "",
      "I tried to experience as many things as possible during my first year. I took part in the Nukkads during Dram Eve but had to give it up after the first year because of academic commitments. Apart from this involvement, I juggled a lot of other clubs but did not pursue anyone seriously. Coming to the festivals, I had some organisational role in each of the three. I was the PR Head in Techkriti and the FMC Coordinator in Antaragni. Honestly. I used to enjoy Techkriti more than Antaragni.",
      "Being in the PR Cell, I got to interact with extremely interesting personalities from all around the globe. Going to pick celebrities up from the airport and showing them around the campus was a high point of every Techkriti.",
      "My first year was the most eventful. Hall 5 had been converted to a UG hostel just a year ago and a lot of effort was being put into developing a ’Hall culture’. I got involved in this process heavily and was instrumental in establishing inter wing events like Voila, Vertigo. Ian interesting responsibility was being entrusted with finalising the name for the Fine Arts night, which would eventually be called Voila. My interaction with the HEC was quite frequent and the President was heavily into dram, so my induction into dramatics was mostly through him. I also became a student guide in my second year and was able to make friends in the junior batch as well.",
      "My first year wing was C-Top and there was an interesting story about Narayan Murthy having lived in the room directly beneath mine in C-Mid. The one thing that stays with you forever are the experiences with the wing mates. We had a lot of fun in the wing. The bulla sessions and poker nights will always be etched in memory. We also made wing trips to Nepal and Lucknow. At that point we had single rooms in Hall 5 and the double rooms were decided through lottery.",
      "",
      "Dare I ask IITK vs. other institutes when it come to entrepreneurship?",
      "I have felt that the academic talent, especially the CSE prowess, is more in IITK. But the enthusiasm for starting up is definitely lacking. Students here gravitate more towards the ‘safe’ option of jobs in big firms. Kharagpur, Bombay and even Madras do better in this regard. The culture in IITB can be explained due to the proximity of Powai but KGP is still a mystery to me. IITK has produced some exceptional entrepreneurs but for some reason they are not able to inspire the next generation. The PR is a bit weak on campus and the stories of success of Alumni do not reach here. I feel some of it also has to do with the image of IITK which is viewed as a purely academic institute with no inclination towards entrepreneurial endeavours.",
      "Bacchhon ke liye kuch fundae?",
      "The biggest lesson I wish to convey is ‘ Don’t waste your time’. There is no dearth of activities on campus. If academics interest you, do that, if a club excites you, join it. You will only feel regret later when you look back if you don’t make use of your time now. I really regret not doing the joyrides that were available on campus back then. Activities like these cost a fortune outside the campus. Do something with you time and experience everything. Make lots of friends on campus because these people are going to become invaluable contacts later on and you can turn to them for help anytime. We actually have a friendly tradition of trying to attract the most students from our respective alma maters, i.e. IITK and KGP.",
      "Interviewed bySimrat Singh"
    ]
  },
  {
    "title": "In Conversation with Rahul Yadav (Part 1)",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "The Entrepreneurship Summit, IIT Kanpur organised by the E-Cell witnesses distinguished founders, businessmen, VCs and journalists each year. This year new records were set when Rahul Yadav, founder and ex-CEO of the hottest Indian start-up, Housing.com, addressed the enthusiastic junta at this annual event.",
      "Devin and I got the opportunity to squeeze out a short interview from Rahul’s jam-packed schedule. A bit nervous after pulling an all-nighter on the weekend preparing, Devin and I, were scanning through our questions in the lobby of the Visitors’ Hostel, while Alok was recceing for perfect locations of a video interview.",
      "Soon we got a call that Rahul is ready and with some apprehensions, we headed to his room. Rahul was packing his backpack, getting ready for lunch when we barged in with a PD (the camera shaped bazooka) and two interrogators.",
      "Soon, the dream of  PD to record Rahul Yadav was shattered as it got to know that a video shoot is not a very good idea. Our notebooks smirked in glory. Rahul seemed pretty enthusiastic and said, “Chalo, shuru karo” (Come on, let’s start with the questions).",
      "",
      "We started off at a lighter note and asked him about the trivia associated with him.",
      "Are you seriously thinking to contest Big Boss?",
      "‘Time pass kar raha hu yar. It’s fun’ (The speculations are just time-pass. It’s fun)",
      "Who is your favorite superhero, you seem to be Stark-struck!?",
      "‘Yeah, Tony Stark is, Ironman!’",
      "It’s August 31, time for Pitchers finale, eagerly waiting?",
      "‘I don’t watch TVF’",
      "People compare you to Steve Jobs, your take?",
      "‘They compare me to Rakhi Sawant as well (starts laughing)’",
      "Single or taken?",
      "(Blushes) ‘In process’",
      "Who inspires Rahul Yadav? Who are your role models?",
      "‘There was a time when I thought role-model has to be unique, not anymore. So, I think all the superheroes like Tony Stark and their superpowers inspire me.’",
      "As the mood became jovial, it was the turn to introduce the elephant in the house, Housing.com. Haresh Chawla in his article,‘The Rahul Yadav Story You’ve Never Heard Before’, had talked about Rahul and Housing at length.",
      "Haresh Chawla, in his article, writes, “He dreamt with his eyes open and made you visualise a new future” Where do you see your initial dream, Housing, poised in the coming years?",
      "‘For now, I have erased real-estate from my mind. My mind is a clean slate now.’",
      "In the same article, he mentions you saying, “”We are growing too fast. I don’t have anyone who can manage the growth.” How did you tackle it? In retrospection, anything which you would have done differently in terms of managing.",
      "‘I would have hired more heavy-weight guys. Guys with a 2-Cr compensation but having the ability to handle the workforce of 5000. Students can create product but when it comes to management of thousands of people, you need heavyweights’",
      "Pointing out to Devin (who is a bit lean) he quipped rhetorically, ‘Dedo isko 5000 bande, sambhal lega yeh?’(Make him in-charge of 5000 people, will he be able to handle them?)",
      "“I can’t relate to these people and I can’t understand why they can’t see what I see. They can’t see what we can build.” That he did not know whether he wanted to stay on and do it anymore. It was the first time I saw his energy low – he was pensive and seemed downbeat, writes Haresh. It must have been difficult to leave your brain-child?",
      "‘Not really, it was like leaving degree, I dropped out in my 4th year. If something does not work out, it is best to cut it off’",
      "He looked pensive for some time and then added:",
      "‘Past mein kabhi nahi jaane ka yaar, sunk cost mein, woh ho gya hai. You should never waste your next 5 minutes for the past 5 years. Past ke 3 saal ya fir future ke 5 minutes mein se kabhi choose krna pade toh I will choose future ke 5 minute’",
      "(One should never go into the past, in the sunk cost, that has already happened. You should never waste your next 5 minutes for the past 5 years. If I have to choose between past 3 years or next 5 minutes, I will always choose the latter)",
      "To be continued….",
      "Interviewed byBhanu Pratap Singh Tanwar,DevinHaria andAlok Ranjan"
    ]
  },
  {
    "title": "XLVIII Convocation – Au Revoir batch of ’15",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "It was both an exhilarating and tearful occasion for the passing out batch of ’15 as IIT Kanpur held its48thconvocationon7thof June’15.  A total of920students were awarded degrees by the director,Dr. Indranil Mannaand chairman of Board of Governors of the institute,Dr. M Anandkrishnan. Of the total degrees awarded,634were awarded in Undergraduate Programmes and286in Post Graduate Programmes. In addition to theseDr. Pawan Kumar Goenka(B.Tech, IIT Kanpur, batch of 1975), the executive director of Mahindra & Mahindra Limited, was awarded an honorary degree (Honoris Causa). This was second of the two convocations planned by IIT-K this year, the first one being held earlier this year in February.",
      "",
      "The chief guests for PG and UG convocation ceremony wereProf. Tan Chorh Chuan(President, National University of Singapore) andMr. B. Prasada Rao(CMD of Bharat Heavy Electricals Ltd.) respectively. The chief guests addressed the gathering with their inspiring speeches which were received very well by both students and their parents.",
      "In the PG convocation address Prof. Tan Chorh Chuan spoke about the importance of constructive dissatisfaction, which is the philosophy of transforming our dissatisfaction into concrete ideas and a force for positive change. He gave the example of Mr. Lee Kuan Yew, the founding father of Singapore, who transformed the third world country to a thriving metropolis in his lifetime by converting his negative emotions of dissatisfaction into positive ones of belief and optimism.",
      "",
      "He then addressed the issue of how vital it is for each of us to be personally well rooted, so that despite an exhilarating lifestyle, we can retain a strong sense of our identity – of who we are, where we came from, and what we value. He concluded his speech with a message for the graduating batch to cultivate the habit of periodic introspection.",
      "",
      "Mr. B Prasada Rao’s speech focused on the indispensable role of manufacturing and innovation for our economy, wanting to inspire the graduating batch to keep this in mind as they built their careers forward. He stated how India’s economy had made a jump directly from being an agrarian to a service driven economy leapfrogging the intermediate manufacturing stage. India will be experiencing a rapid growth in its workforce which will be an opportunity to promote the manufacturing sector since it possesses necessary potential in raising income levels and providing greater employment opportunities. He applauded the Prime Minister’s Make in India initiative as one of the best platforms to strengthen our domestic manufacturing capabilities, producing quality products without any adverse impact on the environment and make the country a manufacturing hub.",
      "",
      "He concluded his address with the words of Swami Vivekananda –",
      "“Take up one idea. Make that one idea your life- think of it,dream of it, live on that idea. Let the brain, muscles, nerves,every part of your body, be full of that idea, and just leave everyother idea alone. This is the way to success”",
      "",
      "Another highlight of the occasion was the stimulating address by our director Dr. Indranil Manna . He urged the outgoing batch to go forth and make a difference for the betterment of our society. Dr Manna brought to light a myriad of ground realities which made it clear that there was much to be done to reach the position of glory aspired by us all.",
      "",
      "He moved on to say that India was on its way to becoming the youngest nation with two thirds of its populace being younger than 35. Tapping this vast workforce would be vital for us to reclaim our past stature. Talking about the IITs, Dr Manna said that we have invariably enjoyed the fortunate privilege of significant funding and high quality of research and educational infrastructure. We have one of the most proficient faculties in the country. That being said, it is more so our responsibility, through our relentless pursuance of enterprising endeavours to come up with solutions to societal needs.",
      "Dr Manna concluded his speech by imploring the outgoing students to salute their parents, who have had a tremendous hand in where they are today. He left the dais after wishing them the very best on their voyage of life and was met with exuberant applause by the graduating batch.",
      "",
      "",
      "Various awards and honors were conferred during the ceremony, the details of which are given below.",
      "(For the best academic performance in the graduating class among all disciplines of the undergraduate programme)",
      "(For outstanding all round achievement and leadership among students programmes graduating in B.Tech/ BS/ M.Sc.(Intg.)/B.Tech. – M.Tech. (dual degree))",
      "(For the best all round students graduating in B.Tech/ BS/ M.Sc(Intg.)/B.Tech. – M.Tech. (dual degree))",
      "(For the best M.Tech. thesis in any of the engineering departments)",
      "IIT Kanpur Excellence Awards",
      "(For outstanding work in various aspects of community service)",
      "(For outstanding work in various fields of art and cultural activities)",
      "(for exemplary work related to aspects of student governance, hostel management affairs and leadership in organization of events at Department/ Hall/ Institute level)",
      "In addition to these many other awards and honors were conferred, including general proficiency medals and proficiency prizes.",
      "",
      "",
      "",
      "Vox Populi congratulates the passing out batch and wishes them the best of luck in all their future endeavors. We hope that you people achieve unprecedented success and set benchmarks for us, this country and the entire world.",
      "You will be sorely missed.",
      "",
      "",
      "Written by –Akshat Agarwal,Rishabh Anand,Roshan Kumar",
      "",
      ""
    ]
  },
  {
    "title": "The “Co-operation” Roboticist and his “Flying machines”!",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "Vijay Kumar(born April 12, 1962) is an Indian roboticist and UPS foundation professor in the School of Engineering & Applied Mechanics with secondary appointments in Computer and Information Science and Electrical and Systems Engineering at the University of Pennsylvania, and will become the new dean of Penn Engineering from July 1,2015. Prof. Kumar is known for his research in the control and coordination of multi-robot formations. He is an alumni ofIIT Kanpur, graduated in the year of 1983. Prof. Kumar was awarded the Distinguished Alumnus Award last year by IIT Kanpur.",
      "",
      "Vox Populi got the opportunity to interview him after the award ceremony and his lecture.",
      "(Prof Vijay Kumar – Prof. Kumar:)",
      "Vox: Good afternoon,Sir.Prof. Kumar: Good Afternoon.",
      "Vox: Sir, tell us about your involvements in the various technical activities while you were here.Prof. Kumar: I didn’t do any of that .I remember, my activities were mostly musical. We played in a band and we had an audio club too, where we used to tinker around with things. We used to provide audio for all the big events and even make new instruments. We also had a lights club",
      "Vox: And what did the lights club do?Prof. Kumar: Nowadays everything is off-the-shelf but back then they had to be made. You can imagine it as having lots of lights and then wiring them up .It was a great way to earn practical knowledge. There was a HAM club as well as an electronics club that was pretty active. We didn’t have Techkriti back then but the cult fest was quite popular.There were hall days and we used to have Inter -hall cultural competition.It was called galaxy.",
      "Vox: Something in particular you remember about them ?Prof. Kumar: The bollywood talk line about the “Liquid Oxygen main duba dunga…..” – that was our line and they stole it.That actually went on to beget lines as “Is aadmi ko Pakad ke Liquid oxygen me daal do.. Oxygen isko marne nai degi aur liquid isko jeene nai dega (Dump this man in liquid oxygen. The liquid won’t let him survive, the oxygen won’t let him die)”(Everyone laughs)",
      "Vox: So when did you enter into the field of Robotics?Prof. Kumar: Oh that is another story . There are a lot of random events in my life. I just picked things up as they came my way. While I was here, I wanted to work on heat transfer, solar energy, heat exchanger design etc. because I thought energy was the next big thing. But then when I went to Ohio State, I met Ken Waldron, who would later become my advisor. He sold me the field of robotics. It was an upcoming field with something new.",
      "Vox: So you had no kinship with Robotics while you were an IIT student?Prof. Kumar: There were two things I was interested in when I was in IIT. One was heat transfer and the other was aircraft. The whole idea that a computer can fly a plane i.e. autopilot was very interesting to me. In those days the autopilot were used only for inter-continental flights. I was very interested in it and so i took up Aerospace Engineering when I joined IIT. And then my Seniors told me there is no market in India for Aerospace Engineering. Due to this and partly because my father was in Mechanical Engineering I switched to Mechanical. You know back then you had much less information — no internet. So what you learnt, you learnt by talking to faculty mentors and by talking to senior students.",
      "Vox: So how did your shift to Aerial Robotics and Swarm Robotics come about?Prof. Kumar: That story is a concrete one. In my PhD thesis I worked on a walking machine and that walking machine had 18 joints. Back then we had Intel 8086 processor which had a clock speed of 0.5Mhz. So, you could not write a control software that could control more than one joint on a single board which meant that you had to have 18 Intel 8086 computers and a 19th one to just pass messages between them thus making them coordinate with each other. In effect you had eighteen independent joints swarming together to make the vehicle move. So I started thinking about it back then and then when I left Ohio State University and I went to Univ. of Pennsylvania, I couldn’t work on walking machines because they were expensive. So,I started building multi fingered grippers and multi arm manipulators. And again every arm is independent and you had to figure out how to make them cooperate. That actually went on to mobile robots swarming.",
      "Vox: That’s a pretty solid way to experience the importance of swarm robotics. How did aerial robotics get introduced?Prof. Kumar: Aerial robots came a long time later because the invention that made it all possible was the accelerometer and then if you go back and look at why the accelerometer became so inexpensive you, will find that it was because finally the MEMS technology became mature and car manufacturers in US decided to deploy airbags and then every car had an airbag and there were lots of MEMS accelerometer being sold. Suddenly, the price of MEMS accelerometer came down and thats what made small UAVs possible.",
      "Vox: Ok,why do you think we are not developing new products in the field of robotics in India? I mean there is a lot of good research on robotics going on over here but not so much of indigenous products in the market.Prof. Kumar: I personally think there is a lot of brain drain from the tech sector to non-technical sectors (someone said “financial”). When I came to the reunion ,I talked to the top three students on campus.It is true they were working in a tech field but it was clear they were interested in careers in completely different fields. I remember when I graduated people like me were criticized because IIT was training us and we were leaving the country to go to the US. But at least people like me stayed in the tech area, and contributing to education and advances in technology. Technology does not know geographical boundaries, and there should be incentives to recruit and retain smart young people in science and technology.But you know now you have an innovation-incubation centre like SIDBI, I think things are changing and there are a lot of small startups and if one of them makes it big, suddenly everyone will want to create startups.",
      "Prof. Venkatesh: Let me tell you what is actually happening. A lot of modern technology is being built from materials off-the-shelves. As you said I also believe in getting things off the shelves to build things.But in this way you are never going to build a good motor, even if you try . So there is really no success in this sector.",
      "Prof. Kumar: That is not necessarily the only road to innovation. Innovation is mostly about novel ways of integrating components and subsystems.",
      "Prof. Venkatesh: Yes say you start a company and you make something , you will need to sell at least 50,000 products to keep your company standing and that is very difficult in India. Here, the markets aren’t that big. We can’t sell robots, we aren’t competitive for that reason. These typical marks,I believe we can’t reach because the markets aren’t that big.",
      "Prof. Kumar: Oh come one, India innovates in softwares and are really booming in it.",
      "Prof. Venkatesh:Precisely,in things which don’t require material.",
      "Prof. Kumar: That’s true even in the US. Remind me, I will send you the article about how “Hardware is the new software“. Software is something you can build in a garage or in somebody’s room. Hardware is becoming like that too. I believe in it. I think there will be startups in Robotics and if one of them makes it to success there will be a huge boom and by success I mean they have a good story and a high profile. They will have one soon and then Robotics will grow as a field to innovate in.",
      "Interviewed byAmartya Sanyal"
    ]
  },
  {
    "title": "What are ‘Coding’ Jobs?",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "The placement season is near, and lot of ‘coding’ companies are recruiting. Here is a primer on the different profiles the companies offer.",
      "First of all, let us make it clear thatcodingmerely means writing lines in a particular ‘language’ which follow a structure and are meant to be executed.CSE(Computer Science and Engineering) Jobs, are those in which the core of problem solving involves basic CS principles.  It is also different from a job likeCFD(Computational Fluid Dynamics) Engineer,where even though the person would write significant amounts of code, the principles are derived from a different field.",
      "Most profiles tend to use the word “Developer” and “Engineer” interchangeably, and we would be using only Developer going forward except when there is a difference.",
      "This is more of a general term than most of which would follow.  A software developer is someone who works on a Software, or a Service and contributes code to it. This may involve adding new features, fixing bugs, or making the software work better. Many of the profiles given below can effectively be classified under Software Engineering, and are merely specializations. If this is the profile that has been mentioned, then it is better to talk to the company to figure out what the exact nature of the job would be.",
      "A web developer is a specialization of the above said Software Developer where the difference is that he would be working on Web Applications. This is often confused with Web Designers, who deal more with the look and feel of the webpage. A webpage is in general merely a HTML page with information, while a web application is a software that a user interacts with over the internet. This involves a lot of challenges of its own like reducing response times, load balancing etc. that may not be present in other areas. But also involves certain benefits like no need to consider installation platforms etc.",
      "Not so long ago, most operations of web application happened on the servers, and the browser was used just to show the results. Often the only people who worked on the front end were designers and a handful of front end engineers whose job was not that challenging. However this has currently changed a lot, as people have started writing full applications that reside on the browser and treat the server like a datastore, interacting with it just to get data. This has given rise to mainly 3 profiles:",
      "1. Backend Developer– The amount of job of a backend developer varies a lot, in many older applications, he was responsible for a lot of what the user finally viewed. However in modern times, a backend engineer works on serving data in particular formats to the frontend, and the rest is taken care of by the frontend code. Backend engineers have to write code, that computes the data as fast as possible and returns the data. The challenges lie in writing performant code, that can scale and handle a lot of users. The developer would also have to write code that processes the data in the back end, for later use.",
      "2. Frontend Developer– A front end developer is repsonsible for writing code that communicates with the backend and finally interacts with the user. The user would be interacting almost entirely with the frontend code which would be written in Javascript (or in certain cases a language that is then converted to Javascript). He would be dealing with the challenges of having multiple browsers, and non-unified JS specification, and would be working along with the UI Developer who would work on the look and feel of the application.",
      "3. In many web applications, and in most web applications that have only a few developers, the web application is divided into modules. A particular engineer might handle both the backend of that particular module, and are generally called web developers. Sometimes, they are also calledfull stack developers,although that is a much vertically integrated job.",
      "A computer system in this context is merely a combination of the hardware and software for a specific application. For a installed software, like a browser, this would entirely lie within your computer. But for most large applications, this would be spread across multiple servers :Webserversthat serve the web application,database serversthat store the data,storage serversto handle the storage of content,networkingto connect all these together, and otherspecialized serviceslike caching services, logging services, analytics services etc. A systems engineer would be responsible for architecting the whole structure. They would be responsible for the block level architecture of a computer service. As can be inferred from the description, this is a higher level job, and rather than coding involves more of architecting components such that they work together.",
      "SysOps or Systems Operation Engineer is someone who manages and monitors the system the software is running on. He makes sure that all the various parts that we covered above in systems engineering work as expected, and in general write code for the monitoring and maintenance of these systems. In general, he would be in charge of the operations of all the servers that the services run on, and the interconnects between them.",
      "Applications developer is a software developer who would in general be working on a user facing application, rather than things like database, and infrastructure. If it is in the web area, where most of the current work is in, it is same as that of a Web developer. The other important area for applications developer is developing Mobile Applications, which I would be explaining below. The third part of applications developer is writing software for  desktop computers. Microsoft would be the leading recruiter in this area.",
      "The major difference in this profile from an applications developer lies in the fact that the way people interact with mobile applications is very different from desktop software. A mobile application is often close to a web application from the perspective of a user. Hence this introduces challenges that both a Web Developer and a normal applications developer has to face, with other considerations like writing battery efficient code, and the limited screen area they have. The developers in this field have to exclusively work on Obective-C/Swift for iOS development, Java for Android development, or .NET platform for Windows Mobile development.",
      "A research engineer is generally an engineer in the research team, that would finally be responsible for implementing and testing out the research findings. They would work closely with the research scientist to either test the research work for practical considerations, or to implement a simple software, that would then be taken forward to the software team. They form a connect between the research teams and the software/hardware teams, and they generally do not conduct research but understand and implement it.",
      "A research scientist on the other hand would be researching in the areas the company is involved in, and in general this profile is reserved for Doctorates, and only in rare cases opens for Bachelors and Masters. However most research firms offer a form of gateway researcher position, where the person would be in a research team, with the expectation that once he gets a feel of it, would later go for a PhD.",
      "There is not much to tell about the exact work a researcher would be doing, since it varies a lot, however currently a significant percentage of the research recruitment is in area of Data Mining and Machine Learning.",
      "If you have any questions, feel free to discuss in the comments section. Vox Populi wishes Good Luck to people sitting for placements!",
      "",
      "This article has been written byAbhimanyu Mongandh Ambalath."
    ]
  },
  {
    "title": "The Silent March for Justice",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "A group of students, gathered with a common motive – to show solidarity with the students of Jadavpur University who were subject to violence without any provocation; to raise awareness amongst thejuntaabout the incident and to demand justice for the girl who was wronged. A few hours of preparation and the group had found within itself creative poster-makers, able administrators and overall motivated individuals. And it all culminated on the 24th in a silent march from New SAC to the IIT Gate, with candles and posters.",
      "It was 7:30 pm when a steady trickle of students from all batches and all halls started gathering at OAT, IIT Kanpur and before long, the group had grown to about 120. Posters, black bands and candles in hand, under the able and headstrong leadership of Samarth Bansal along with the enthusiastic participation of the charismatic students, the three kilometer long march began, in deafening silence. The posters and the discipline made many people join in en route. However none of this would have been possible without the admirable efficiency of the SIS guards on campus, who were there at every step of the way, organizing the walk, controlling the traffic and ensuring that the entire march was smoothly conducted.",
      "Upon culmination, the students placed their candles on the road and met media personnel near the gate to express their views on the event. The students reiterated their demands for justice and expressed hope that an impartial investigation into the events of the 28th of August would take place. Let us hope the march for justice does indeed make justice see the light of the day.",
      "Written by Sharbatanu Chatterjee and Archish Mazumdar"
    ]
  },
  {
    "title": "#Hokkolorob",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "A peaceful gathering of people not older than you or I. Singing, dancing, standing up for a cause. The exuberance of unabashed youth twinkling in their eyes. And suddenly, in a matter of a few hours their world had turned completely turtle. Lathis flew, friends were injured and lives were threatened. And through all this, the student community of Jadavpur University has come out in unison, with courage and strength.",
      "Hok Kolorobisn’t just another phrase from a Bengali textbook. Roughly translated, it means “let voices rise”. And that is exactly what the Jadavpur agitation is all about. To raise one’s voice against what is wrong even in the face of the gravest oppression and staunch opposition. Given the coverage and support this agitation has received from all parts of the country, people already must have a fair idea about the issue. But still, for the sake of relevance, a brief overview of the events is given below.",
      "These events are quoted from two of our friends present in the JU campus who prefer to remain anonymous.",
      "Now, as an individual sitting in the campus of IIT Kanpur, 1200 kilometres up the Ganga, far from where this agitation is on in full swing one may wonder about the relevance of the movement. Although one  cannot comment on whether it was correct on the part of the students to use the method they did to bring justice to the accused for this shameful crime. But it a completely valid and legal path. But as a student and more so as a human being, one simply cannot justify the use of violence on a group of peaceful protestors.",
      "This article however is not about the lathi-charge, it is not a character sketch of the Vice Chancellor or a personal rant of the authors against either of the two parties involved. No, instead this article is about the validity of such a step, of its repercussions, of the need for people to be aware of what is turning out to be a matter of national importance as well as to make sure the original issue does not get overshadowed.",
      "So, firstly, why should one unleash the police force on a group of unarmed students? Could the Vice Chancellor not have been rescued without resorting to such measures? As a nation proud of her democratic identity which also upholds the right to peaceful protest, this was completely uncalled for. September 17, 2014 will perhaps be registered as a black day in the history of Indian Education.",
      "Following the issue, however, presumably neither the police nor the concerned authorities would have anticipated what this would snowball into. From being an isolated event in Kolkata, it transformed almost overnight into a nation-wide movement making #hokkolorob the most trending topic over social media. Students from distant parts of the country have extended their solidarity. From protest marches being undertaken in multiple campuses, to petitions being raised against this blatant use of power, support and solidarity has arrived from the most unlikely sources. A mega protest march on Saturday, 20th September, saw over a lakh students and common citizens of Kolkata converge to march towards Raj Bhavan and lodge a complaint to the Governor of West Bengal, who also happened to be the Chancellor of Jadavpur University.",
      "So, why should the event bother us?",
      "Bengal, especially Kolkata, is notorious over the nation for the influence of politics on education – there is an understandable repulsion for student politics which usually transcends being truly representative of the student voice are often fabricated over greater political gain. This incident though is different. These are our colleagues, our friends, who are protesting, without any tinge of political colour. From a personal view, these are people whom the authors have known and grown up with. And to see them hurt and physically assaulted, without any fault on their part, while standing up for justice –  is something any rational mind cannot fathom.",
      "This event also serves as an eerie reminder of the attack by goons allegedly owing allegiance to a local politician at GSVM College, Kanpur, in March 2014. The campus of IIT Kanpur had not been affected directly, but the audacity of people in power came as a rude shock to many and made us raise our voice. We know now that howsoever isolated such incidents may seem or how far-off and detached one might be, there is no guarantee that this might never happen to you. Sitting far-off in the comforts of one’s home with the escapist view of being glad to be away from all the hullabaloo while wanting the nation to change at the same time is a fool’s utopia. Discussing how wrong such matters are over coffee and yet not doing anything about it, or worse, shrugging them off as something of little concern, is downright dangerous. A nation’s strength lies not in its numbers but in the ideals it is beset in. And the idea of justice has been dealt a blow by this incident. It is precisely this reason that students all over the nation need to (and are) show their solidarity.",
      "A word of caution. The use of oppressive force on unarmed students has somehow taken the limelight away from the root cause of it all. The molestation charges levelled by the girl and justice to be meted out to the ones responsible for such a heinous crime. We would like to emphasize that it is of prime importance this issue is not forgotten. And of course, not allowing any untoward incident to take place that would invalidate the non-violent nature of the protest is also vital. The attitude of the people of Kolkata regarding this has been admirable. There has been no violence or vandalism and we hope that it remains this way.",
      "Finally to conclude, the authors of this article meant it to inspire people to rise up in support of our fellow mates waging their battle miles away. We hope and pray that good sense finally prevails and justice is served. And if such an event happens in the future, the students of the nation, the back-bone of the society, do not need to take to the streets to protest.",
      "It has often been said that there are only two ways to live: “You either let things be or take up the mantle to change what is wrong”. In the end, it is a choice we all have to make.",
      "As an epilogue, a candle march is going to be organized at IIT Kanpur to show solidarity and we encourage the campusjuntato support the cause.",
      "This article has been written by Archish Mazumdar and Sharbatanu Chatterjee",
      ""
    ]
  },
  {
    "title": "You shouldn’t have missed it, Mr. PM!",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "With already so much having been commented upon the maiden speech of ‘not-an-accidental’ PM by nearly all prominent journalists and columnists of varied viewpoints and contrasting ideologies there is only little scope left for further review of the confident articulation which many have already classified as historical. So why this article? Actually, we are ‘Pakke Bhartiya’ who never feel contended by any speech made -howsoever great it may sound- as we find something in it to dissent from. Here we didn’t find much to dissent from so we were compelled to explore what more points could be raised in such a special and path-breaking speech. And we came across the issues which were of significance but failed to find space in the archival extempore of our dear Prime Minister. Let’s take them one by one-",
      "That corruption is nowhere in the real agenda of the present governmentis apparent by the PM’s speech where we didn’t hear the word ‘भ्रष्टाचार’for once.",
      "Corruption is certainly one of the most clichéd terms in India’s context and who can be held responsible for this? Surely the politicians who have always deceived the people with their speeches in the doublespeak and with their multiple standards on the various issues. So is it not the responsibility of the most powerful politician of the country to make it clear what his intention and plan of approach is. That  corruption is nowhere in the real agenda of the present governmentis apparent by the Prime Minister’s speech where we didn’t hear the word ‘भ्रष्टाचार’ even for once.And this is disappointing especially when he and his government are already breaking free of the prevailing stereotypes. He talked of reforms at the micro level e.g. moral and human values, platitudes like service-not-job, and the teachings from the scriptures like individual vigilance (जाग्रयाम् वयम्). An appeal for keeping away from corrupt activities could signal at least a positive sign, if not change the behavior of the people overnight.",
      "This is a fact that he has talked so much about the sanitation issue in the pre-election as well as post-election speeches and also that the Ganga Clean Mission has been given very high priority with local people also being involved in this. Then what’s the problem? Perhaps Mr. PM is not directly responsible for this thing but the long tradition of falsehood and betrayals by the bunch of crook politicians has forced the people not to believe in promises and appeals. And the most suitable evidence is the following picture of post-I Day celebrations. PM talked so much of sanitation and what happened just after he finished? Wish he could anticipate it!",
      "Also very important is manual scavenging issue as Jairam Ramesh has reviewed the speech on the sanitation front and has written that ‘given the time he devoted to sanitation in his speech, it would have only been appropriate that the Prime Minister spoke feelingly about the persistent prevalence of manual scavenging across the country’.",
      "",
      "Very closely associated with sanitation is health which- unlike sanitation- couldn’t find the words of PM. He talked about universal access to health infrastructure using broadband but that too in the context of Digital India. Also for a just healthcare system universal access is necessary but certainly not sufficient. The equitable distribution of medicines, the medicine patent issue and improvement in the services of government hospitals are important too. He could talk about IMR and child mortality being 2.5 times higher in rural areas than their urban counterparts. He could have pointed out at the major issue of malnutrition in our children with the fact that 40% of them receive less food than they should.He could have made people aware about the alarming jeopardy of non-communicable diseases like hypertension, diabetes etc. especially in North India. He could have drawn attention of his MPs- as part of the village adoption scheme- and other citizen about the miser availability of drinking water at large number of places even today. He could have borrowed the idea of sound health of all citizens from Swami Vivekananda who- as he said- “could never speak a false word”. But he missed it completely!",
      "Everyone knows about the demographic dividend India is likely to enjoy in near future and also about the ambitious plans of PM who emphasized on his slogan of Yuva Shakti and who is prepared to trap this Shakti by introducing new Ministry of Skill Development and Entrepreneurship. So far, so good.But who would disagree that the youngsters will be only building upon the contributions of the remaining not-so-young population.They should not be treated as if they are like burden on us. PM missed the opportunity to make young India realize this.",
      "Whether it is his dislike for alleged ‘Muslim appeasement’ of Nehru and that of Congress or the start of a new era in Indian politics when politicians will talk less and less in terms of religious disparity- we don’t know and hence wouldn’t comment upon. But just by looking at the various observations and recommendations in report submitted by Sacchar Committee on status and welfare of Muslims in India one can feel the pressing need to take serious steps. The committee had said that Muslims have very less percentage of employed population, even lesser than the SCs/STs.",
      "Also few positive words- but not just of formality- could help the administration a lot in bringing the series of communal violence to an end which have been happening repeatedly in many parts of country, especially in Western UP. He could have been more direct in asking India to celebrate its diversity. His words like‘ye desh sirf kisi ek dharm ya samudaay ka nahin hai’ might have passed important message to religious fanatics. It could also have widened his acceptance among all communities.",
      "While this ad of KBC was being aired on the National TV for the first time I realized that the intensity of the problem was so high and so beautifully presented that even Mr. Bacchan was reduced to a secondary element. Unfortunately PM didn’t see this ad. Hence he could not utilize the opportunity to bring the contribution of North-East in nation building before the whole nation. While mentioning CWG medals he could have recognized the athletes from NE. Also it was convincingly important to add some P.S. to the National Anthem considering the fact that the great poet Tagore couldn’t fit this territory into the rhythm of the song.",
      "He talked about sanitation but made no mention of efforts needed to preserve our environmental resources. Perhaps this was- and is- not a matter of concern for someone coming from poor background. Don’t you remember this is how he came to sanitation point that he has seen what sanitation means for the poor? Anyway he could have endorsed the idea of going green at macro as well as micro level. And as the title goes he had the best opportunity in hand to redefine the third color of Tiranga. Missed the golden opportunity to break another stereotype!",
      "This is the first shloka of the first chapter of Chāndogyopaniṣad which translates loosely as ‘the essence of all beings is the earth, the essence of the earth is water’. This could be used- the same way he used two other shloka- to link the significance of water resource with our cultural values. He should have brought it to notice of nation- specially addressing the rural population- how important it is to redeem our lost and encroached water resources and at the same time to preserve the available ones for future generations.",
      "These are attitudinal changes which percolate from top to bottom in a society. He could have appealed to parents for giving their wards freedom of choice among available options. He could have asked teachers- particularly ones teaching in government-run schools- to understand the great responsibility of nation building they have been vested with. At the same time students could have been encouraged to make constructive inroads in cutting edge technologies.",
      "P.S: Our intention behind writing this long article has not been to show our deliberate skepticism towards the words of PM or the Government but it is only that we wanted to make note of what could be added more. It was important because he should not forget them at Lal Quila next year.",
      "",
      "Written by Nishant Singh",
      "The views conveyed in the article are solely of the author. The opinion section of Vox Populi provides a platform for the campus junta to voice their opinions."
    ]
  },
  {
    "title": "Ashutosh at E Summit!",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "He was the managing editor of the news channel IBN 7. He left his job with a dream in mind: to clean the dirty politics of India. He is the inspiration for the youth of India. Ardent follower of the philosophy that action speaks louder than words, Ashutosh Gupta talks to Vox Populi about journalism, politics, AAP and how does he plan to make a difference.",
      "Vox: Sir, journalism basically refers to the collection and dissemination of information to the audience. How do you define the objectives of journalism?",
      "Ashutosh: The public is the ultimate target of the media and therefore acting in their interest is both an ethical and pragmatic concern for the journalists. The entire world of journalism has undergone a huge change. Initially the main objective of journalism was to obtain information, filter it and accurately present it to the junta without any manipulations. But if we happen to look today, the scene is entirely different. The journalist today is more concerned about the new issues dominating the political scene and above all, change is the underlying theme of the socio-political discourse. They  collect information from all sources and report it to the people along with their point of view and I think there is nothing wrong with it.  For example, The Guardian newspaper follows the left ideology and The Economist magazine follows the right. Presenting your opinion is not a problem but manipulating the news so as to affect the opinion of people is wrong.",
      "Vox: Your views on objective journalism.",
      "Ashutosh: We have different newspapers in India. The same news when read in Times of India and when read in The Indian Express appears different. I believe there is no such thing as ‘objective information’ or ‘objective news reporting’. What I think will depend on the kind of socio-political upbringing I had. And therefore all this has added and abetted the collapse of objectivity as a journalistic standard. Objectivity makes us passive recipients of news rather than aggressive analyzers and propagators of it.",
      "Vox: You were at the head of the news channel and at the pinnacle of your journalistic career. And then politics happened. Why?",
      "Ashutosh: Traditional politics is something I always disliked and I never had plans to get into it. When AAP came into picture I realized that it was different. I observed their functioning and style of politics that they were into and their willingness to clean the dirty politics of our country. It influenced me to take this step.",
      "Vox: You wrote the book ‘ Anna- The 13 days that awakened India’ and also now since you are into politics, how do you deal with the criticism you receive?",
      "Ashutosh: Transition from journalism to politics changed my mindset and also the way I deal with things. Journalists are imperfect people doing a job that is crucial to the society. I always did things that I had a strong conviction for. Now, since I am into politics, I accept everything that comes my way and I feel motivated to create a difference to the society.",
      "Vox: A message for Journalism Society, IIT Kanpur",
      "Ashutosh: Journalists strive to keep the public’s trust because it is on the foundation of trust that the information is collected and exchanged. Honesty towards work is the main key. Always be true to information. Public trusts journalists to provide accurate and valuable information otherwise the journalist’s work will never be believed.",
      "Written by Srishti Gautam and Aaditya Kumar"
    ]
  },
  {
    "title": "Stalwarts of Physics at Techkriti!",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "Techkriti 2014 saw as its chief guest the celebrated and widely respected astrophysicist Dr. Walter H.G. Lewin. Professor Emeritus of Physics at MIT, Dr. Lewin has been the childhood hero of many a student across the world for his unique teaching style and nature as well as for his eccentric experiments. His video lectures on classical mechanics and electromagnetism have reached millions of people across the world through MIT OpenCourseWare and recently through the massive open online course destination site and online learning platform, edX. Dr. Lewin’s style of teaching and catchphrases have gained almost legendary proportions. Videos are made of his quintessential chalk markings while people emulate his loud and clear exclamations of “Aha!”. One of the most famous demonstrations is of course his swinging on a pendulum to prove that ‘physics works’! Add to that his candid declaration before his students after a successfully enlightening lecture – “All of you have now lost your virginity… in physics” and you have a teacher loved by all. Walter Lewin could proudly declare that he could make his students love physics whether they liked it or not.So, expectedly, his reputation preceded him. On the 5th of March 2014, the entire campus of IIT Kanpur was abuzz with news of the arrival of Dr. Lewin. Many were lucky enough to catch a glimpse of him at CCD and photographs of him with the students went viral on the internet. Others preferred barging into his room – D008 at the Visitors’ Hostel. But Dr. Lewin was gracious enough to offer time to almost all the students, agreeing to talk with them at the CCD outlet, arguably his favourite place to hang out.  A connoisseur of coffee, Dr. Lewin, when not talking of physics and society and general problems of humanity, would express his love for espresso, the only civilized way of starting a morning!  Overcoming his hiccoughs of comprehending the Indian English accent, Dr. Lewin inquired about the educational scenario in India, voiced his opinions and his concerns and also expressed his mildly critical views of policies by various governments, India and beyond. Whatever he said and wherever he went, a rapt audience of eager students willing to meet their idol would be waiting!",
      "Hence it was expected that the Main Auditorium would be jam-packed for his talk, even at the supposedly ungodly hour of 10:00 pm. Some people even had to be left behind in the rush to witness the Dutch astrophysicist in action. And he did not disappoint. The audience listened in rapt attention to his lecture on the birth and death of stars, and their final fates. Dr. Lewin lectured on how several factors control their destinyen routeto becoming neutron stars, black holes or white dwarfs. And of course, a Lewin lecture without involving the audience in experiment is meaningless! So the attendees got to understand first-hand about the Doppler shift, using a tuning fork and a borrowed hammer to strike it with (the original hammer having been confiscated while entering India) – something that kept them at the edge of their seats. Informative explanations of the history of radio-pulsars being discovered was also given, along with the surreptitious removal of the removal of Jocelyn Bell’s name from the discovery – which according to him was probably one of the early cases of sexism in academia!",
      "Overall, the late-night lecture and the friendly nature of Walter Lewin was the topic of discussion on campus for days to come!",
      "Along with Lewin, the other famous physicist and educator to grace Techkriti was Prof. David. J. Griffiths. Almost all first-year students would be familiar with his name due to the immense popularity of his (in)famous bookIntroduction to Electrodynamics,a veritable Bible for the takers of the fresher’s course on electrodynamics.",
      "However, his popular talk focused on more fundamental aspects of physics – his current area of research being particle physics. After a hefty introduction by Prof. H.C. Verma, Griffiths proceeded to give a  detailed lecture about the current paradigms in particle physics with lucid explanations for even the uninitiated to grasp!",
      "Following the lecture was a more personal discussion session with the grandfatherly Griffiths, an unplugged version of him, in the Physics Department Seminar Room at the Faculty Building. It was there that he shared the joy (and pain) of academia; his love and affection for his thesis advisor and guide, the famous Sidney Coleman, who gave more impetus to Griffiths’ own way of research, rather than ‘guide’ explicitly. His good-mannered bushy-moustached face lit up at the questions on academic books, while he himself admitted about the influence of certain other books, namely Jackson’s, on his work! And so  The passion he had for spreading knowledge was evident from the caressing manner he adopted when writing in his soothing informal language to teach physics to the starry-eyed undergraduate! Sprinkled between his inspiring words and discussions on physics teaching were his own experiences of Reeds College and University of Utah, in the ‘middle of nowhere’! Add to that his obliging to sign his books for the eager students of IIT Kanpur!Techkriti 2014 turned out to be a treat for the lovers of Physics, and a fantastic learning experience for all! And thevox populihopes and demands for more such inspiring presence.",
      "Writtenby Sharbatanu Chatterjee and Praharsh Suryadevara",
      ""
    ]
  },
  {
    "title": "Tennis: Game..Set..Life!",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "Tennis.. A racquet-ball sport played on a rectangular piece of land .. 78 feet in length and 36 feet in breadth .. the only thing you need to do .. NOT allow the ball to bounce twice in your part of the court.. 6 games in a Set .. 5 Sets in a match ..Seems pretty mundane and shallow, eh ?? Well, there’s more to it than just the racquet work .A game of Hope, A game of OpportunityIn tennis, you’re never out of the match .. Lost a point ? Win the Game and the lost point doesn’t even matter.. Lost the first 2 Sets ? Win the next 3 and the first 2 don’t matter. The hope on the tennis court never dies until the referee finally declares .. Game .. Set and Match ..Isn’t life too, about having this hope till the very last breath..? A champion like Jimmy Conors looks at a tough situation as an opportunity to outperform himself.. and interestingly he did do it every time.. Coming back from 2 sets to 0 down, ending up winning the match in a GRAND SLAM SEMIFINAL on 4 occasions.. A fighter like Novak Djokovic comes back after facing 2 Match Points against the great Roger Federer to end up winning .. again in a Grand Slam Semi Final..The significance of the lesson that these heroics give us is too big to get expressed in words.. Opportunity NEVER dies .. Unless You do ..A game of RedemptionIf you serve incorrectly, It is a Fault.. But then, first mistakes are always pardonable.. You get another chance to rectify your mistake.. Another mistake in serving.. Commit a Double Fault and you lose a point to your opponent..We often make mistakes in life.. To err is Human.. But, to err twice is Stupid…Tennis gives us this important lesson.. There cannot be an excuse to repeating your mistakes.. We have to keep on correcting our flaws and enriching our qualities..It is by Learning from the mistakes of our past and the mistakes made by our ancestors, we can think of improving as a society.. Repeating them again.. We’re giving away free ‘points’ to others…A game of DisciplineThe sidelines and the baseline sometimes literally haunt the players.. when on a given day every ball hit misses the line by millimeters.. The latest Hawk-eye technology must be really frustrating for players when they actually get to see on the big screen… by how little they missed to clip the line !It does not matter by how much you miss the line .. By millimeters or my Meters.. An ‘out’ ball is an ‘out’ ball .. I think it is EXACTLY the same with life.. A person who lives a life of dignity throughout, but commits that one single mistake is in fact remembered for that very mistake that he makes.. as they say .. “Being a good person is like being a Goalkeeper … It doesn’t matter how many you save… People will only remember the one that you missed.”We need to chalk out our lines of discipline and conduct for our lives similar to these lines on the court.. And, we MUST make sure we done cross those lines.. Not even by an Inch .. It is this discipline that marks the difference between many-a-talented individuals and the legends, that are so very few in number..A game of LuckLuck begins to play its part right at the very beginning at the toss.. and continues to do so throughout the game .. There have been incidents where ONE WRONG CALL has switched the hands that would have lifted the Trophies.. A doubtful ball may be called ‘in’ by one linesman and ‘out’ by another.. What makes the difference is having the right linesman calling your ball at the right Point..Isn’t Life too about meeting the Right people at the Right time .. being in the Right places at the Right time… Sometimes it is the people around you that make all the difference .. Tennis gives us the lesson of Luck.. Sometimes with Fortunate Victories and Sometimes with Bitter Defeats.. But then, we have to embrace the situation as it comes… or I should say ‘shake hands’ with it… Similar to what the players do across the net after the match is over..The Game of LifeHow similar is a Simple game of Tennis .. to the entire Journey of Life.. This is precisely the importance of sports in life .. When life throws all these scenarios at you.. you get the feeling of having ‘been there before’… The confidence of pulling out a tight match.. stays with us when we have to deal with the low moments in life..Life is a roller coaster ride and we must enjoy every moment of it.. The rise as well as the fall … Transferring all the guilt on destiny does not rectify what has already happened… we rather get the feeling of things being out of our control and into the hands of destiny for every next situation to come … We must remember that “we” have to hit those shots… “we” have to grind ..“The ball is always in our court” .. what to do with it .. Is up to us decide !!!",
      "Written by Aaditya Ranade"
    ]
  },
  {
    "title": "Into the mind: An athlete’s perspective",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "‘Why do you run?’‘What do you think about when you’re running?’If only I had a coin for every time someone asked me this, I’d be pretty rich by now. Many a times, theseseemingly trivial queries got me thinking. Why do I ACTUALLY run? I honestly hadn’t given much thoughtto it until these questions started popping up. The most obvious, right-in-my-face kind of reason wasthat I felt good. It made me feel like life wasn’t so bad, after all. But then again, chicken biryani has thesame exhilarating effect as well. Then why do I put myself through this horrendous ordeal of pacingaround when I have other alternatives that don’t make me pant like my dog? I realized that it has to besomething more than a magical shortcut to adrenaline driven euphoria.What is it then that keeps me going? Think. THINK. I think a lot, when I run. I contemplate about myacademic progress, evaluate the pros and cons of asking someone out, wonder about the existence ofunicorns. Hell, I might as well find a cure for cancer while I’m at it. When I run, the entire world aroundme comes to a stand still. Absurd or not, it gives me a clearer perspective on life.Of how I should never stop pushing myself until I reach the finish line. To never give up in the face ofadversity even when my muscles tense up and strain, my chest can barely contain my pounding heartand the voices in my head .. oh how they scream! Begging me to stop, to let it go … that I’m no good.It’s astonishing how all these emotions can translate into the run that we call life. Every time I go againstthese voices, a feeling of accomplishment encompasses me. As the famous saying goes, ” It’s importantin life to not necessarily be strong .. but to feel strong “. Running provides me with that strength. It fillsme with hope, for now I know that I can take on any challenge that is thrown at me. And that folks, iswhy I do what I do.",
      "Written by Shanti Shree"
    ]
  },
  {
    "title": "Anonymity, Social Media and the Web : Part-II",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "13th September, mid semester exams were just round the corner and like  every exam you could sense the stress levels of the campus skyrocketing. This is usually the time when the average IITian, starts looking  for an escape and “IITK Rage” proved to be a perfect platform to assauge the students’ pent up souls .",
      "What started as an innocuous page to allow students to vent  out their exam frustration soon spiralled out of hand as the posts became  contemptuous, derogatory and personal. Being the “brightest minds of  the country”, it is believed that the students would be prudent enough not to cross the tacit line  but the power of anonymity brought out the worst in all of us.",
      "Fortunately, there was a silver lining to all of this,  certain sensible fifth years, took it upon themselves to stop this  savagery. A post on the lines of “if you still  like this page, by the end of this day, I shall remove you from my  friend list” was made by a student. The post further urged the campus to follow suit. Other students also posted their disgust over the “rage page”. Prima facie, one might have shrugged off this post  considering it to be naive; but the impact of this post was far reaching, eliciting the required response. In no more than 12 hours,  the page was reported and removed from Zuckerberg land.",
      "Albeit the intentions of creating the page were innocuous,  we should be wary of the repercussions of such actions; especially with  the power of anonymity social media bestows.",
      "This article is written and edited by Priyank Jaini and Srijan R Shetty",
      "This article was  part of the series of Quora posts by Vox Populi during Semester I, 2013-14"
    ]
  },
  {
    "title": "A Student Revolutionary and an Aspiring Mentor",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "An IITian who has worked for over four decades on issues of poverty, land and water, secure settlements, workplace safety, environmental planning, grassroots leadership training, and pollution control in both rural and urban communities. He has been a mentor to several generations of IITians – prodding them like Socrates to question the mainstream parameters of success to question the “should” and live a more “examined” life.",
      "“I pity those who graduate from IIT’s just to sell soap in the US,” he says caustically. According to him, Indian technical education is geared to meet global demands. The courses taught in IIT’s today serve the US more than our own country. Earlier it was not the case when a more integrated approach was followed and humanities, ethics, history of technology, and logic were also taught giving their due importance. But today the education is producing unreal, disconnected technologists. He urges the young students to ask questions, and not just be receivers of “wisdom”, and to “learn the laws of motion of society and not just the laws of motion of science.” There is so much that is needed to be done in India.",
      "The slightly frayed jeans and long silver hair tied into a ponytail give him the appearance of an aging beatnik, but unlike other aging beatniks, there’s still a spring in his step and an edgy excitement in his voice. In a  90-minute talk addressing a crowd of nearly a thousand IITians and other college students during the annual Techfest at IIT Bombay, he provokes his audience by calling them “big fools” who know nothing about India and its people. The IITians are victims of the politics of education and science. He goes on to say that environmental dynamics aren’t understood by engineers who seem to specialize in solving one problem to create another one, thereby creating a “sustainability for the engineering profession—and not for the people.”",
      "No, it wasn’t a frustrated or failed aspirant but a former IITian, Anubrotto Kumar Roy popularly known as Dunu Roy who uttered these words. Dunu obtained a B.Tech in 1967 and an M.Tech in 1969 in Chemical Engineering from IIT Bombay. As a friend and a former mentee put it, “Dunu Roy is a chemical engineer by training, social scientist by compulsion, and a political ecologist by choice.” He has worked for over four decades on issues of poverty, land and water, secure settlements, safe work, environmental planning, grassroots leadership training, and pollution control in both rural and urban communities. And now he is trying to educate people about the Hazards of urban development and renewal.",
      "Beginnings",
      "Dunu grew up in Dehradun where his father S C Roy taught at the famous Doon School. During the Second World War Maria Montessori was stranded in India for several years. Latika Roy – Dunu’s mother was trained by Maria Montessori herself at Kodaikanal and for many years ran the first Montessori school in Dehradun. Dunu and his two elder brothers were also educated at both the Montessori and Doon School. In school Dunu won numerous all India awards in both English and Hindi elocution as well as in sports and theatre.",
      "Latika Roy wanted one of her sons to become a medical doctor. This mantle fell on Dunu and he got into several medical colleges including the prestigious All India Institute of Medical Sciences and the Christian Medical College, Vellore. After cracking these tough exams Dunu rebelled and made up his mind to become an engineer. Next year he got into IIT Delhi where he had a severe attack of jaundice and had to return home and lost another year. Next year he was offered re-admission into IIT Delhi but again sat for the exams to get  into IIT Bombay from where he completed his BTech (Chemical in 1967) and MTech in1969.",
      "Why Would Anyone Want to Work for a Company?",
      "In the mid-sixties there was a massive earthquake in Koyna, Maharashtra. Socially conscious students wanted to do their little bit. As a student volunteer Dunu participated in building earthquake proof structures in Koyna. This motivated them to try extending the Green revolution technology that had just been invented. As enthusiastic engineering students they went to a village near Pune to teach the unsuspecting villagers about the benefits of hybrid seeds and chemical fertilizers. However, the villagers evinced no interest and remained skeptical because as practicing farmers they knew much more than what the students could teach them. But the students still wanted to help the villagers. In the morning they had seen many villagers squatting on the roadside and the women carrying their brasslotas. What the village evidently needed was a sanitary facility. Full of enthusiasm, the students once again fetched bricks, asbestos sheets, and a ceramic pot and constructed a toilet. They were proud of their social work.",
      "The next year they wanted to do more “social service” for which they needed some funds. “Get a photograph of the latrine we constructed last year. This will be good testimony of our social work and then people will donate money.” So, someone was dispatched to click a photograph. The photographer returned back saying, “The latrine is not being used for its intended purpose but as a goat shelter.” After the initial outrage, someone suggested that maybe the enthusiastic students had misjudged the needs of the people. This was a great lesson in humility. The urban educated middle class could go totally wrong while assessing the real needs of the people.",
      "“Those were heady days,” he says, talking about the 1970s. “The national dream was fraying; the Congress was, for the first time, being defeated; the wisdom of large-scale projects like the Bhakra dam was being questioned, and the increasing slum population in cities was challenging prevalent notions of development.” People’s movements were challenging the established order. Civil rights movement, anti-Vietnam marches, the environmental and feminist movements were impacting societal consciousness.",
      "The student movement had spread in India, and the IITs weren’t immune. “Unlike today,” says Roy, “a national spirit and feeling of community was alive in the student population.” Students came forward in large numbers to work in rural areas and to revive the aspirations of the freedom movement. There were many heated discussions in the hostel rooms about how the youth could participate.",
      "At this time, many Indian scientists who had made their mark in American Universities had returned to India to work or teach in the IITs. The notables were Prof. G. D. Agarwal (who joined IIT Kanpur and then became Member Secretary, Central Pollution Control Board) and Prof. P. K. Mehta (specialist in Cement technology who briefly worked at a cement plant in Sawaimadhopur) both from the University of California. They set up FREA – Front for Rapid Economic Advancement – an organization for the appropriate development of India. Their goal was to spur growth in small- and medium-sized industry.",
      "The idea to work for FREA appealed to Roy. “After three successive years of monotonous industry placements during summer breaks, I couldn’t imagine why anybody would want to do something like that after IIT,” he explains. The idea of working long office hours for a MNC did not suit Dunu Roy and he gave up his career as a chemical engineer. Instead, he made a two-year commitment to FREA on a meager salary. The initial objective was to set up a strong institution that would provide solid professional assistance to aspiring entrepreneurs. But sometime after he’d started work, the group realized the solution to the problems of small- and medium-sized industries lay not in better technological inputs but in better credit lines and market development. In other words, it would be difficult for them to effect any change on the ground.",
      "The programme then morphed into an effort to teach students about urban and rural development issues. The idea was to expose young minds to the larger reality of India – a reality steeped in poverty and exploitation. At first, IIT students were sent to remote tribal villages to experience the lives of the poor. They would live there for a few days and return back deeply stirred and devastated. The programme soon expanded into other colleges in Bombay and to students in other cities and towns. They would soon realize that people were poor not because they were lazy but because of the systematic exploitation of their resources by the elite. These intense experiences radicalized many young minds. The solutions to poverty were steeply rooted in economics and politics and could only be partially solved by technology or education.",
      "Two years commitment with FREA turned into four. In the four years that he spent with FREA, they spread to 14 locations around the country, working with Gandhian organizations, church institutions, independent groups and more than 400 students were being sent out for short term assignments every year.",
      "During those years, Roy worked all over India. The experience shaped his—and others’—future. “I realized,” he says, “that most developmental activities taking place in India at that time were micro-experiments, limited to either a cluster of villages or a few sectors like education and healthcare.” There was no understanding of the linkages between sectors; and the people who did work in villages, worked only to implement their own ideas of progress and development. “It was a top-down approach,” says Roy. “Nobody was asking the people what they wanted. They were talking to the people, not with the people.”",
      "Knowledge as a Weapon to Bring Change",
      "In the early 1970s the NGO model was heavily critiqued. The NGOs got their money from charitable trusts, the government or relied on foreign funds. They did not have to earn their living like ordinary people. Would people heed to such preachers? In 1975 Dunu, along with like-minded friends, started an experiment in the Shahdol district of Madhya Pradesh, “Kaam aur Kamai” – to do meaningful social work while earning a living within the community. The outcome was theVidushak Karkhana– a small workshop to repair diesel pump sets and other rural machinery. It was a small commune where people lived and worked together while searching for a meaningful role for themselves.",
      "TheVidushak Karkhanaslowly evolved into the Shahdol Group to carry out focused work on building a development model for the district and its implementation, in conjunction with local people. He was involved in this for 17 years during which he earned his income primarily out of repairing bicycles, pump sets, tractors, and electric motors in the district. Dunu led a highly disciplined life. Getting up at 5 o’clock in the morning he would wash last night’s utensils. Then he would light the “chulha” and cook lunch – rice, lentil and a vegetable. After that he would cook breakfast and make tea. As the tea got ready he would sing loudly to wake his other young colleagues. He would reply to dozens of letters every day, work for several hours in the workshop, and still find time to read books and discuss issues with his colleagues and the students who came to help with the surveys and research work. Discussions with Dunu and his colleagues helped many students to both understand society as well what could be their potential contributions to change.",
      "It is in the Shahdol Group that Dunu and his co-workers got a glimpse of what the future might hold. Their studies showed that knowledge is power; that most conflicts in society were an attempt to control resources – land, minerals etc. They put together a framework that could be used by the people to analyze problems and come up with solutions, developed over almost two decades in the two studies on Environmental Planning and Environmental Education. It was a powerful participatory mechanism and people put it to a variety of uses, not only in Shahdol but also in other parts of India. As described by Roy:",
      "“We learned that people can fight for their survival based on what knowledge they can create. Each one of the reports and studies cited above and numerous others, that we helped produce, indicates that ordinary working people have the capacity to learn, to collect information, to look at it analytically, and eventually use it for bettering their own lives. And that is our goal and that should be the objective of education.”",
      "Unfinished Business",
      "After about 20 years Dunu moved to JNU, New Delhi where his wife Dr. Imrana Qadeer was a Professor at the Center of Social and Preventive Medicine. Imrana comes from an erudite family of scientists and scholars and is a known expert in the field of community medicine. She too left her Registrar-ship at the All India Institute of Medical Sciences to teach at JNU. Their son Ishan studied design at the National Institute of Design (NID) Ahmedabad and is now teaching at the Genesis School in NOIDA. They have a daughter Devi who is currently in school and aspires to be a psychologist (although occasionally she also wants to be a professional assassin!).",
      "In Delhi Dunu did a brief stint with the World Wide Fund for Nature. There, he created a low-cost cell to monitor the effects of pollution on habitat and to build a bridge between the workers in industry (where pollution is created and has the maximum harm) and the farmers in the hinterland (who are officially the impacted people). “They shunted me out after four years, when my work started upsetting the companies that funded them,” he says candidly.",
      "He then set up the Delhi-based Hazards Centre, a research group that “helps communities and organizations to understand and deal with anything that’s dangerous to their survival”. It works with marginalized groups all over India, mainly in urban areas now, helping them face challenges and adapt to changing circumstances. The Centre also gets 20-30 student interns every year from the IITs and other premier institutes. The Centre helps these students to understand how the other half lives, struggles, or dies.",
      "In Gujarat, his small group of researchers assisted communities in making claims under the Tribal Rights Act; in Patna, they provided information to women’s groups in slums to enable them to lay claim to water, sanitation, and other services; in Visakhapatnam, they strengthened squatter groups to obtain proper resettlement from the railways; in Singrauli, they are giving technical expertise to citizens’ groups challenging the environmental degradation by thermal plants; in Hyderabad, they supplied designs for people’s critical analysis of urban renewal projects; in Bhubaneswar, they are helping vendors’ associations to understand the Vendor Act and Policy; in Delhi, they are guiding groups of waste-pickers, rickshaw-pullers, daily workers, and vegetable sellers in conducting studies that will provide them with entitlements under the Master Plan; and in Uttarakhand and Himachal, they are developing critiques of hydro-electric generation projects and their impacts on the local population.",
      "More than anyone else in the country Dunu has been an aspiring mentor to several generations of IITians and students from many professional colleges and institutions – prodding them like Socrates to question the mainstream parameters of success, to challenge the accepted “should”, and conduct a more “examined” life. He has encouraged them to explore how their education can be put to socially meaningful use; how their M Phils and PhDs are more relevant for the people; and how research can have an objective that is greater than the acquisition of degrees and academic positions.",
      "Purpose of Education",
      "“The purpose of education should be to develop the capacity to learn, to collect information, to look at it analytically, and eventually use it for bettering lives. Instead, we have didactic instruction, memorizing by rote, and vomiting out useless information for futile examinations that constitute the fundamentals of what passes for education in our schools and colleges.”",
      "To the outsider, it seems like Dunu has drifted a long way from his engineering days at IIT. “Not at all,” protests Dunu. “The IITs were meant to create solutions to national problems, which is why they were called Institutes of Technology and not Institutes of Engineering and Management, which is what they have become today. I am still very much an engineer, but I link the profession with an understanding of the politics of society and the imperatives of ecology.”",
      "Does he think the film 3 Idiots is indicative of the changing attitude towards engineering? “Yes and no,” he says, after thinking for a moment. Dunu admits that the film raised questions about an engineering education, but believes that the answer it provided was flawed.",
      "“It basically said you could succeed in professions like photography or music despite your engineering degree; but it never answered the real question –how do you make engineering relevant”",
      "==========================",
      "Dunu Roy [IIT Bombay BT/67/MT/69] is Director of Hazards Centre, Delhihttp://www.hazardscentre.com. He received the Distinguished Alumnus Award from IIT Bombay in the years 1975 and 2000. IIT Kanpur in 2008 conferred upon him the Satyendra K. Dubey Memorial award for his outstanding work in rural development and spreading environmental awareness. He continues to work for the causes of environmental protection, domestic workers, contract workers, rag pickers, jhuggi-jhopri walas, potable water, and urban India’s hazardous life. The challenges before him now are manifold and of gigantic magnitude but he is not the one to give up. Even if a part of the work he has undertaken yields results, it will be a big leap forward in service to the community. He can be reached atqadeeroy@gmail.com",
      "[This article was prepared by copying and pasting material from various published sources. Their contribution is gratefully acknowledged.]"
    ]
  },
  {
    "title": "Rahul Ram: Playing to a Different Note",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "After completing M.Sc. in Chemistry from IIT Kanpur in 1986 and PhD in Environmental Toxicology from Cornell University in 1990, Delhi-based Rahul Ram should have been a top grade scientist or an ace academician or both. But Ram chose to be lead singer and bassist of the band Indian Ocean.",
      "It is very unlikely that you will come across another IITian like Rahul Ram. To begin with hehas Masters in Chemistry from IIT Kanpur, a PhD in Environmental Toxicology from Cornell and has been involved in social movements like Narmada Bachao Andolan (NBA). But he is most famously known as the lead singer and bassist of the bandIndian Ocean.",
      "Education",
      "Rahul Ram comes from a highly educated family. His parents were professors; as a result very high academic standards were maintained in the family. Rahul Ram decided to pursue chemistry and started preparation for IIT JEE but he didn’t like the intense preparation required and subjects like trigonometry, so instead he chose to join St. Stephens College, Delhi. While studying chemistry in St Stephens, he played guitar in various college bands.",
      "After graduating from St. Stephens, Rahul joined IIT Kanpur for his Masters degree in Chemistry. At IITK due to the rigorous system he was completely engaged in studies. He was still uncertain about his career path. In the final year, students in his batch coordinated with each other to get to the best universities in US and he managed to get into Cornell to do a PhD in Environmental Toxicology.",
      "Cornell was a happy time for him. The flexibility of education system there allowed him to take the courses he wanted to study. “I picked up the subject of my interest and spent the next four years (1986-90) studying social and development sciences along with my research work,” he says. Ram put music on hold but “heard a lot of it”. He completed his PhD in 4 years. With an all A score and strong research behind him, he looked for work with leading environment NGOs. But no good offer came his way. During his PhD, he also got married to Amita Baviskar who was doing PhD in Development Sociology from Cornell and was girlfriend of Rahul since Stephen’s days.",
      "",
      "",
      "Return to India",
      "Though Rahul thoroughly enjoyed his stay at US, he did not want to settle there. He hardly had a career plan and just followed his passion. He believed he had to be good in what he was doing and education is an asset. In September 1990, he returned to India and joined Narmda Bachao Andolan (NBA) Support Group in Delhi as an associate activist for Rs 2,000 a month. The experience of living in villages with tribal’s and in various jails completely transformed Rahul’s life. He realized that material pursuits and happiness were not related. Adivasis he met had no wealthy possessions but they were happy.",
      "Indian Ocean",
      "After the agitation he returned to Delhi and started playing music again to earn money. He had been playing bass guitar since junior school and continued to play by joining bands outside of Stephens and performed in events. In 1991, he took up his classmate Susmit’s offer to be a part of Indian Ocean for a show but continued to do his own things. Periods of uncertainty never bothered Ram as his parents and wife were extremely supportive. His sources of earnings were concerts, playing atjagrans and creating pamphlets for the NBA; Ram cruised through with ease. He enjoyed freedom more than money. While music continued, he started giving guest lectures in various colleges including the School of Planning and Architecture, Delhi.",
      "Money was tough for the band too. Though their music had grown its own strong following not being mainstream music, it was rejected by music labels in India and abroad. Slowly as media abroad started to appreciate Indian Ocean music, the conditions for them started to change in India too. With the release of its albumKandisain March 2000, the band went on to acquire cult status and it changed the fortune of the band. Later, band worked on music for films such as Black Friday, Gulal, Peepli and many other projects. The international scene opened too. After their first concert abroad in London in August 2001 to touring the US thrice in 2005-6, there has never been a dull moment. The four-member band has held over 70 shows in the past one year.",
      "From managing his day for Rs. 10 a day, today Rahul Ram earns in seven figures. But it was never the money; it always was about freedom and passion.",
      "Follow Your Passion",
      "A strong educational background, single mindedness and passion are usually the ingredients of a successful career. Even if the choice of career is unconventional, which may include no one fixed career at all.",
      "In his own words at IIT Delhi, foundation day speech he says “Your notion of what makes you happy is what you need to figure out in your head. If you are willing to do what you want to do, I think there are some things which are very clear. You will be poor for a very long time but I don’t think that matters.”",
      "Watch his very interesting hour-long IITD Foundation Day Speech. It is worth your time.",
      "http://www.youtube.com/watch?v=DrWvPAUwn1I#at=81",
      "",
      "“I hardly had a career plan. My choice of subject to study and the career I wanted was based on my passion. Two things I was certain about—I had to be good in what I was doing and education is an asset,” says the bassist and vocalist of one of India’s premier bands, Indian Ocean.",
      "Ram’s attitude to a career may not be conventional or ideal. But it may just be the sign of an emerging trend, where a tunnel vision to career doesn’t work. There are ways one can productively follow one’s passion and that’s by being sincere and hardworking in whatever you undertake.",
      "Ram discovered his two passions— environment conservation and bass guitar—rather early in life. “I started learning to play the guitar in school,” says Ram, who was also a very vocal member of a local eco-group that even went to meet Sunderlal Bahuguna in Tehri. Influenced by the Rachel Carson’s bookSilent Spring, he could hold discussions on impact of pesticides for hours. “I also honed my argumentative skills with facts and figures,” says Ram.",
      "The environmental activist in him has taken a back seat as finally Ram has found a job he is content with. From an annual earning of Rs 30,000 in 1990 to a seven-figure yearly earnings, Ram considers his monetary success spectacular. On the career front, he is rocking.",
      "===============",
      "Rahul Narasimha Ram graduated from IITK with M.Sc. in Chemistry in 1986 and Ph.D. in Environmental Toxicology from Cornell University in 1990. He is currently bassist and vocalist of one of India’s premier bands,Indian OceanThis posting is based on published material that appeared in Business Todayhttp://businesstoday.intoday.in/story/a-different-note/1/6513.htmland IIT Storieshttp://www.iitstories.com/2012/04/03/rahul-ram-bassist-vocalist-of-indian-ocean-iit-kanpur-alumnus/",
      "Originally published on Alumni Connect blog: https://alumniconnect.wordpress.com/2013/08/01/rahul-ram-playing-to-a-different-note/"
    ]
  },
  {
    "title": "The Semester That Was: Anonymity, Social Media and the Web, Part-I",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "The frailty of genius is it always wants to push boundaries; moral, social, ethical, personal. A young student sitting in his attic somewhere in England with regular gizmos could get through the firewalls of NASA and Pentagon as a hot knife through butter. While, no one on campus has attempted, or more accurately put, succeeded in pulling off something of this magnitude, the number of cases of hacking has been on the rise.",
      "A harmless hack of Facebook or G-Mail accounts is understandable and can be brushed off as a prank; but incidents have come to light in which the boundaries of ‘prank’ were evidently overstepped.It is well known that the webmail account is not very secure in the sense that it is easy to get the passwords. However, Facebook and G-Mail accounts seem to be the new targets.",
      "In some incidents that came to light, the Facebook profile and G-Mail accounts were not only hacked, but the information vis-a-vis, emails and chats were stored and anonymous mails were sent regarding the content to disturb the concerned person. On talking to people who understand the jargon of hacking better than the editors, it was told that in most of the cases it is difficult to get to know who hacked the account without involving the authorities which might lead to disciplinary actions. It was also brought to light that IIT-Kanpur with it’s Computer Centre facility gives ample opportunity to wear the garb of anonymity and indulge in such pranks.",
      "It is however to be noted that while people might indulge in a one-off incident involving such pranks, the Computer Centre in the information it provides on the usage of the facilities clearly states that such acts come under “misusing the facilities” and if reported may certainly lead to disciplinary actions. Boundaries can be pushed both ways. So much for online privacy.",
      "This article has been written and edited by Priyank Jaini and Srijan R Shetty, Editors, Vox-Populi."
    ]
  },
  {
    "title": "Rajeev Motwani: There wasn’t a startup he didn’t love",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "Rajeev Motwani, wanted to study mathematics and become another Gauss! His father, however, persuaded him to study computer science. Little did he know how closely the two are related? He graduated with B.Tech. in computer science from IITK in 1983 and PhD from Berkeley in 1988.  Rajeev was a wise theoretician that had the rare knack and desire to turn theory into practical applications. Whenever you use a piece of technology, there is a good chance a little bit of Rajeev Motwani is behind it.",
      "Rajeev played an important role in the founding of Google 15 years ago. He was snatched away from us on June 5, 2009, at the age of 47, in a drowning accident in the backyard swimming pool of his Atherton home after a party celebrating the end of the school year!",
      "Growing up",
      "Rajeev Motwani was born on March 24, 1962 in the Indian city of Jammu to Lt. ColonelHotchand Motwani, an officer in the Indian Army, and Namita Motwani. His family included brothers Sanjeev and Suneev. Given his father’s army career, Rajeev’s family moved often and lived in various parts of India before settling down in New Delhi.",
      "When Rajeev was seven, his father was stationed in the scenic town of Devlali near Mumbai, India. His family would walk a kilometer to the local library to get books, and the seven-year-old Rajeev would be seen reading the books they had borrowed from the library as they walked home! His brothers recall that not a single day would pass when he did not read a whole book.",
      "Young Rajeev wanted to be a mathematician, like Gauss. “This was partly shaped by the books I had at home. My parents for some reason had a lot of these books – 10 great scientists or five famous mathematicians – their life stories and so on. As a child, whatever heroes you read about you want to become,” adds Rajeev. Rajeev would read books of all types, including novels, comics, autobiographies and scientific books. Rajeev also loved music, particularly rock music. One of his favorite bands was Indian Ocean. His friend from Berkley days, Rathin Sinha recollects Rajeev’s love for books by Asimov, music by Pink Floyd, and canned chili and rice meals!",
      "A turning point in Rajeev’s intellectual development came when his family moved to New Delhi in 1974. Rajeev’s father wanted to send his children to the prestigious St Columba’s High School in New Delhi. St Columba’s High School administered a difficult entrance exam to admit students, and Rajeev studied hard the night before taking the exam. Not only did Rajeev pass the exam, he did so well that the principal admitted all three brothers into the school!",
      "Reluctant Computer Scientist",
      "After 11th grade (in the 10+2 program) in 1978, he appeared in JEE earning third place in the northern zone of India. He did not stay at Columba’s to finish the 12th grade instead joined I I T Kanpur, which at that time had just started the undergraduate program in computer science. “I truly wanted to be a mathematician, and my parents were hesitant because how do you make money as a mathematician, how do you support a family. I was basically forced into going into computer science even though I did not want to, but it turned out to be a wonderful surprise that computer science is actually quite mathematical as a field,” recalls Rajeev in an interview.",
      "Even though IIT Kanpur had an outstanding computer science faculty in the late 1970s, formal computer science education at the undergraduate level was still in its infancy in India. Rajeev was a member of the very first cohort of undergraduate computer science students at IIT Kanpur. Rajeev often recalled that IIT Kanpur had attracted an amazing group of people, and there could not have been a better environment for studying computer science in India. As a student, Rajeev was inspired by Professor Kesav Nori, who taught Rajeev’s first class on programming — TA 306: Principles of Programming. Rajeev recalls, “Wonderful thing about Prof. Nori is that he was a very inspiring person. He did more than just teach. He created such a wonderful ecosystem and developed a personal connection with his students.”",
      "Prof. Nori thinks Rajeev gave him more credit than he deserves. It has been 35 years but he is still so enthusiastic talking about Rajeev – the chubby, smart boy. In a recent phone conversation one could sense enthusiasm in his voice when he said, “Rajeev knew that purpose of programing is not just coding; it is to formulate the problem. Rajeev’s thinking was clear; his expression direct. No unnecessary stuff.  Rajeev had a knack for creating the most elegant and brief answers to the hardest of programming problems. It was a joy to read his papers.”",
      "Another instructor at IITK recollects, “Anyone who had taught Rajeev could not but be impressed by his class. At the same time, he was not at all competitive — if he did well, which he did, it was because doing well was so natural for him.”",
      "Gautam Bhargava, a classmate of Rajeev at IIT Kanpur remembers him, “As a fun loving, rock-n-rollin’ party guy, a super-smart classmate. Hardly anyone in IIT-days called him Rajeev. To us he was, and still is, Mots, which was not short for Motwani, as you would expect, but rather short for Motwayne!  After the younger brother of the movie star John Wayne! But this alleged younger brother of John Wayne was never seen wearing a 10-gallon Stetson; rather he was most often seen in akurta, jeans,chappals, with a cloth book-bag slung across his shoulder!",
      "Rajeev’s amazing brilliance might lead you to believe that Rajeev was this immensely studious type who spent all his waking hours studying and hitting the books hard. On the contrary, Rajeev was an incredibly fun loving guy always ready for a party! In his dorm room, next to his bed would always be a stack of science-fiction books waiting for eager consumption. Rajeev would spend endless hours solving the hardest crossword puzzles, playing bridge or volleyball, and hanging out with friends — then he would show up for the tests and magically ace them! Now if a course were “crazy hard”, say, like the one on Number Theory, Rajeev would effortlessly breeze through, with amazingly elegant answers to even the toughest of problems.  However, if the class were “easy”, Rajeev could easily lose some interest.  Rajeev thought time could be better spent listening to music or hanging out at the canteen eatinghakka chowmeinoranda parathas.”",
      "Gautam continues, “Rajeev was also quite a music lover with a particular fondness for Rock’n’Roll. During IIT years Rajeev was also the “Audio Club Secretary”. This was indeed a prestigious job as the Audio “Secy” controlled the keys to the Rock’n’Roll kingdom – and decided when and where the amps and the speakers and the other equipment would be made available. As usual, Rajeev took great joy in running that club and recruited a bunch of his friends to lug those heavy amps around! When this got too much he decided it was more fun to play the bass … his favorite tune for riffing on bass was “Badge”! Later he started doodling on the keyboard … and as our friend Madhavan recalls, they only played songs in the key of A-minor so Rajeev could just play on the white keys!!! Rajeev could also create musical wonders with another “instrument” – you just had to hear him use a wine glass and a fork to play the tune for the Bollywood hitChura Liya Hai.”",
      "Rajeev’s undergraduate thesis (joint with Chilukuri K. Mohan and Amitabh Shah; advised by Professor Somenath Biswas) was quite theoretical: “Specification and Verification of Computer Communication Protocols.” This simultaneous interest in theory and programming percolated through Rajeev’s career. Rajeev’s friends recall that in college he was not only brilliant, but also incredibly fun-loving and always ready for a party. There would always be a stack of science-fiction books waiting for eager consumption in his dorm room, and he would spend endless hours solving difficult crossword puzzles, playing bridge or volleyball, and hanging out with friends. He never lost this undergraduate spirit. Through his time at Berkeley and as a faculty member at Stanford, Rajeev approached research and entrepreneurship with joy.",
      "Never do work today that you can defer to tomorrow",
      "Everybody else was coming to the US for PhD or Masters or whatever. Actually Rajeev did not want to come to USA for some unexplainable reasons. He got a job at DCM Data Products because getting visas at that time (1983) was a big problem. He was also interviewed by the top three guys at Wipro – a small enterprise then. The interviewer said we would love to give you a job looking at your track record but isn’t every one with your kind of back ground going to the US on a scholarship? So have you applied to US? Rajeev said, “Yes I have an offer from Berkley.” He asked do you have a scholarship. Rajeev said, “Yes, but I am not sure if I will get a visa.” He got the visa and landed up at Berkley.",
      "In 1983, Rajeev became a PhD student at UC Berkeley. He found Berkley to be a very politically charged university – he would call it the JNU of the US. For 3 years Rajeev had a blast. Did not do any work and fully enjoyed the environment. His advisor was Prof. Richard Karp, who won the Turing award – which is like the Nobel Prize in computer science in 1985-86. When Rajeev had finished those 3 years without publishing any papers, he thought that he was not doing anything and letting this man down. So from then on he worked really hard and was quite productive for the next two years.",
      "In an advanced course on algorithms taught by Prof. Richard Karp the class was asked to solve a homework problem. With a fellow student and Prof. Karp, Rajeev developed this problem into a theory of deferred data structures: data structures that are built-up incrementally. This resulted in Rajeev’s first published paper, and he summarized it jokingly as his philosophy in life, with the words: Never do work today that you can defer to tomorrow.",
      "This is how Rathin Sinha remembers his days with Rajeev at Berkley, “Rajeev was perhaps my closest friend in UC Berkeley. We arrived in the same August of 1983 and I remember spending countless evenings at his Durant apartment going through his full collection of Isaac Asimov, having tea and ending the evening with fried chili and rice. …and then we went our separate ways. I discontinued my PhD program, took up a job, but lived in the neighborhood.",
      "When I got laid off in 1986, he helped me with my resume, in job search, and most importantly kept me motivated. He even gave me his answering machine in case an interviewer calls and I am not there to take the call. He was always smiling. Very mellow and soft spoken. I never saw him getting frustrated or rattled in spite of his heavy work load. He never complained about life, teachers, tests, or grades. He knew how to enjoy himself.",
      "10 years later – one email and we were connected again. His first request to me was to see if I could help a budding entrepreneur who was looking for some technology. So was Rajeev. For me it was like growing up with Greatness. Rajeev was always ready to help. ”",
      "In 1988 Rajeev was about to graduate from Berkley with PhD (His Dissertation: Probabilistic analysis of matching and network flow algorithms) and was wondering what to do next. Go back to India or stay in the US. Again other people made the decisions for him. Don Knuth, one of the founding fathers of computer science, came over to meet Rajeev’s advisor and told him that they wanted to hire someone young for algorithms at Stanford. So Karp suggested Rajeev’s name. Rajeev was then invited by Knuth at Stanford for lunch. Rajeev was wondering why this great man wants to have lunch with him. Anyway, Rajeev went to Stanford and met him at a restaurant near the church at the quad. He then told him to be with Stanford for a year and see if they liked him and vice versa after which if things worked out well they would hire Rajeev.",
      "He was offered a visiting faculty position at Stanford. He did not want that job as he was getting better offers and permanent jobs at other places but since it was an offer by Knuth it was hard to turn down. Rajeev thought, “It’s the like Einstein inviting you to Princeton for a job!” He joined Stanford and taught several courses and had a very good time.",
      "Stanford liked what they saw and he was appointed as tenure-track faculty. Based on his thesis work at Berkeley, Stanford realized that it was getting an extraordinary and promising theoretician in this 27 year old man. However, everyone underestimated the incredible scholar, teacher, advisor, colleague, entrepreneur, and friend that Rajeev would become.",
      "3 – 4 months after his first year at Stanford he got married. Rajeev met his soon-to-be wife Asha Jadeja in May 1989. Asha graduated from the University of Southern California and relocated to the San Francisco Bay area. Rajeev and Asha were married on March 22, 1990 in Delhi. They liked living in Stanford, and decided to stay. Asha started graduate school at UC Berkeley in 1991, studying urban planning and urban transportation, and joined the department of political science at Stanford in 1994. Two daughters were born from their marriage, Naitri (b.1991) and Anya (b.2003). In their tribute to Rajeev, Asha’s younger brothers, Yashwant and Yogi said, “Rajeev, who we calledJamaisaheb, was to the world a famous scientist, entrepreneur, and mentor. For us, he was the rock star of an elder brother that we never had. When our dear sister Asha married Rajeev, we used to pinch ourselves and wondered how we ever got so lucky — that this brilliant, humble, and incredibly handsome man entered our family and immediately became part of a large, cantankerous family — with such ease. In our 20 years of close association, we never saw Rajeev ever lose his cool, was always generous even to people he did not know, and became the darling son of our parents, and all aunts and uncles in the family. He will be with us forever.”",
      "Robots Taught Him Something Special",
      "Rajeev enjoyed teaching at Stanford. Since so many people were retiring or leaving Stanford there were a lot of courses to be taught. Rajeev ended up teaching variety of courses. He even created and offered his own courses such as topography and algorithms and complexity theory. Since he did not know a lot of these areas but he learned a lot by teaching these courses.  He did not get enough sleep! He used to say, “I am a perfectionist and I still get nervous to talk before a class even today. I get nervous, what if someone asks me a question and I find myself unable to answer it. So for this reason I always over prepare.”",
      "The nervousness taught him more than what he learned as a student. He landed up working in many different areas and it broadened his thinking, knowledge, and experience.  It also helped not get bored. He used to say, “I have tendency to get bored easily and so if I stay in one area for too long I quickly move over to another area. My threshold of working in one particular area is about 5 years.”",
      "Jean Claude Latombe from France, in robotics area, inspired him to see robots from a very different angle. He told Rajeev that there were a lot of algorithms in robotics which are needed to plan the actions of the robot. Robots require very high dimensional planning. It is like having a starting point A and end point B in space, and moving from A to B without being hit by any obstacles. The same task would be easier with 2 points on the table. Rajeev worked on solving robot related problems for 5 years, putting high dimension geometry and randomization together. Seeing the robots move and perform using his algorithms, he realized that he could do something mathematical but practical. He realized that his ideas, his work could have practical implications.",
      "He could now move over from the paper pencil world to the real world. He gave lot of credit to Stanford for creating an environment where people in different areas could work together making the whole greater than the sum of its parts. He spent one third of his time in doing his work in a theoretical and mathematical way and the rest in collaborating with people.",
      "Pfizer wanted to fund research on computational drug design. And while finishing the work on random motion planning in robots he realized that molecules and robots actually behave in a very similar way. His team came up with software based on his theory and they added some new theories. The project was called RAPID (Randomized Pharmacophore Identification for Drug Design). It went very well. Rajeev learnt a lot. He said, “It was an intriguing experience. I had to go back and learn my high school chemistry and biology and the other fun stuff.” The software is being used by Pfizer labs for their drug design.",
      "There wasn’t a startup he didn’t love",
      "Rajeev was fascinated by the transformation of academic ideas into commercial ventures. To quote his friend and coauthor, Madhu Sudan from MIT, “Having worked with Rajeev at an early stage of my career I knew how smart he was, but it really took Stanford to bring out his true talent, which was the ability to recognize the importance of ideas quicker than anyone else around.”",
      "Rajeev was active in the venture industry, and had a reputation of being extremely helpful to entrepreneurs. Rajeev’s students and industry colleagues remember him for his uncanny ability to connect people: he was a catalyst in bringing teams together and getting companies started with an element of inspiration and strategic guidance. Through Deutsche Bank, to which he had been an advisor, he became one of the first investors in PayPal, and Rajeev and Asha started a venture fund called Dot Edu Ventures in 2000. He was also a special advisor to Sequoia Capital, and was active in entrepreneurial student groups at Stanford, including Business Association of Stanford Engineering Students (BASES) and Stanford Student Enterprises.",
      "Sep Kamvar, a student of Rajeev who later became an entrepreneur recalls, “Rajeev had a selfless heart. At one point early on in our company, I had a conversation with somebody who told me he thought our company wouldn’t succeed.  Upset, I called Rajeev the next day, met up with him at the University Cafe, and told him about this conversation. After he listened to me rant for half an hour about how I was going to prove this guy wrong, he smiled and simply said: “Yes, you will.  That’s why you’re an entrepreneur.  Now your challenge is to use that energy to do something good for the world.”",
      "Another former student and now an entrepreneur remarked, “His ability of porting ideas from one to the other was unparalleled.” Jennifer Widom, fellow faculty from Stanford in her tribute to Rajeev said, “In entrepreneurial circles, many call him “the world’s greatest connector.” He had an uncanny ability to recognize that by bringing together certain people, magical things would happen. On a smaller scale, I recently realized that’s exactly what he was doing in our research enterprise. He clearly had a knack for matchmaking. deeply thought-out insights on most any issue, a willingness to help anyone anytime, and an understated but ever-present sense of humor.",
      "We faculty have a tendency to blather on. Rajeev, on the other hand, would sit quietly and then get right to the point. Rajeev left one hole that simply can’t be addressed. He forged a unique connection between the department and the entrepreneurial world—a connection that was broad, deeply technical, and full of integrity. That is something we simply can’t replicate with any other human being known to us.”",
      "Ram Shriram, a family friend remembers, “Rajeev had a photographic memory and seemed to have a limitless capacity to remember people, numbers, events, companies and the like. He was always accessible and approachable. His business acumen rivaled his technical prowess which made him a unique and potent force in the venture community.”",
      "Gaurav Garg noted, “Rajeev was one of those rare people who operated at the highest level of excellence in multiple disciplines. He was exceptionally observant, practical, thoughtful, yet decisive, with an unerring instinct for the right questions or issues around any topic, be it the game of cricket or a startup. I was always impressed by his kindness, fondness, and open door policy with young entrepreneurs.”",
      "Rajeev was a nurturing force for many startups, according to a close friend and GigaOm editor Om Malik. As an investor and advisor, he sat on the boards of Google, Kaboodle, Mimosa Systems, Adchemy, Baynote, Vuclip.",
      "Then Came the World Wide Web",
      "Around this time the world wide web was coming up and Rajeev got sucked into it. Rajeev in his interview with Shivanand Kanavi in 2002 recollects, “There was this guy Jeff Ullman, another one of the grand old men of computer science, who retired this year. He was in the office next to me and was in database. I was talking to him and a new student – Sergey Brin, and I remember at that time we were using Mosaic, and we were looking at the web and I was sitting there and thinking that we could randomize the web in some way because that was going to grow and become big and randomness was going to be important; though I did not know how and why. So I thought about doing random walks on the web and there was this problem of crawling on the web. At that time a search engine called Inktomi had just come out of Berkley. Excite and Yahoo had come out from Stanford so we had seen the first signs of all of this.",
      "I remember going to Inktomi and searching for the word Inktomi and it could not find itself. I don’t know if that is still true but at that time if you went to Inktomi and typed in the word it said no results found. My Godelian past induced me to do these self-referential queries but what amazed me was that this is a simple thing that people screw up on. So in the context of all this I was listening to some people from IBM talk on Data mining and Ullman had just introduced me to some problems in databases. I broke them down with a student and was getting pretty excited about the concept of databases. Ullman took me for this talk on data mining which sounded very interesting to me. So Sergey and Ullman and we decided to do some data mining on the web because it sounded like a nice mix. We then formed this research group called Midas which stood for Mining Data At Stanford. We did a lot of good work on data mining. Then there was this guy called Larry Page who wasn’t really a part of the Midas group but was a friend of Sergey and would show up for these meetings. He was working on this very cool idea of doing random walks on the web.",
      "When I understood what the World Wide Web would look like, I knew I had to somehow force randomness into it. When Larry showed us what he was doing, it was like a complete epiphany, we thought it was absolutely the right thing to do. So Sergey got involved and it became a sub group inside Midas. I was really a good sounding board for Sergey and Larry and I could relate to what they were doing through randomness. They then created a search engine called Backrub. It was running as a search engine from Stanford just like Yahoo ran till the traffic got big and the IT guys sent it off the campus. So these 2 guys would come to the office and say “hey we need some more disc space”. They were completely non respectful of me, which was a wonderful thing. They treated me like an equal. These 21 year old guys were demanding things from me. They needed more disc space because it’s getting bigger. So we need more disc and more money. There are still pictures around the building of how they used to use Legos, to create a box inside which the discs were being put. These discs were those cheap ones bought from the back of a truck and were generating a lot of heat. So they put it in Legos to allow for air circulation.",
      "For me it was a fun research project. We had a lot of ideas which we shared. At some point this thing started getting very serious and we wanted a better name for this than Backrub. So somebody came up with the name Google. Google means 10 raised to the power of 100. It is actually spelt as GOOGOL but somebody miss spelt it and that’s how the search engine got its name. Of course the official story is we deliberately spelt it that way but my guess is we miss spelt it.",
      "So Google started and pretty soon everybody in the world was using Google. The results were much better than all the other search engines going around. It was by word of mouth like I tell my brother to use it, he would tell his wife, wife would tell her kids and so on. At some point these guys said we want to start a company. Everybody said it was not worth it. There were 37 search engines already there. How would you raise money? How would you form the company? But they decided to do it and they did it. There were some big names which supported the company. Andy Bechtolsheim, an ex-Stanford guy who along with Vinod Khosla had founded the Sun Microsystems, put in a little bit of money. They managed to raise a million dollars. They started the company and it was right here in the university avenue. It used to be on my drive home so I used to go and hang out with these guys. It used to be wonderful.",
      "Then they took over the world!",
      "Right now the other search engines don’t even compare and I remember people who I don’t want to name saying why do you need another search engine? Today it is the most used search engine. Feels like I was part of a little bit of history and contributed to that history.”",
      "Sergy Brin and Larry Page founded Google on September 4, 1998.",
      "In his tribute to Rajeev, this is what Sergy Brin said, “Officially, Rajeev was not my advisor, and yet he played just as big a role in my research, education, and professional development. In addition to being a brilliant computer scientist, Rajeev was a very kind and amicable person and his door was always open. No matter what was going on with my life or work, I could always stop by his office for an interesting conversation and a friendly smile.",
      "When my interest turned to data mining, Rajeev helped to coordinate a regular meeting group on the subject. Even though I was just one of hundreds of graduate students in the department, he always made the time and effort to help. Later, when Larry and I began to work together on the research that would lead to Google, Rajeev was there to support us and guide us through challenges, both technical and organizational.",
      "Eventually, as Google emerged from Stanford, Rajeev remained a friend and advisor as he has with many people and startups since. Of all the faculty at Stanford, it is with Rajeev that I have stayed the closest and I will miss him dearly. Yet his legacy and personality live on in the students, projects, and companies he has touched. Today, whenever you use a piece of technology, there is a good chance a little bit of Rajeev Motwani is behind it.",
      "This is how Larry Page remembered him, “Rajeev was a wise theoretician that had the rare knack and desire to turn theory into practical applications. Rajeev was always willing to lend an ear and a brain to anyone, even to me as a confused student. With his always open door and clever insights, Rajeev was instrumental in the early work that led to Google.”",
      "Ron Conway, early stage investor in Google, Ask Jeeves and PayPal, recollects, “Rajeev was always so generous with his time. I was talking last night to Rajeev’s brother, Sanjay, and we concluded that there must have been THREE of him!!! ….one was always at university café and another was always at Stanford and the other one at google!!”",
      "Humble to the Core",
      "David Hornik of August Capital remembered Rajeev as a friend, “It is one thing to be friendly with someone in the business world. It is another thing altogether to consider them a friend. Rajeev genuinely liked people and people genuinely liked him.”",
      "One of his instructors from IITK recalls, “I met him only infrequently since 1983, but I’d get in touch with him whenever any need arose, either for myself or for a student. Rajeev would render his help promptly and he’d answer e-mails without any delay. Only now I realize, reading about him, how busy though he had been all through. I recall that in 1999 June I went to his office to meet him. When I reached, an undergraduate student of his theory of computation course was there to clear some doubts. From the questions the student was asking, it was evident that the student had put in hardly any effort in the course. Most of us would be very impatient with such students. Rajeev, however, was not only patient but also friendly– I still remember how beautifully, without using the whiteboard, Rajeev explained, just through words, why the problem of checking if an input TM would ever make a left move when started on a blank tape is decidable. I could see that the student understood the argument, and he left the office very happy. It was a lesson to me — I realized that people of true excellence have no problems at all in accepting shortcomings in others.”",
      "When Rajeev received Godel Prize in 2001, this is what he so humbly said, “I got the Godel prize for my theoretical work. In science it is said that one guy stands on the shoulders of another and another on his and so on. The guy on top gets the prize. In my case I was on the tip of the pyramid and so got the prize. Everyone forgets the pyramid.”",
      "Rajeev was a school mate of Shahrukh Khan, the Indian film star, at St Columba’s High School in New Delhi and had great admiration for him. In his self-effacing style he would say, ‘that guy (Shahrukh) is brilliant and will be the No.1 in anything he takes up’. Pushing into background his own remarkable intellectual achievements.",
      "Not feeling so lucky!",
      "Prakash Tripathi met Rajeev as a 17 year old at IIT Kanpur campus in 1979. Rajeev spoke to Prakash, ironically, by the IITK poolside.",
      "“Can you jump into the waters?,” Rajeev asked.",
      "“Yes, I can,” Prakash replied.  Not because Prakash knew how to swim, but as a fresher in a campus of India’s engineering schools, in a hot summer afternoon in Kanpur, dying in a pool was a far dignified way to reject life’s conditions then to submit and surrender.",
      "Rajeev didn’t tell Prakash whether he could swim. Nor Prakash had the courage to ask. But Rajeev inspired Prakash to convert our lies into truth as a homage to future. First thing Prakash did, after graduating from IITK, was to learn to swim in IIT Delhi pool. Prakash recollects, “It’s traumatic to me today that Rajeev didn’t. That was his failing as a human.”",
      "",
      "",
      "Rajeev, 47, died June 5, 2009 in the backyard swimming pool of his Atherton home after a party celebrating the end of the school year. Rajeev’s blood alcohol level was .26 when he died, San Mateo County Coroner Robert Foucrault said. The legal limit for operating a motor vehicle is .08. Rajeev did not know how to swim.",
      "On June 6, 2009, day after Rajeev’s death, Deepak Nayar, wrote, “I was one year senior to him at IITK and when he arrived at Berkeley, I picked him from the San Francisco airport and had a run-down room ready for him (next to our run-down room abovePasandrestaurant). Four of us lived abovePasand. He and his success were admired by so many of us. So many of us looked up to him and referred to him as an IITBaap. We were proud of him. Sad it ended this way. This is not how it is supposed to be!!!!” In the classic American movie,It’s a Wonderful Life, the angel who has been sent to save George Bailey, says: “Strange, isn’t it? Each man’s life touches so many other lives. When he isn’t around he leaves an awful hole, doesn’t he?”",
      "Rajeev’s life touched so many of us. His death has certainly left a big hole.",
      "Every time you Google, you are in touch with Rajeev.",
      "=============================",
      "Rajeev Motwani graduated with BTech in Computer Science from IITK in 1983 and PhD from Berkeley in 1988. He taught at Stanford till his accidental death in 2009. A fun loving highly accomplished theoretician who could find practical application of his ideas was an early investor in several start-ups. He helped Brin and Page in 1998 to found Google. He received Godel Prize in 2001 and Distinguished Alumnus Award from IITK in 2006. A Computer Science Building at IITK in Rajeev’s name is being constructed through generous donation from his family.",
      "This story has been prepared from personal interviews and by cutting and pasting material found through, interestingly,  Google search! All credit to original contributors who are too many to be named individually.",
      "This article was originally published on Alumni Connect: https://alumniconnect.wordpress.com/2013/09/10/rajeev-motwani-there-wasnt-a-startup-he-didnt-love/",
      "",
      ""
    ]
  }
]