[
  {
    "title": "Hall 13 Chronicles: HEC Edition",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [
      "Written by: Kumar Shubham",
      "Harsh Ashok Kumar",
      "Himanshu MahaleEdited by: Sruthi",
      "Pranav",
      "KaushalDesigned by: Pankhuri Sachan"
    ],
    "content": [
      "Disclaimer: Vox Populi, IIT Kanpur, is the exclusive owner of the information on this website. No part of this content may be duplicated, paraphrased, or interpreted in any other way without written consent from Vox Populi. If you want to reproduce any of the content on this page, please contact our chief editors directly or reach out to us by email at voxpopuli@iitk.ac.in",
      "In May this year, Hall 13’s Hall Executive Committee (HEC) completed its first tenure. As the next elections for HEC are around the corner,  we explore the development of HEC, covering its initial setup, challenges, and recent changes. Vox spoke to hec members, alumni and conducted a survey to look at election problems, the unique block-wise system and reviewed past efforts to establish a functional HEC.",
      "A HEC is a committee that represents the collective views of the residents, coordinates with administration and manages the day-to-day functioning of the hall. It handles the hall budget; and arbitrates intra-hall disputes, if any.",
      "The demands for creating an HEC in Hall 13 gained traction due to various issues faced by its residents. These issues included (but weren’t limited to):",
      "The impetus for change was catalysed by a group of PG students from the design department, who had seen how HECs functioned at other halls. A PG student stated, “Almost all PGs had joined in,” emphasising the broad-based support for the initiative. Discussions with hall administration were carried out, but they proved inconclusive.",
      "There were also previous attempts by UG Y22 students after COVID-19 to establish an HEC. However, their attempts were shut down with the reasoning that their tenure would be too short, given the time it takes for campaigning and elections.",
      "Initially refusing their demands last year, the hall office and wardens eventually agreed to the formation of an HEC for Y23s after the Students’ Gymkhana got involved.",
      "The HEC of Hall 13 follows a block-wise structure, with each block (A to F) having two positions for student representation, assigned randomly. In 2023-24, two wings in the F block were allocated to MDes students, so one HEC post, Mess Secretary, was reserved exclusively for them. Additionally, residents from each block can only vote for the two posts designated for their respective block.",
      "Also, differing from other halls, there is an absence of a president within the HEC. When asked about the rationale behind this distinctive arrangement, Sambhav (a Y23 HEC member from MDes.) responded, “We aimed for a structure that ensures equitable representation of every block, so we can prioritise the concerns of each block.”",
      "This framework was created by students during discussions with wardens, the hall office, and Gymkhana representatives. When asked about the same, Dhwanit Balwani, ex-PSG, said, “First-year students are new and don’t have administrative experience. They don’t know how to run a team of students together while leading as a president. They don’t have enough calibre for such a task. This can also result in one person having irregular power over others.”",
      "Dhruv Misra, the current PSG, stated “The role of Hall President involves a significant amount of responsibilities, and it’s unfair to expect first-year students to be aware of all the nuances at the very outset. The responsibilities of the Hall President were dealt with majorly by Dhwanit (as PSG) and I (as Convener, CoSHA). There is no specific representative for Hall 13 in CoSHA, but all the concerns of the Hall are put forth by the Convener, CoSHA in the meeting, and since it is open to the entire campus community, the entire HEC or any individual from Hall 13 can attend.”",
      "In our survey, 68% of Hall 13 residents largely agreed with Dhruv regarding not having a Hall President.  Vox also attempted to reach out to the ex-Warden, Prof. Mohite, however, he was unavailable for comments.",
      "The HEC elections, conducted by the Election Commission in October, took place two months after the Y23s arrived. The code of conduct was enforced immediately, followed by campaigning and a soapbox. Mess, Maintenance, and Sports secretary positions saw the highest nominations, with four contestants each. Cultural secretary had two candidates, while accounts and common room had one each.",
      "On Election Day, a technical error in the online polling portal led to uncounted votes. A second round of voting using paper ballots was held the next day, but the turnout was significantly lower.",
      "From the survey of 220 responses, 51% voted in both elections, while 23% did not vote at all. Among non-voters, 30% felt their votes wouldn’t matter, and 28% cited a lack of awareness and transparency.",
      "NOTA won against candidates for Maintenance and Accounts, leaving these positions vacant. In the first HEC meeting, it was decided that one member would manage three positions, with no additional nominations, unlike other halls.",
      "The survey collected responses to gauge people’s impressions of how effectively the students believed the HEC could conduct its duties given its unique characteristics.",
      "When the GBM was asked about their views on the block reservation system, 51% of the respondents opposed it. We then asked whether residents felt the HEC was biased towards one hall. Notably, nearly 44% of participants perceived such a bias, indicating a significant concern. Additionally, one of the residents mentioned, “The HEC closes the mess citing pest control whenever there is hall day in any of the parent halls,” and various others shared similar sentiments, suggesting potential influence from the parent halls.",
      "Next, to assess the accessibility of the HEC to the residents, we asked them to rate it on a scale from 1 to 5, with 1 being not accessible at all and 5 being very accessible. The responses varied widely, ultimately averaging out to a score of 2.72, highlighting a significant disparity in residents’ perceptions of HEC accessibility.",
      "When questioned if the HEC was able to make an impact in their tenure, 73% of people denied the notion. They pointed out the problems of washing machines not being solved despite continuous requests, and the quality of mess food fluctuating among other reasons.",
      "We also sought residents’ opinions on two major HEC initiatives: the Diwali Celebration and the Hall Day Celebration.",
      "The Hall Day Celebration received mixed reviews. Some responses pointed out issues with management by HEC and some deemed the event expensive. One respondent pointed out, “The Hall day celebrations created a lot of controversies and even fights within the hall residents and HEC. Even within the HEC all the members were not in favour of Hall day. It was somehow forced on the Hall residents.“",
      "The Diwali Celebration received mainly positive reviews. With people calling it a better initiative than hall day. One respondent noted, “The HEC did an exceptional job organising the event, setting it apart from all other halls. From the morning Diwali Pooja to the evening firecracker show, everything was magnificent, attracting large numbers of attendees from other halls.”",
      "Note:The following part of the article is based on discussions with :",
      "Deepankur Kansal,Y18, an HEC Member of Hall 13",
      "Vedaant Sikka, Y18, President, Students’ Gymkhana 2021-22",
      "The first UG batch residents of Hall 13 were the Y18 batch. Initially, Hall 13 faced several issues, mainly regarding basic amenities in the mess. This led to a need for a Hall Executive Committee (HEC) to improve living conditions. Many students approached the Hall Warden, and it was decided to establish an HEC, but without elections.",
      "The initial structure had each of the 36 wings selecting a wing representative among themselves. These 36 representatives were divided into four groups of nine, focusing on Mess, Maintenance, Sports, and Cultural activities. However, this structure faced difficulties as no one had signing authority for any of these domains.",
      "To address this, the size of each group was reduced from nine to two, giving these individuals the authority to make decisions based on discussions with the entire group. This change reduced the total number of representatives from 36 to 8. Although this structure functioned better, many members lost interest over time, and the number of active members dwindled. By the end of the HEC’s tenure, some financial issues in Hall 13 led the warden to decide against having an HEC in the future.",
      "When the Y19 batch arrived, they were not allowed to form an HEC. However, in November, a new warden, Professor PM Mohite, took charge. The President, Students’ Gymkhana and the Convener of COSHA resumed discussions with the new warden, successfully advocating for the formation of an HEC. This time, members were nominated based on interviews rather than elections, and notably, the HEC did not have a president.",
      "Shortly after its formation, a mid-semester break happened, and as students did not return to campus due to COVID, limiting the HEC’s activities.",
      "Later, during the tenure of Vedaant Sikka, the Convener, CoSHA for 2020-21,the initiative to form an HEC for the upcoming batches (Y20 and later) was takenl. A model for the same was discussed in the CoSHA and a proposal was passed which suggested the following:",
      "Overall, it was stressed that Hall 13’s concept differed from other UG halls, focusing primarily on improving facilities and organising cultural events like Hall Day v/s the role of parent UG HECs which additionally involves participating in GC & other inter-hall events.",
      "However, due to uncertainties about the residence and the late arrival of the Y20 and Y21 batches, the formation of the HEC did not work out as planned. Furthermore, the structure was not carried forward for subsequent batches of Y22 and Y23.",
      "Vedaant believes that a better structure to implement for HEC would resemble his proposal.",
      "He also discussed how the mixing of undergraduate and postgraduate students in the halls, initially implemented as a temporary measure due to a crunch in hall capacity, is not the ideal model, due to their fundamentally different expectations from halls. With the recent increase in hall capacity, he emphasised the need to revisit this arrangement and reduce UG-PG mixing in halls to the extent possible",
      "As this tenure of the Y23 HEC has concluded, some faith has been built that freshers can handle their own affairs. The current HEC has vowed to ensure that the next HEC is formed and a transfer of power takes place smoothly. They have secured support from the warden for future tenures. Starting next year, any vacant HEC positions could be filled through the standard renomination and interview process in consultation with the warden.",
      "With a new HEC set up in Hall 13, questions come up about how to ensure fair and adequate representation. Considering the significant presence of postgraduate students in other UG halls, should their representation be proportional to their numbers there as well? Similarly, does the precedent set by Hall 13 suggest that fresher undergraduate girls should have representation in the HEC of Hall 4? These are questions that merit further investigation.",
      "Written by: Kumar Shubham, Harsh Ashok Kumar, Himanshu MahaleEdited by: Sruthi, Pranav, KaushalDesigned by: Pankhuri Sachan"
    ]
  },
  {
    "title": "Piled Higher and Deeper (PhD) @ IITK – II",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [
      "Written By: Aditya VS",
      "Ayushi Waghmare",
      "Likhith Sai Jonna",
      "Mahaarajan J",
      "Mayur Agrawal",
      "Vijaya Mishra"
    ],
    "content": [
      "Disclaimer: Vox Populi, IIT Kanpur, is the exclusive owner of the information on this website. No part of this content may be duplicated, paraphrased, or interpreted in any other way without written consent from Vox Populi. If you want to reproduce any of the content on this page, please contact our chief editors directly or reach out to us by email at voxpopuli@iitk.ac.in",
      "——————————————————————————————————————–",
      "",
      "",
      "We at Vox recently undertook an investigative study delving into the challenges of PhD students at IITK, aiming to understand and report the current situation and shed light on the institute’s stance.",
      "",
      "Vox floated a survey on 20th July, 2023 to the PhD community receiving ~200 responses, with many students also sharing their anecdotal experiences. The first part of the article details the demographic division of the respondents and deals with problems in the academic sphere. The article can be readhere.",
      "",
      "Continuing with our analysis, the second part below presents an investigation of the financial and personal problems of the PhD students. We also uncover the various mental issues and the stigma around it in PhD students. The survey results are triangulated with comments from various professors such as heads of departments, the Chairperson of the Student Postgraduate Committee (SPGC), the Dean, Research and Development (DoRD), and the head of Counselling Service to gain a holistic view of the issues.",
      "",
      "",
      "Financial Constraints",
      "",
      "The key source of funds for the PhD students is the institute assistantship, as most of the respondents received a sum of 30-40K monthly, according to the survey response.The government of India recently raised the stipend against 8 hours of teaching assistantships, post-conduction of this survey.",
      "",
      "Previous emoluments (monthly)",
      "New emoluments (monthly)",
      "JRF (Junior Research Fellowship; received in 1st and 2nd year)",
      "31000",
      "37000",
      "SRF (Senior Research Fellowship, received in 3rd to 5th year)",
      "35000",
      "42000",
      "A detailed division of monthly emoluments received is provided in the graph below, as collected from the survey.",
      "",
      "Also, it must be noted that the above assistantship is continued only for 5 years, after which 10k is given per month for one semester, followed by 8k monthly the next. After this, the assistantship is stopped. This forms a critical concern given that a PhD extension beyond the 5th year is so common.",
      "",
      "Our survey also showed that around 84% of the respondents are expected to contribute financially to their families. In another question, when asked if they were satisfied with the current cumulative stipend (before the raise), around 85% of the respondents expressed denial, expressing the need to it increase it.",
      "",
      "We had a number of different opinions shared by the respondents about the PhD stipend.",
      "",
      "“Since PhDs are adults, we are expected to support our parents and use our money wisely. Since 35k stipends are used for many things, such as tuition fees, hall fees, accommodation, food, etc, 35k fund is quite tight. The process of refund of research grant which takes very long time makes it worse.”",
      "",
      "“The fellowship for a PhD scholar is sufficient to cover his/her expenses after the recent hike in fellowship.”",
      "",
      "Prof Tarun Gupta, Dean, Research and Development (DoRD), suggested that",
      "“Fellowship reduction can be matched by PI after 5 years if the student has financial needs. The natural extension should be given. Even when the PI cannot aid, the Head of the Department should chip in and provide funds if the need is legitimate. No department is short of resources, and PhDs should be supported and respected.”",
      "",
      "",
      "We asked Prof. Santanu Misra, Head Counselling Service, and he commented that",
      "",
      "“ICS is unable to directly address the financial challenges faced by PhD students, as this falls outside the scope of our responsibilities. However, students have the option to apply for an interest-free loan via the SBF, the process for which is quite simple and available on both ICS and DOSA websites. Nevertheless, it is a good idea and I strongly encourage PG students to engage in proper financial planning and make savings that can be used after the completion of regular fellowship. This saving is also useful for many other purposes even after finishing the degree.”",
      "",
      "Lab funds",
      "",
      "Many of the subjective responses to our survey commented on the monetary situation in their labs. On the use of lab funds, while most of the respondents were unsure of the situation, 34% opined that they were used appropriately or distributed among the students. However, scattered dissent on the same was visible in the subjective responses and anecdotal experiences.",
      "“Project money is mostly used for guide’s personal purposes. Guide told us to spend our own money for research even if we have the funding for the same area.”",
      "",
      "“None of the amount allotted for the lab development is used on students. All are used by the supervisor.”",
      "",
      "Talking with professors on the issue, most denied its presence on a large scale, though accepted the existence of exceptions. Prof Tarun Gupta, DoRD mentions:",
      "“It is neither possible nor the mandate of DoRD to micromanage the projects. However, there is a strong surveillance mechanism in place. All capital instruments purchased are entered in the stock register, and annual stock verification happens across the institute for assets not written off. There is a proper system of checks and balances in place, and a Chief Vigilance Officer (CVO)* takes care of it.”",
      "*TheChief Vigilance Officerof the Institute assists the Director in all vigilance related matters. Currently Prof. Ashwani Kumar Thakur currently serves at this position.",
      "",
      "",
      "",
      "Conferences",
      "",
      "Attending conferences is integral to research. The current situation of funding for conference registration and travel can be understood by the survey response, where mostrespondentswho needed funds could avail partial sums of money, with only 5 of them mentioning that they couldn’t get any support.",
      "",
      "Dr. B.V. Phani,Head, Department of Management Sciences, informed us about a Cumulative Professional Development Allowance (CPDA) provided to each faculty member for travel support in attending conferences, etc,",
      "He added, generous travel support is also provided to students of IITK at all levels, forUG & Masters Studentsandhere forPhD Students.",
      "",
      "In case additional support is needed both the department from its Department Promotion Accounts (DPA) and the concerned faculty advisor from their  Professional Development Accounts (PDA) also provide additional support. The money available in the Departmental and Personal Development accounts comes primarily from various consultancy and research projects undertaken by the faculty in addition to their teaching, mentoring and advisor responsibilities.",
      "",
      "",
      "",
      "Personal Life",
      "",
      "Students everywhere face a myriad of problems in their personal lives, which can eventually severely impact their academic journey. We looked at the various personal issues PhD students on our campus face and the administration’s efforts to address these concerns.",
      "",
      "While various insights were received about the PhD students on campus, we observed that sustaining motivation for PhD is hard. 60% of therespondentshave at least once thought of dropping their PhD during their stay. Dividing this 60%, 40% of them eventually got motivated by someone or some achievement and 20% still had the thought at the time of the survey.",
      "",
      "We talked with professors about the statistics who emphasised on the importance of sustaining motivation for a quality PhD outcome.",
      "",
      "Dr. B.V. Phani pushes for enhancing and encouraging various activities already undertaken by some departments to enhance and promote research at IITK. He shared that",
      "“In the department we have created a system where at least one student or more are encouraged to present their work weekly with other students acting as discussants. In addition measures have also been put in place for students to mandatorily attend regular seminars from industry, post doctoral fellows  and prospective faculty. Further the students are also encouraged to attend research workshops, doctoral colloquium’s, summer schools,  to broaden their horizons and help them in holistic knowledge acquisition during their stay here, thus inculcating a culture and thirst for knowledge acquisition, which he believes is a life long process for both students and faculty alike.”",
      "",
      "",
      "",
      "Mental health",
      "",
      "On questions about mental health, around 80% of the respondents reported that they had experienced anxiety and various mental illnesses in their PhD programme, and over 34% are actively fighting to overcome it. The survey response also tells the manner of combating mental illness. While around 62% of the people who suffered from any form of mental illnesses could battle them out with the help of their friends and family, only 11% took aid from the Counselling Service (CS), and another 10.5% took the help of someone outside to battle their mental illnesses, while 16% didn’t take any assistance until now.",
      "",
      "We talked with Prof. Santanu Misra, Head of Counselling Service, on various questions arising from the above trends and the role counselling service plays.",
      "",
      "On asking about the limited reach of CS, he mentioned that",
      "“The number of students approaching ICS is has increased over the years. This increase is also due to the fact that we now have a larger number of PG students than in previous years. In our regular de-addiction clinic sessions, students seek help for more than just addiction, and often come to us with a variety of personal issues. The consultant psychiatrists and the institute counsellors are committed to listening to all the problems they present and providing the best care possible.”",
      "",
      "",
      "We also asked in our survey about the social life of the students on campus. On their social relations, 33% of the respondents admitted feeling isolated or lacking friends.",
      "",
      "On the question about their extra curricular involvement around 70% of therespondentsare unable to participate in such activities. The primary factor contributing to this limited involvement is the the time constraint.",
      "",
      "In the subjective response to this section of the survey, there were some remarks on the confidentiality maintained in Counselling Service.",
      "",
      "“Though there is a counselling service, but I have heard of my friends that they don’t at all keep things secret. They involve the department and as usual they insist to drop the PhD consequently as they don’t want to take responsibility.”",
      "",
      "For the above concern and on problems involving the guide of studnet, the CS head commented,",
      "",
      "“The students first approach our counsellors as they are the trained professionals who prioritize confidentiality in all student-counsellor sessions. Our counsellors understand the importance of privacy and breaching it can have serious consequences to the purpose of the ICS. Therefore, the counsellors only share Information to me, if administrative support is required, and even then, it’s only after obtaining the student’s consent.Concerning the student-supervisor conflict, my observation is that it is mostly due to a lack of communication between the student and supervisor. IIT Kanpur has several mechanisms in place to resolve this problem, for example, DPGCs, Doctoral Monitoring Committees, DSAC etc. However, there is a definite need to enhance their effectiveness and develop a more PG student-friendly environment in the campus.”",
      "",
      "",
      "",
      "We also talked about the role of the PG core team with Prof. Misra. Talking about the participation of PGs in the counselling service, he mentioned that the purview of the PG core team is limited compared to the UG team.",
      "",
      "“The majority of the PG core team members in the ICS are M. Tech. students. I believe involvement of PhD students in the ICS is crucial, though currently, their participation is significantly low, sometimes even non-existent. It is essential to acknowledge that PG students at IIT Kanpur, including PhD candidates, experience a journey distinct from that of our UG students. They engage in specialized coursework, devote more time to research-sometimes alone in the lab, and often juggle family responsibilities and future career planning.  Given these unique challenges and staying inside a campus, PG students must establish a harmonious presence on campus and maintain a healthy work-life balance. If more PhD students join the ICS, it will make the support system better for all postgraduate students at the institute, as it will meet their specific needs and requirements.”",
      "",
      "",
      "Students also mentioned the lower number of leaves and increasing them for better mental health, on which the SPGC chairperson said, “The new PGARC has taken this into consideration and necessary policy change has been incorporated. He also mentioned about the Joint Degree programs for PG students“.",
      "",
      "",
      "",
      "TA duty",
      "",
      "TA duty also plays an integral part in the student’s journey. While mostrespondentswere satisfied with their teaching duties, some problems were also reported to us. However, not all students were required to work on TA duty, withrespondentscommenting that they hadn’t been given any TA duty.",
      "",
      "Some of the key problems therespondentsreported are:",
      "PMRF teaching duties are haphazard and need to be made effective.",
      "Allotment was a key problem reported by students. They noted that they often don’t get courses of their choice, and the distribution also depends highly on professors.",
      "Some students also commented that the actual hours of work become more than the fixed hours of work.",
      "“4 hours per week is required. But we have to make presentations, question papers, solve doubts from students and check their papers, which requires more than 4 hours per week.“",
      "Variability is observed in teaching duties, and conditions also vary with  semester. Students mentioned about lack of specified TA duties, which leads them doing a wide range of tasks from making questions in exams to regularly attending classes.",
      "",
      "",
      "",
      "Conclusion",
      "",
      "While it is evident that the PhD culture at IITK is no exception to problems, as with every human-made institution, the importance is of their recognition and a collective temperament to strive towards solving them.",
      "",
      "While analysing the presented results, one must note that the investigation is based on a survey response designed to detect problems in the system. We must keep in mind that the current system also produces some of the best research scholars in the nation. This efforts draws attention to the current lags in the system and the need to actively incorporate student concerns into the decision-making process, ultimately contributing to a more enriching PhD experience at IITK.",
      "",
      "",
      "",
      "Design By: Abhik Biswas, Harshpreet Kaur, Shivam Rathore",
      "Edited By: Bhavya Sikarwar, Soumyadeep Datta, Utkarsh Agrawal",
      "Written By: Aditya VS, Ayushi Waghmare, Likhith Sai Jonna, Mahaarajan J,  Mayur Agrawal, Vijaya Mishra",
      "",
      ""
    ]
  },
  {
    "title": "Piled Higher and Deeper (PhD) @ IITK – I",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [
      "Written By: Aditya VS",
      "Ayushi Waghmare",
      "Likhith Sai Jonna",
      "Mahaarajan J",
      "Mayur Agrawal",
      "Vijaya Mishra"
    ],
    "content": [
      "Disclaimer:Vox Populi, IIT Kanpur, is the exclusive owner of the information on this website. No part of this content may be duplicated, paraphrased, or interpreted in any other way without written consent from Vox Populi. If you want to reproduce any of the content on this page, please contact our chief editors directly or reach out to us by email at voxpopuli@iitk.ac.in",
      "——————————————————————————————————————–",
      "",
      "Nearly every accomplished scientist, researcher, or professor passes through the journey of a PhD student. This high academic pursuit demands not only intellectual but also emotional strength to ensure innovative research in the specialised field. In IITK, over 2000 students are pursuing their PhD across more than20 diverse disciplines.",
      "",
      "",
      "The recent incidents of student’s demiseon the IITK campus and the following protests stirred various questions about student well-being and their situation on campus. PhD students, comprising one of the largest parts of the student community, spend the maximum amount of time on campus than students in any other program. However, the successful completion of a PhD is not solely dependent on an individual’s determination; it thrives within a nurturing academic environment supported by financial stability and prioritised mental well-being. The institute and its policies are crucial in ensuring the availability of these elements to students.",
      "",
      "We at Vox recently undertook an investigative study delving into the challenges of PhD students at IITK, aiming to understand and report the current situation and shed light on the institute’s stance.",
      "",
      "",
      "",
      "Vox floated a survey to the PhD community on 20th July 2023 and received ~200 responses, with manyrespondentsalso sharing their anecdotal experiences. The respondents constituted  25.3% females, 74.2% males, and 1 person identifying themself as non-binary.",
      "",
      "The respondents varied across a whole range of departments, with the majority being from Civil (15.6%), followed by Electrical (13.1%). The below below provides insight into the batch backgrounds of the respondents.",
      "",
      "To further gather the administrative perspective and insights on problems and policies, we discussed these matters with heads of departments, the Chairperson of the Student Postgraduate Committee (SPGC), the Dean, Research and Development (DoRD), and the head of Counselling Services.",
      "",
      "",
      "We’ve organised the investigation into two parts. This article presents the first part of the investigation, which deals mainly with the challenges within the academic sphere. This will be followed by a second part (Piled Higher and Deeper (PhD) @ IITK – II) dealing with financial constraints and personal-level issues.",
      "",
      "",
      "",
      "The Academic Space",
      "",
      "The primary figure in any PhD student’s life is their guide, and their interaction with the students is one of the key determiners of the students’ PhD experience. Furthermore, the role of labs and peers is also critical, along with the institute policies and the support system surrounding it, forming an essential ingredient of the student’s academic pursuits. We asked the students various questions related to these different aspects of the academic space.",
      "",
      "",
      "",
      "PGARC 2020 Implementation",
      "",
      "A recent step in addressing the problems of postgraduate students at the IITK campus was thePost-graduate Academic Review Committee (PGARC), 2020-21, whose report has been under implementation since July 2023. Vox also covered the highlights of PGARC 2020-21 inthis report.However, a significant revelation was the need for more awareness amongrespondentsabout the PGARC implementation, with about85%of the survey respondents being unaware of it.",
      "",
      "Prof. Y.N. Mohapatra, who chaired the panel for drafting PGARC 2020-21, states on its implementation, “So its already a year since we’ve been preparing to implement, most of it is implemented to the extent possible, some of it, of course, is far-reaching and requires lot more infrastructural or legislative work, so that is being taken up.”",
      "",
      "",
      "",
      "Interaction with the PhD guide",
      "",
      "Our survey revealed a spectrum of opinions regarding the approachability of academic guides. Asked on a scale from 1-5, 47.4% of the respondents gave their guide a 5-pointer, i.e., as very approachable. This was followed by 21.1% of respondents giving a 4-pointer, 13.4% a 3-pointer, 10.3% a 2-pointer, and the remaining 7.7% a 1-pointer to their guides.",
      "",
      "A similar trend was depicted in response to the question about the frequency of meeting the guide. About 18% mentioned they rarely met their guides, with 38% as the highest share corresponding to 3-4 meets a month.",
      "",
      "Various professors stressed the importance of students showing proactiveness in contacting their professors as a self-initiative. Prof. J K Bera, HoD Chemistry Department, stated that",
      "“The time/attention given to students varies according to their needs. Students who bring interesting and challenging problems/results tend to receive more access. Students who are lagging should be given extra attention/time . Students should prepare well for the meeting with supervisor to utilise the meeting time more effectively.”",
      "",
      "",
      "",
      "We received concerns from students over the number of students per guide. Some departments, such as the Chemistry department, have a high student-to-guide ratio. However, Prof. Bera commented on this high ratio, “The department does not have a cap on the number of students in each group. Some departments do have such restriction.  Labs have different requirements and funding. This is at the discretion of the lab supervisor.”",
      "",
      "However, the PGARC 2020 document addresses this issue and states that“Any faculty member who has more than one MoE (Ministry of Education) funded PhD students who are not receiving financial support from the Institute or the PI (Principal Investigator) and have not yet delivered their open seminar, should not be allowed to take a new student funded by MoE. ”",
      "",
      "Prof Y N Mohapatra also comments on the issue: “This is a recommendation and must not be taken lightly as it has been passed in the academic senate after a long discussion with student representatives as well. The data of the students will be sent to the department, and then they have to take care.”",
      "",
      "",
      "",
      "",
      "While we received several subjective responses about specific mishaps during students’ journeys, the lack of an efficient mechanism to tackle the same was seen. Prof J Ramkumar, the then SPGC Chairperson, mentioned,",
      "“In case of a disagreement between a student and a thesis supervisor, the student can first take it up to the DPGC followed by the SPGC. If it doesn’t get resolved at this stage, they can take it up to the Senate Chairman. Also, the ombudsman (here, a professor who deals with complaints made by students) performs the review independently in parallel with the institute mechanism.“",
      "",
      "",
      "",
      "",
      "Changing guide",
      "",
      "In some situations, students want to change guides for various reasons, which has been a complex process.Prof J Ramkumar mentioned that now the DPGC can intervene and allow the student to change supervisor.",
      "",
      "The issue of students’ request for guide change was discussed with Prof. Bera. It was revealed that such requests do arise and each case is considered, and a decision is taken. The difficulty lies in finding a suitable lab with similar research interests. Also, there exists a potential misuse of this option.",
      "",
      "",
      "",
      "",
      "",
      "Discrimination",
      "",
      "Survey responses showed the limited occurrence of discriminatory acts within the academic sphere at IITK. The major contributors to the present discriminatory acts included favouritism and quid pro quo (a favour granted in return for something) of guides and the incidents of elitism and casual sexism by lab mates.",
      "",
      "",
      "The following are some of the subjective responses which represent the above responses.“One of my peers spread misinformation that I copied my research work from him and it’s easy for girls to get everything.”",
      "",
      "“There would be discussion on a scholar getting appointed as a faculty merely on the basis of gender (she is a girl isliye usko mil gaya hoga job). Very casually the male colleagues would say ” tum logo ko toh ghar pe contribute bhi nahi karna padta hai, hum par toh pressure hota hai”.”",
      "",
      "“My guide provides easy funds and helps in research work to favourite students and I have felt my guide less approachable even after 3 years of working.”",
      "",
      "Labs",
      "",
      "Various students expressed about the lab situations in their departments.",
      "“In the laboratory, there are particular persons allotted to use equipment and instruments. Others can only use when those persons allow them or whenever they are free, so others have to wait for a week or sometimes a month too. It’s like begging from them not like a feeling of the same lab and same institute.”",
      "",
      "“My department does not get adequate funds to buy GPU resources. We are using 8 years old outdated GPUs which are of no use now”",
      "",
      "“I’m facing delays in my work due to delays in order of equipment and other items that are needed for my work. There is a crunch in financial support/ research funds from the department.”",
      "",
      "A common concern from the students was the need to simplify procedures for equipment procurement, such as removing the need for multiple vendor quotations on large purchases and reducing taxes on overseas equipment.",
      "",
      "Prof Tarun Gupta, DoRD, acknowledged these issues and informed us that",
      "“Such policies are from the governmental side, and the students can write to MoE about this. There is little we can do about this from our end.”",
      "",
      "",
      "",
      "Future options",
      "",
      "We also looked at the future options for PhD graduates and their current aspirations.",
      "",
      "Though the majority of therespondentsare optimistic, the highest section, 39% of therespondents, agreed to have limited opportunities. However, around 37% of therespondentswere unsure or said it would be difficult to find deserving work.",
      "",
      "",
      "",
      "While PhD students are interested in an industrial employment, academia is their first preference. Regarding career prospects, apart from the key academia and industry, few students also mentioned pursuing entrepreneurship, civil services, think tanks, or science communications.",
      "",
      "",
      "Different professors also provided varied perspectives on the students’ post-PhD prospects.",
      "Prof Misra mentioned,“PhD program is the most advanced degree program and has certain processes and protocols to follow. Most importantly, the PhD program has inherent uncertainty. Therefore, keeping motivation during PhD program is very important. My personal suggestion would be, before committing to a PhD, make sure that you are genuinely interested in pursuing this path. It is also a good idea to have prior information about the department, potential supervisor(s), research facilities and other available opportunities etc.”",
      "",
      "Prof J Ramkumar said, “These days, the only option for PhD scholars is not academia, but corporate is also feasible. I’d advise PhD graduates to explore corporate jobs as well.  It is a myth that the Government of India imposes an age limit in academia. For an outstanding work, no academic institute will impose hard conditions.”",
      "",
      "",
      "",
      "Institute Policies",
      "",
      "One key component of the new PGARC is mandating DMC (Doctoral Monitoring Committee). Prof Y N Mohapatra believes that DMC is important because it leads the student and the faculty to present how useful the semester has been, regularly checking the student’s progress. However, he was concerned that the system sometimes gets defied by getting signatures without actual physical meetings happening on grounds of logistical constraints. He stressed the importance of an actual physical meeting, and that the system should be followed for the student’s betterment. Also, questioning the neutrality of the constituent professors in the committee, he commented,",
      "",
      "“DMC is not a policing system. There can be abuses, but any academic system should have transparency, and the supervisor must choose transparently. Normally, when the supervisor chooses, they choose in a manner such that for that particular research problem, there can be inputs from the other faculty so that the student will understand and appreciate it.”",
      "",
      "",
      "",
      "",
      "The issue of delayed degree completion at IITK resonated heavily in the student circles. We at Vox conducted a swift analysis of 236 PhD students who graduated from IITK in 2023(Official List), revealing that the average program duration was7.625 years.Only 4% completed the PhD in 5 years.",
      "It is to be noted that an error of -0.5 years is expected due to a mismatch of graduation and convocation timing, and also, the COVID years played a strong role in framing these graduation statistics.",
      "",
      "Some students reported delays in the final checking of thesis work from the professor’s end as a reason for degree extension. Conversing with Prof. Bera, he said,",
      "“Often there are complains on the delay in checking of thesis/manuscripts from the professor’s end. Both faculty and students stand to gain by publishing a paper or completing a thesis. I do not see a deliberate attempt to slow down the process. It has a lot of back and forth, and if the first draft is rudimentary, it will naturally take more time.”",
      "",
      "On the arguments that stringently time-bounding PhDs will compromise with quality, Prof. Y.N. Mohapatra states,",
      "“In my personal opinion, we haven’t seen that extending the degree has resulted in better quality. Most high-quality PhDs are actually done in time. If it’s extended, then there is trouble and one is trying to find minimum ways of making sure that the PhD is of quality.”",
      "",
      "While conversing with the then SPGC chairperson, Prof. J Ramkumar, he mentioned,  “The DMC are being appointed and the student progress are closely monitored regularly by the department on their research progress and will be uploaded in the Student Dashboard.  The number of mandate courses have been reduced for the comprehensive exam requirements.”",
      "",
      "He also mentioned some other recently introduced changes to tackle this problem.",
      "",
      "a) We have digitised student-related forms to a large extent to facilitate student administration better.",
      "b) The duration of sending reminders to the external examiners has been reduced from the current 6 weeks to a shorter period. The MS (R) external review is being removed. Keeping the review time into consideration, the number of external examiners is also reduced.",
      "c) Policy of exit with MTech degree for PhD scholars is streamlined, keeping students’ interest in view.",
      "",
      "Various other measures addressing the problems of PhD students were accepted post-protest on 19th January by the administration and are under implementation.",
      "",
      "Soumyadeep Datta, PG Representative of the Senate Educational Policy Committee (SEPC) quoted in a discussion,",
      "“PhD is not a course-based degree, and research is, by nature, unpredictable. Different departments – even different specializations/fields in the same department – can have very different timelines for executing research work. Some fields might be more competitive than others regarding hiring prospects post-PhD. This needs to be considered while comparing PhD completion times across departments. However, some factors – as rightly pointed out in the survey – are common pain points, and the Institute bodies are trying to iron out issues. The process of consensus building has been slow since different departments and faculty members have very diverging viewpoints, but it is happening. The Institute needs to realize that the glamour of a PhD degree, even in the IITs, is declining rapidly due to word of mouth, and the program will soon have an existential crisis if concrete steps are not taken to address the time delays and other concerns.“",
      "",
      "While the above covers varied aspects of PhD students’ academic life, we will be covering financial and personal problems PhD students face in the following piece. Stay tuned to read the second part of the article, where we explore more about PhD students and their problems on our campus.",
      "",
      "",
      "",
      "Design By: Abhik Biswas, Harshpreet Kaur, Shivam Rathore",
      "Edited By: Utkarsh Agrawal, Bhavya Sikarwar",
      "Special Contributions By: Soumyadeep Datta",
      "Written By: Aditya VS, Ayushi Waghmare, Likhith Sai Jonna, Mahaarajan J,  Mayur Agrawal, Vijaya Mishra",
      "",
      "",
      ""
    ]
  },
  {
    "title": "Lost In Translation: Language Barriers at IITK",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [
      "Written by: Abhijit Jowhari",
      "Aditya VS",
      "Gupil Chhabra",
      "Mahaarajan J",
      "Sruthi SubramaniamEdited by: Kunaal Gautam",
      "Mohika AgarwalDesign by: Mrunmay Suryawanshi",
      "Sachidanand Navik",
      "Vardaan Vig"
    ],
    "content": [
      "The IITK community is diverse in terms of language origins. When speakers of varied languages interact, we often experience a barrier to open and free communication. First day of orientation and not understanding what the SGs just blabbered in Hindi. First day of classes, understanding the professor’s English was a bigger hurdle than understanding the course itself. We at Vox, tried to analyze theselanguage barrierson campus within the academic and co-curricular spheres. Read ahead to see what we found.",
      "343 students responded to our survey concerning the language barriers on campus conducted in July 2023. The following infographics depict their language backgrounds and the language they used to complete their board examinations. We see that this gives us the context required. A majority is comfortable with Hindi and English, but what about the students who do not fall into this category? What is being done? Is that sufficient and helpful? What more can be done by the various stakeholders? These are a few questions that we’ve tried to get answers to through this article.",
      "While a majority is fully to fairly comfortable, almost 10% of the students are not comfortable with English, the official medium of instruction in the institute. We further see that 19.8% of the respondents cannot interact with professors, and 9.3% face difficulty understanding lectures because of their inability to communicate confidently in English. These numbers are not mere stats, but represent a harsh reality. With a difficult curriculum like ours, such barriers can make learning almost impossible, and difficult for students to keep up with their peers.",
      "On talking to various professors, we found something similar. Some professors mention that during courses, some students either approach them with difficulty following the course content because it is in English or with a general problem in speaking and understanding English, which could lead to them feeling inferior in their peer groups. The professors, especially those taking English courses(like ELC and ENG), are supportive and suggest movies and books to the students. Some professors also told us that a few of them, especially the ones teaching English courses, suggest movies and books to better cope with English.",
      "Various respondents mention that they fear participating in academic discussions because they lack the confidence to word their thoughts in English. The institute introduced the English Language Courses (ELC 111/112/113) for Y22s in lieu of the previous ENG 112 and COM200 courses aimed at improving proficiency and communication skills in English. However, the effectiveness of these courses is put into question as 57.2% of the respondents (166) who took ELC/ENG courses believe it to be of little or no help in improving their proficiency with the language. Moreover, many mention that the ELC course allotted to them through the English Diagnostic Test, especially ELC113(Advanced), was a surprise because their English is not up to the standard. Even for the COM200 courses, an astounding 72.09% of the respondents(157) who took the course opted for the option “it was a complete waste of my time.”",
      "A few professors agree that there is a limitation of how much of a difference an English course in the curriculum can make for a student. They believe that support from the student community can have a more significant impact. One more observation they pointed out was that the ELC courses (formerly ENG112) offered to help students struggling with English run parallel with the rest of the courses. This is extremely tough on students with a poor grasp of English. They are now expected to comprehend the content and present answers in college-level English in other courses while simultaneously learning the language basics. By the time they get a good grasp on English, most of their semester is already done and dusted, placing them at a disadvantage academically.",
      "The dearth of a suitable environment to practice English is also part of the problem, as many respondents mention in their individual experiences. Ironically, some cite that the TAs and tutors usually stick to Hindi while instructing, unfurling issues for the section of the student community uncomfortable with Hindi.",
      "When asked whether the introduction of courses in regional languages would be beneficial, some professors mentioned that the struggle to work with English is one that cannot be avoided. English is the language of the world today, and in their professional life, students will have to work with it. By taking the lectures in Hindi or mixing Hindi and English, some professors feel that they are not only compromising the institution’s standard of teaching but also delaying the students’ struggle, which they have to face eventually.",
      "Another vital aspect affected by these language barriers is the social life of students. 16% of the respondents mentioned that they couldn’t participate in various club activities because of this, while another 18.1% faced difficulty in even making friends. This results in a barrier to understanding and speaking both Hindi and English fluently.",
      "15.5% of the respondents have little to no comfort with the Hindi language. The inability to interact fluently in Hindi unfurls another set of issues. A common problem mentioned by the respondents is that the mess workers, maintenance staff, etc., speak only in Hindi. Several also said they have difficulty interacting with new people and participating in campus activities as they are usually conducted in Hindi. Sharah PS, a Malayalam-speaking UG Y22, shares her experience of how she has to take a Hindi-fluent friend with her whenever she has to interact with shopkeepers. Even with some of her friends, it becomes difficult to converse as she can only reply in English. Adding on, she mentions that initially, some people were worse off than her and could have used some help. Another respondent mentions an incident where they went to inquire about a government scheme, and the official asked them to respond only in Hindi.“Even after explaining that we could not, the official told us to learn Hindi, bringing it up multiple times and joking about it.”",
      "Earlier, there were two ways in which students facing difficulties with English were given support. One was the formal help given, which consisted of courses, namely ENG112 and COM200. The other was the unofficial programs, including spoken English classes conducted by DoSA, TTC(Technical Terminology Classes), and ECC(English Communication Classes) conducted by the Institute Counseling Service (ICS).",
      "ENG112 was allocated to students based on their performance in the English Diagnostic Test conducted during the orientation. It was an extra course. Allotted students had to do it when the other students did their HSS Level 1 course. These students also had to do an HSS Level 1 course later. This led to a discrepancy in the student’s curriculum. Due to this, ENG112 was then made into an HSS Level 1 course. The curriculum for ENG112 was not fixed. It usually covered speaking, writing, listening, and reading, with the distribution varying from instructor to instructor. There was a COM200 course (till the Y21 batch), which all students had to take. There were various issues with that course, including the batch size being too big, diversity in proficiency among the students, and the time allotted for the course being insufficient to cover all the required aspects. There was also an issue of ownership of the course, with no department taking responsibility for offering the course for students who failed.",
      "In place of these courses, from the Y22 batch onwards, ELC111(Basic), ELC112(Intermediate), and ELC113(Advanced) have been introduced. Now, all students must take an English course in their first year. The level they have to take is determined by the English Diagnostic Test.However, the help that courses can provide is limited. This was recognized by the officials and the student body as the Institute Counseling service started offering TTC and ECC, and the DoSA started offering spoken English classes. These initiatives used to be of immense help to the students as they provided them with practical solutions. However, the spoken English classes by the DoSA stopped after the instructor who was taking the sessions left campus, and parallelly, the participation in the classes conducted by ICS decreased. Even the professors that we talked to noted this unwillingness of students to learn a new language. Some of them also suggested offering English courses before the start of the 1st semester, maybe in an extended orientation, so that students are better equipped to handle the other courses taught in English.",
      "Another aspect of communication courses prior to the introduction of the new UGARC was the department-level communication courses that aimed to teach students communication skills specific to their respective departments. For example, the Math department taught a course on presenting proofs, while the Electrical department’s communication course centered itself around resume-making, viva, and the likes. These department-level courses have also been discontinued with the Y22 batch, and the basket offered by ELC serves as a more comprehensive replacement. The efficacy of a new system/course is generally decided over 2-3 batches to eliminate special circumstances. Therefore, no significant change or impact of the courses can be looked at based on the feedback of a single batch.",
      "“However, while it is true that no system is by any means perfect, not all of its inefficacy falls on the administration. The efficacy of any system ultimately falls upon the people whom it serves to benefit, and ELC as a whole can only truly serve its purpose if the people who seek to improve their English communication skills truly participate and take its full benefit. Moreover, it is noteworthy that a higher-level ELC course can always be taken as an OE course by students who did a lower-level course previously and are interested in furthering their English communication skills,”said Kinshuk Siyol, student nominee to the Senate Under-Graduate Committee (SUGC).",
      "Another mechanism available for students interested in working on their spoken/written English skills is offered by the Shivani Centre, which was set up in August 2021 with the aim of reintegratingHindi and other Indian Languages at IIT Kanpur.One of the objectives of Shivani Centre is to help fresher students who completed their schooling/JEE in Hindi adjust to a completely English academia. In addition, for students who are facing issues in interacting with their peers due to a lack of knowledge in Hindi, Shivani Centre offers spoken/written Hindi classes in varying proficiencies. For example, one can learn Hindi formally to the level of writing creative pieces or maybe just learn conversational Hindi to interact with their peers. Besides Hindi, the Shivani Centre also provides opportunities for students to learn other regional languages, such as Tamil, Kannada, or Malayalam.",
      "We also found that EPP, an English Proficiency Programme, used to be conducted for students who wanted to learn or improve their English. It was discontinued when the pandemic began. It was conceptualized and conducted by Prof. Bhaskar Dasgupta with the help of some faculty members and the student body. The program helped diligent students write better English and perform better in the placement season, thus serving as a useful help for the student body.A group led by Prof. Bhaskar Dasgupta is currently working towards reviving the program and is looking for volunteers to join the English team and the technical team,regarding which he will write to the students list shortly.",
      "In a nutshell, the language barriers on campus are real and affect students academically and socially. Despite continued efforts like the courses and support services, the barrier persists. Professors, student representatives, students seeking help, everyone agrees that there is a scope for improvement. Improvement here is not limited to the better resources and plans, but also in terms of a more enthusiastic participation by the students these efforts are for. As we see, it also calls for the need of the Campus Junta to be aware of such linguistic differences, and to deal with them empathetically. An attempt to understand and be more inclusive is required. These are not just numbers, but fellow students we see around us struggling. We are left to ponder about the smallest of attempts we can make for the betterment of the situation.",
      "Written by: Abhijit Jowhari, Aditya VS, Gupil Chhabra, Mahaarajan J, Sruthi SubramaniamEdited by: Kunaal Gautam, Mohika AgarwalDesign by: Mrunmay Suryawanshi, Sachidanand Navik, Vardaan Vig"
    ]
  },
  {
    "title": "शब्दों के परे: आईआईटी कानपुर में भाषा संबधी बाधाएं",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "आई आई टी कानपुर एक ऐसा शिक्षण संस्थान है जहां पर भाषागत विविधता आमतौर पर देखी जा सकती है।जब विभिन्न भाषाओं को बोलने वाले वक्ता बातचीत करते हैं, तब अक्सर वह खुले और मुक्त संचार में बाधा का अनुभव करते हैं। पहले दिन जब SGs हिंदी में कुछ बताते है या संवाद करते हैं और जब प्रोफेसर की अंग्रेजी समझना पाठ्यक्रम को समझने से भी बड़ी बाधा होती है। विस्तृत रूप से जानने के लिए हमारी VOX टीम ने शैक्षणिक और सह-पाठ्यचर्या क्षेत्रों के भीतर कैंपस में इन भाषा बाधाओं का विश्लेषण करने का प्रयास किया। हमें क्या मिला यह देखने के लिए आगे पढ़ें।",
      "परिसर में भाषा संबंधी बाधाओं से संबंधित हमारे सर्वेक्षण ( जो जुलाई 2023 में किया गया था ) में 343 छात्रों ने प्रतिक्रिया दी। निम्नलिखित इन्फोग्राफिक्स उनकी भाषा पृष्ठभूमि और उस भाषा को दर्शाते हैं जिसका उपयोग उन्होंने अपनी बोर्ड परीक्षाओं को पूरा करने के लिए किया था। इससे हमें उत्तरदाताओं की भाषा पृष्ठभूमि के बारे में कुछ जानकारी मिलती है और बाद के विश्लेषण के लिए भी जगह मिलती है। अधिकांश लोग हिंदी और अंग्रेजी में सहज हैं, लेकिन उन छात्रों के बारे में क्या जो इस श्रेणी में नहीं आते हैं? उनके लिए क्या प्रयास किए गए हैं? क्या यह पर्याप्त और सहायक है? इन समस्याओं से निजात पाने के लिए और क्या प्रयास किए जा सकते हैं? ये कुछ प्रश्न हैं जिनका उत्तर हमने इस लेख के माध्यम से पाने का प्रयास किया है।",
      "किये गए सर्वे के अनुसार विद्यार्थियों में भाषा को लेकर एक विभाजन निश्चित तौर पर देखा जा सकता है। ज्यादातर छात्रों को तो कोई खास दिक्कत नहीं है पर लगभग 10% छात्रों को अंग्रेजी के प्रयोग से दिक्कत है, जो इंस्टिट्यूट की औपचारिक भाषा है। अंग्रेजी में आत्मविश्वास से संवाद करने में उनकी असमर्थता के कारण, जिन्होंने सर्वे फॉर्म भरा था उनमें से लगभग 19.8% विद्यार्थी प्रोफेसर से बात करने में हिचकिचाते हैं और लगभग 9.3% विद्यार्थी लेक्चर समझने में मुश्किल महसूस करते हैं। ये आंकड़े महज़ आँकड़े नहीं हैं, बल्कि एक कड़वी हकीकत बयाँ करते हैं। हमारे जैसे कठिन पाठ्यक्रम के साथ, ऐसी बाधाएं सीखने को लगभग असंभव बना सकती हैं, और छात्रों के लिए अपने साथियों के साथ तालमेल बिठाना मुश्किल हो सकता है।",
      "अलग अलग प्रोफेसर्स से बात करने पर भी एक ही तरह की प्रतिक्रिया हमारे सामने आई। कुछ प्रोफेसर्स ने बताया की कुछ बच्चे हैं जो उनके पास अपनी परेशानी लेकर आये और उनको बताया कि उन्हे पाठ्यक्रम सामग्री को समझने में दिक्कत होती है क्योंकि वह अंग्रेजी में है और उनको अंग्रेजी बोलने और समझने में परेशानी होती है। जिसके कारण वह अपने आप को अपने साथियों से कमजोर महसूस करते हैं। प्रोफेसर्स जो अंग्रेजी कोर्सेज लेते हैं (जैसे कि  ELC और ENG)  काफी सहायक है। वे छात्रों को फ़िल्में और किताबें बताते हैं जो उन्हें बेहतर ढंग से अंग्रेजी समझने में सहायक होते हैं।",
      "कुछ विद्यार्थियों ने यह भी बताया कि अंग्रेजी में आत्मविश्वास न होने के कारण वे अकादमिक चर्चाओं में भाग लेने से भी कतराते हैं। संस्था ने ENG112 और COM200 के जगह पर Y22s के लिए English Language Course(ELC 111/112/113) को आरंभ किया था जिसकी प्रभावशीलता को लगभग 57.2% विद्यार्थियों ने अंग्रेजी सुधारने में अक्षम बताया है। ELC course सभी को English Diagnostic Test के माध्यम से बांटा जाता है। ELC113(Advanced) पाने वाले कुछ विद्यार्थियों ने आश्चर्य जताया है क्योंकि उनकी अंग्रेजी अच्छी न होने पर भी उन्हें ये कोर्स मिला है। COM200 लेने वाले विद्यार्थियों में से 72.09% (157) ने इस कोर्स को “समय की बर्बादी” बताया था।",
      "कुछ प्रोफेसर इस बात से सहमत हैं कि पाठ्यक्रम में एक अंग्रेजी पाठ्यक्रम, एक छात्र के लिए कितना अंतर ला सकता है, इसकी एक सीमा है। उनका मानना है कि छात्र समुदाय के भीतर से मिलने वाले समर्थन का अधिक प्रभाव हो सकता है। एक और अवलोकन जो उन्होंने बताया वह यह था कि ELC पाठ्यक्रम (पूर्व में ENG112) अंग्रेजी से जूझ रहे छात्रों को बाकी पाठ्यक्रमों के समानांतर चलने में मदद करने की कोशिश करते हैं। पर जो छात्र अंग्रेजी में कमजोर है और नई भाषा को सीख रहे हैं उनके लिए कॉलेज द्वारा पाठ्य सामग्री को अंग्रेजी में पढ़ना और अपने उत्तर को अंग्रेजी में प्रस्तुत करना कुछ हद तक कठिन हो जाता है। जब तक वे अंग्रेजी पर अच्छी पकड़ बनाते हैं, तब तक उनका अधिकांश सेमेस्टर समाप्त हो चुका होता है और वे शैक्षणिक रूप से नुकसान में रहते हैं।",
      "अंग्रेजी का अभ्यास करने के लिए उपयुक्त वातावरण की कमी भी समस्या का एक हिस्सा है, जैसा कि कई उत्तरदाताओं ने अपने व्यक्तिगत अनुभवों में उल्लेख किया है।यहां तक, कुछ ने तो ये भी बताया कि अक्सर TA और Tutors बात-चीत में हिंदी का प्रयोग करते थे जो कि उन विद्यार्थियों के लिए एक बाधा थी जिन्हें हिंदी नहीं आती थी।",
      "जब उनसे पूछा गया कि क्या क्षेत्रीय भाषाओं में पाठ्यक्रम शुरू करने से फायदा होगा? तबकुछ प्रोफेसर्स ने यह भी वर्णित किया कि अंग्रेजी में काम करने का संघर्ष ऐसा है जिसे टालना नामुमकिन हैं, क्योंकि अंग्रेजी आज दुनिया की भाषा है, और अपने व्यवस्यायी जीवन में विद्यार्थियों को इस भाषा के साथ काम करना होगा। हिंदी में लेक्चर लेने या हिंदी और अंग्रेजी को सयोंजकर लेक्चर लेने मे कुछ प्रोफेसरों को लगता है कि वे न केवल संस्थान के शिक्षण के स्तर से समझौता करेंगे, बल्कि वे छात्रों के उस संघर्ष में भी विलंब ला रहे हैं जिसका सामना उन्हें अंततः करना हैं।",
      "पढाई के अतिरिक्त, विद्यार्थियों को सामाजिक जीवन में भी भाषा रूपी बाधाओं का सामना करना पड़ता है। सर्वे में 16% बच्चों ने बताया कि इसके कारण उन्हें विभिन्न क्लब गतिविधियों में परेशानी का सामना करना पड़ता है व 18.1% को तो दोस्त बनाने में भी मुश्किल होती है।जिसका मुख्य कारण यह है कि हिंदी और अंग्रेजी दोनों को धाराप्रवाह समझने और बोलने में लोगों को समस्याओं का सामना करना पड़ता है।",
      "सर्वे में 15.5% उत्तरदाताओं ने हिंदी में असमर्थता व्यक्त की है। हिंदी में धाराप्रवाह बातचीत करने में असमर्थता कई अन्य समस्याओं को उजागर करती है। एक आम समस्या जो देखी गई है वो ये है कि mess workers और maintenance staff  सिर्फ हिंदी में ही बात करते हैं। कैंपस में होने वाली अधिकतर गतिविधियां भी हिंदी में ही होती हैं जिसके करण काफी लोग नए लोगों से बात करने में खुद को अक्षम पाते हैं। शाराह पी.एस., मलयालम बोलने वाली एक Y22 UG छात्रा ने बताया है कि कैसे उन्हें हर बार एक हिंदी में सहज मित्र को अपने साथ ले जाना पड़ता है ताकि वे दुकनदारों से बात कर सकें। यहां तक कि उन्हें अपने मित्रो से भी बात करने में मुश्किल होती है क्योंकि वे सिर्फ अंग्रेजी में ही उत्तर दे सकती हैं । एक उत्तरदाता ने तो ये भी बताया कि जब वे एक सरकारी योजना के बारे में जानने के लिए दफ्तर गए थे तो अधिकारी ने उन्हें सिर्फ हिंदी में ही बात करने के लिए कहा था।“यह समझाने के बाद भी कि हम हिंदी नहीं बोल सकते, अधिकारी ने हमें हिंदी सीखने के लिए कहा, कई बार इसका जिक्र किया और इसका मज़ाक उड़ाया।”",
      "पहले, अंग्रेजी में कमजोर छात्रों को दो माध्यमों से मदद दी जाती थी। एक तरीका तो औपचारिक था जिसमे सभी कोर्स आते हैं। ऑफर कियें जाने वाले कोर्स थे ENG112 और COM200। और दूसरा था अनौपचारिक तरीका जिसमे आती थी English Speaking Classes by DoSA, TTC(Technical Terminology Classes) और ECC(English Communication Classes) जो कि Institute Counselling Service(ICS) द्वारा आयोजित किया जाता था।",
      "ENG112 course EDT (English Diagnostic Test) के माध्यम से दिया जाता था जो की orientation के समय होता था। ये एक अधिक कोर्स था जिसे बच्चे तब करते थे जब बाकी बच्चे HSS Level 1 course करते थे लेकिन इसे HSS का नाम नहीं दिया गया था जिसके कारण बच्चों को एक अधिक कोर्स करना पड़ता था। इस वजह से बच्चों के curriculum में भी दिक्कत आती थी जिसके चलते बाद में ENG112 को भी HSS Level 1 Course बना दिया गया था, लेकिन इसके पाठ्यक्रम को फिर भी नहीं बदला गया था। Y21 बैच तक COM200 एक पाठ्यक्रम था जिसे लेना सभी विद्यार्थियों के लिए अनिवार्य था। इसमे भी कुछ खामिया थी जैसे पाठ्यक्रम में अत्याधिक विद्यार्थियों का होना, बच्चों में भाषा की विविधता का होना तथा पाठ्यक्रम में दिए गए समय का अपर्याप्त होना। चूंकि ये कोर्स कोई विशेष विभाग तो लेता नहीं था इसलिए असफल होने वाले विद्यार्थियों को कई मुश्किलों का सामना करना पडता था।",
      "इसकी जगह पर Y22 batch के लिए ELC111(Basic), ELC112(Intermediate) और ELC113(Advanced) course को लाया गया था। अब सभी विद्यार्थियों के लिए प्रथम वर्ष में एक अंग्रेजी का कोर्स लेना अनिवार्य है जिसका फैसला EDT से होगा। कोर्स केवल कुछ हद तक ही बच्चों को मदद कर सकता है। इस खामी को ICS ने पहचाना और TTC aur ECC प्रदान करना शुरू किया था। DoSA ने भी इंग्लिश स्पीकिंग क्लास लेना शुरू किया था। सभी की ये पहल बच्चों के लिए काफ़ी मददगार साबित हुई थी। लेकिन वे इंस्ट्रक्टर जो इंग्लिश स्पीकिंग क्लास लेते थे, उनके कैंपस छोड़ते ही ये क्लास भी बंद हो गई और उधर ICS की क्लासेस में भी विद्यार्थियों की संख्या गिरती चली गई।यहां तक ​​कि जिन प्रोफेसर्स से हमने बात की, उन्होंने भी छात्रों की नई भाषा सीखने की अनिच्छा पर ध्यान दिया।कुछ प्रोफेसरों ने पहले सेमेस्टर की शुरुआत से पहले अंग्रेजी पाठ्यक्रमों की पेशकश करने का सुझाव दिया।  शायद एक विस्तारित ओरिएंटेशन, जिससे छात्र अंग्रेजी में पढ़ाए जाने वाले अन्य पाठ्यक्रमों को संभालने के लिए बेहतर ढंग से सुसज्जित हो सकें।",
      "नये UGARC के आने से पहले सभी विभाग communication पाठ्यक्रम प्रदान करते थे जिसका मुख्य उद्देश्य बच्चों में संचार कौशल विकसित करना होता था। उदाहरणानुसार गणित विभाग के प्रोफेसर छात्रों को प्रूफ़ लिखना सिखाते थे तो वहीं इलेक्ट्रिकल विभाग के प्रोफेसर मुख्य तौर पर Resume लिखना सिखाते थे, जिसको Y22 से रोक दिया गया है। ये department-level communication courses को Y22 बैच के साथ बंद कर दिया गया एवं  ELC को इसका एक बेहतर रिपलेसमेंट के रूप में देखा जाने लगा। किसी भी कोर्स की कमियों को 2-3 बैच की समीक्षा के आधार पर दूर किया जाता है। अभी सिर्फ Y22 की प्रतिक्रिया पर कोर्स में कोई बदलाव नहीं किया जा सकता है।",
      "“हालांकि, यह सच है कि कोई भी प्रणाली किसी भी तरह से परिपूर्ण नहीं है, लेकिन इसकी सारी अक्षमता प्रशासन पर नहीं पड़ती है। किसी भी प्रणाली की प्रभावकारिता अंततः उन लोगों पर निर्भर करती है जिन्हें वह लाभान्वित करती है, और हर प्रकार से ELC केवल तभी वास्तव में अपने उद्देश्य को पूरा कर सकता है यदि जो लोग सच में अपने अंग्रेजी संचार कौशल में सुधार करना चाहते हैं वे वास्तव में भाग लेते हैं और इसका पूरा लाभ उठाते हैं। इसके अलावा, यह उल्लेखनीय है कि एक उच्च-स्तरीय ELC पाठ्यक्रम को हमेशा उन छात्रों द्वारा OE पाठ्यक्रम के रूप में लिया जा सकता है, जिन्होंने पहले निम्न-स्तरीय पाठ्यक्रम किया था और अपने अंग्रेजी संचार कौशल को आगे बढ़ाने में रुचि रखते हैं ”– किंशुक सियोल,Senate Under-Graduate Committee (SUGC) के student nominee.",
      "शिवानी सेंटर, जिसकी स्थापना अगस्त 2021 में हुई थी, एक और माध्यम है जिसकी स्थापना आई आई टी कानपुर में हिंदी और अन्य भारतीय भाषाओं को फिर से शामिल करने के उद्देश्य से हुई थी। शिवानी सेंटर का मुख्य उद्देश्य उन नए छात्रों की मदद करना है, जिन्होंने अपनी स्कूली शिक्षा और जेईई यात्रा हिंदी में पूरी की है और उन्हें पूरी तरह से अंग्रेजी शिक्षा में समायोजित किया जा सके। जिन बच्चों को हिंदी ना आने की वजह से दोस्तों से बात करने में दिक्कत होती है उनके लिए शिवानी सेंटर में हिंदी कक्षाएं भी प्रदान की जाती हैं। हिंदी के अलावा यहां क्षेत्रीय भाषाएँ जैसे तमिल, मलयालम या कन्नड़ भी सिखाई जाती है।",
      "EPP, एक अंग्रेजी दक्षता कार्यक्रम है जिसे उन लोगों के लिए एक पाठ्यक्रम की तरह अयोजित किया जाता था जो अंग्रेजी को सीखना और उसमें सुधार करना चाहते थे लेकिन कोरोना के चलते इसे बंद करना पड़ा था। इसके योजना के पीछे मुख्य रूप से प्रोफेसर भास्कर दासगुप्ता शामिल थे और उनके साथ और भी संकाय सदस्य और छात्र निकाय भी शामिल थे। इस प्रोग्राम ने छात्रों को प्लेसमेंट सीज़न में काफ़ी मदद की थी।प्रोफेसर भास्कर दासगुप्ता के नेतृत्व में एक समूह वर्तमान में कार्यक्रम को पुनर्जीवित करने की दिशा में काम कर रहा है और अंग्रेजी टीम और तकनीकी टीम में शामिल होने के लिए volunteers की तलाश कर रहा है, जिसके संबंध में वह शीघ्र ही studentlist पर लिखेंगे।",
      "संक्षेप में, परिसर में भाषा संबंधी बाधाएँ वास्तविक हैं और छात्रों को शैक्षणिक और सामाजिक रूप से प्रभावित करती हैं। पाठ्यक्रमों और सहायता सेवाओं जैसे निरंतर प्रयासों के बावजूद, बाधा बनी हुई है। इसके लिए प्रयासों में सुधार की आवश्यकता है, न केवल इसे प्रदान करने वालों द्वारा बल्कि उन छात्रों द्वारा भी जिन्हें इनकी आवश्यकता है। जैसा कि हम देखते हैं, यह लेख कैंपस जनता को ऐसे भाषाई मतभेदों के प्रति जागरूक होने और उनसे सहानुभूतिपूर्वक निपटने की आवश्यकता भी बताता है। समझने और अधिक समावेशी होने का प्रयास आवश्यक है। ये सिर्फ संख्याएं नहीं हैं, बल्कि साथी छात्र भी हैं जिन्हें हम अपने आसपास संघर्ष करते हुए देखते हैं। हमें स्थिति की बेहतरी के लिए किए जा सकने वाले छोटे-छोटे प्रयासों के बारे में सोचना चाहिए।",
      "लेखक: अभिजीत जौहरी, आदित्य वीएस, गुपिल छाबड़ा, महाराजन जे, श्रुति सुब्रमण्यमअनुवादक: प्रदीप बागरी, हिंदी साहित्य सभा और संकेत बंसलसंपादक: कुणाल गौतम, मोहिका अग्रवालडिजाइनर: मृण्मय सूर्यवंशी, सचिदानंद नाविक, वरदान विग"
    ]
  },
  {
    "title": "Sexual Harassment – A campus wide survey",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "Amidst the beating hearts, smiling faces, and the chaos that was the Orientation’22, whispers about numerous cases of sexual harassment circled the campus. Incidents ranged from stalking to inappropriate touching, with reports not only from the latest batch but also from students in older batches. Later that year, girls were prohibited from entering hall-13 premises as a perceived measure of safety. This made us reflect critically on the nature, prevalence, and institutional response to such cases on campus.How do people understand sexual harassment? How prevalent is it? What becomes of such cases?These and many other such questions guided the following investigation.",
      "Vox conducted a comprehensive survey on our campus. Our intent is to raise pertinent questions based on the data, initiating conversation on the broader implications.",
      "The survey, done through an anonymous Google form, had three main parts. First, it asked about the respondent’s experiences of sexual harassment on campus, including some questions with multiple correct answers. Second, it looked at institutional bodies and experiences/perceptions surrounding them wanting to understand the role of institutional bodies in these situations. The third part focused on people’s ideas about and around sexual harassment. It ended by asking respondents about their awareness of the issue.",
      "705 individuals contributed to this dataset. Among this group, 414 respondents (comprising 58.7% of the total) identified as male, while 281 individuals (constituting 39.8% of the respondents) identified as female, with one respondents identifying as non-binary. Additionally, the respondents included 565 undergraduate students and 130 postgraduate students (rest did not respond to the question).",
      "In this article, we present the findings of this survey, aiming for an objective portrayal of data. It sheds light on the prevalence, extent, and nature of such incidents, exploring different aspects without immediately going to definitive answers. In subsequent editions, we will try to explore (via investigation) potential answers to these questions for a more comprehensive understanding of the landscape surrounding sexual harassment.",
      "In response to the initial question that asked if the respondent had ever experienced sexual harassment on campus- the survey revealed that almost 25% of those surveyed have encountered some type of sexual harassment (as perthis definition).",
      "This means – nearly every1 in 4people who participated in the survey have experienced harassment in various forms. To gauge the situation better, we also inquired whether the respondents were aware of anyone who had faced sexual harassment.",
      "The results reveal that close to 35% of participants know someone who has had similar experiences.Notably, a significant portion of individuals, even if they personally haven’t experienced harassment, are aware of someone within their circles who has. This, to an extent, indicates that the issue of sexual harassment is not hidden; it exists within people’s awareness and is not invisibilised as much as we would like to believe – both through first-hand experiences or through accounts of similar experiences around them. This suggests a visibility greater than might initially appear.",
      "Next, we attempt to understand in what form sexual harassment is prevalent on campus (the respondent could choose multiple options). We note that almost all forms of sexual harassment are present on campus, ranging from sexually suggestive remarks and sexist jokes to more serious cases of sexual assault.",
      "The following graph is the same statistic with percentages sorted by male and female, UG and PG, combined to give a complete picture.",
      "Having found out that cases of harassment seem numerically significant – we enquire about the identity of the perpetrator. 119 of the 147 (81%) responses mentioned someone known to be the perpetrator. From the responses, the known person could further be divided on the basis of the power dynamics. 73% included romantic partners, friends, wingies or batchmates while 8% mentioned faculty or senior students as the perpetrator. The remaining 28 of the 147 (19%) comprised of the unknown people ranging from office clerk and mess worker to HC staff.",
      "The data suggests then that harassment knows no boundaries and infiltrates all corners of campus life. From friends to faculty, mess workers to office clerks, it seems no nook is untouched by these incidents. Another obvious inference is that the perpetrator in more than half the cases is a friend/intimate partner and in a significant number of cases is at-least an acquaintance, i.e. someone you are familiar with.",
      "We have grown up hearing that reportage of harassment is an acute problem, especially in India where a lot of stigma is attached to such experiences.Does this dynamic reproduce itself within campus?We look at a few statistics around rates of reportage by respondents who faced harassment in some form or the other. Reporting here includes complaints made to either Women cell and ICC on campus or filing an FIR. This data is particularly important – it may help us gauge the barriers to reportage which are both internal (internalised notions about the consequences of reporting) and institutional (confidence in institute bodies).",
      "It turns out that nearly 92% of our respondents who faced sexual harassment did not report the incident further. We specifically follow up this question by asking respondents why they did not report the incident. Out of 162 responses, ~44% felt that the incident was “too trivial to be reported”, 43% did not want to get involved in the resulting “drama”, 30% felt that “the situation would improve if I just ignored it”. The question was a checkbox type where more than one option could be marked.",
      "A related question in the survey asked the respondents “When is the right time to report a case of sexual harassment?”. More than half the respondents thought that an incident should be reported“As soon as one feels uncomfortable”. The next two most popular responses were“If it keeps happening repeatedly”and“Only when it becomes extreme”. This may indicate that people have very varied beliefs on what constitutes harassment, insofar as the episode demands to be reported. We explore this heterogeneity later in the text.",
      "In the next section we look at possible reasons behind the low rates of reportage. We have clubbed similar subjective responses into categories to isolate the problems. We try to raise some relevant questions –",
      "There were a set of responses that asserted their distrust in the bodies on campus.",
      "“I don’t have any trust in WC or ICC.”",
      "One response said“He was faculty, I thought that would become worse for me”.",
      "Other similar responses included",
      "“Got review from my seniors that Women’s cell will not help you much”,",
      "“I don’t have faith in the institutional mechanism to address this. It will be emotionally taxing for me, because the process itself is difficult and I was also concerned about peers judging me for what happened.”",
      "“I have handled such people in past institutes and complaining hasn’t led to any conclusive results. In my experience, perpetrators don’t usually get penalised harshly when there is a reputed autonomous institute at play”",
      "“I do not consider the authorities or CS apt enough to understand and handle the case respectfully”",
      "“Didn’t think it would be taken seriously going by previous records”",
      "The responses reflect a sentiment of perceived mistrust and incompetence within the institutional bodies. These notions are likely rooted in either the first-hand experiences of the respondents or the collective experiences shared within their social circles within (or outside) the campus. In both scenarios, the question arises:what factors have led individuals to have such reservations concerning the institute bodies?An issue that is anyway extremely taboo-ised in the status-quo, needs the redressal bodies to establish a level of trust. Assuming that the responses to our survey are indicative of the larger population’s sentiments, some questions that arise are –Are the institute bodies aware of their perception within the campus community? If yes, have they taken steps to proactively address these concerns? Have they been responsive to the sentiments held by individuals? Have steps been taken to bridge the gap in trust and competence?– These are some questions we wish to delve into in later pieces.",
      "Many respondents expressed that they chose not to report the incident out of fear that it might become public knowledge and negatively impact their image. Some were concerned about being victim-blamed and having their character questioned. Additionally, they were weary about the potential ‘drama’ that might ensue as a result of reporting.",
      "Some such responses read –",
      "“I did not want to get involved in any type of ‘drama’”",
      "“Afraid of what society will think about me”",
      "“Scared of victim blaming and shaming”",
      "“I was just too scared”",
      "Earlier, we presented the respondent’s answer to “Who was the perpetrator?” and saw that while in most cases, the perpetrator is somebody you know well (friend, acquaintance), it may be anyone from a doctor at the Heath Center to a Faculty member.",
      "The implications of this statistic raises some questions –Does the relationship between the victim and the perpetrator influence the victim’s response to the transgression? Does the close connection deter reporting, as victims may be reluctant to subject their friends to consequences?Some responses to “Why did you not report the incident?” read-",
      "“He is my friend”",
      "“The perpetrator in my case were my close friends – so I was also empathetic towards it”",
      "In cases where the perpetrator is somebody in a position of authority ( such as faculty, PhD mentor etc) how does the victim address the issue despite the power dynamic? Some responses said –",
      "“He was faculty, I thought that will become worse for me”",
      "“I was in doubt whether the touch was intentional considering the old age of my supervisor”",
      "These questions open a window into the complex interplay between personal relationships and the reporting of harassment incidents.Do redressal bodies on campus recognize the implications of these dynamics?Some responses said –",
      "“No instant action taken by either Women Cell or ICC neither by my supervisor to make me feel safe in the lab. When I reported the incident to my supervisor, his behaviour was very insensitive…. I met Women Cell *redacted* her gesture of talking was also not very appropriate. Her questions and some comments were offending to me.”",
      "Following this, we received feedback mentioning the normalisation of particular types of sexual harassment. Normalisation here means that harassment is such a frequent phenomenon, that people tend to accept it as part of daily life- and hence have rationale to not do anything about it proactively.",
      "“I felt it was too trivial to be reported”was the highest response",
      "Multiple replies mentioned“Things like this happen all the time”as the reason for not reporting the case.",
      "“The usage of sexually suggestive cuss words, and invasion of one’s privacy, seems rampant in IIT Kanpur. I did not want to be the odd one out – for one person alone cannot change the society. I can work on myself, and that’s all I can do. Perhaps IITK would be a better place if the students were more educated about socially appropriate speech and expression.”",
      "This raises an essential question for consideration –What process leads to the normalisation of certain acts? How can we address things that are seen as normal for most, even if it causes discomfort to someone?Furthermore, it prompts an inquiry into the effectiveness of the sensitisation organised by the responsible campus authorities.",
      "Another set of responses come from (presumably) men who did not go ahead with reporting the incident because –“I think no one will listen to men”“I thought there is no cell for men that’s why”“Ladkon ki sunta kon hai”",
      "Another statistic that adds some context to the one above is what people do and do not consider sexual harassment.",
      "Students come from diverse backgrounds – from different cultures and different places. This means that for each one, internalised notions about gender, violence and (specifically) harassment differ considerably. This is exactly what the responses seem to show. We can conclude from the above data, at least, that the question of what constitutes sexual harassment has different answers for different people. What may be considered harassment to one person might be shrugged off as insignificant by another.",
      "For instance, on the one hand, 63 respondents claim to be victims of invasion of private space (getting too close for no reason, brushing against or cornering someone) while at the same time 69 respondents do not consider invasion of private space (getting too close for no reason, brushing against or cornering someone) as a form of harassment. We see this trend across the different types of sexual harassment – where many people claim to have been victims of a particular kind of harassment, many others do not recognize that category as harassment at all.",
      "In any case, this discrepancy in understanding may have strong implications. When individuals observe their peers failing to acknowledge certain experiences as instances of sexual harassment, it may contribute to a heightened sense of alienation and trauma for victims. Such circumstances could then diminish the likelihood of victims reporting the incidents further. This statistic underscores the importance of a collective understanding and awareness surrounding the nuances of sexual harassment and how it is experienced.",
      "Sessions by the Women’s cell conducted during the orientation week in part aim to bridge this discrepancy in awareness. Having said that –do we need more elaborate ways of addressing the awareness problem – ways that involve deeper and continuous (longer) engagement with the topic? What might these ways look like?",
      "Higher education in India has gone through what has been called a quiet revolution. Within Higher education institutions (HEIs), gender parity has almost become a reality with women constituting 42% of the student body (at the time of this survey) from 10% at independence. However, this surge means individuals coming from diverse socio-economic backgrounds converge in institutions like ours, each having their own internalised ideas about and around gender. Each of us brings our own set of beliefs and stereotypes, shaping our definitions of what’s appropriate. As families invest in the education of their daughters and sons, fostering aspirations for change, the need for ensuring gender safety becomes that much more important.",
      "Our institute is a mosaic of culture, ideas and beliefs. Inside these walls is a microcosm of the broader society outside, and as such, it is essential that we address certain issues to shape a better society for tomorrow. In this series of articles, we will attempt to bring to attention aspects that deserve discussion. In this pursuit, we invite the readers to reach out to us with their experiences, analysis and interpretations of the data for the further parts of the series.",
      "Design – Sanyam Shivhare, Shivam RathoreAssistant Editors – Aujasvit Datta, Manasvi Nidugala, Mansi Patel, Vaneesha KumarEditor – Gauravi Chandak, Mutasim Khan"
    ]
  },
  {
    "title": "Hall 13 Woes",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "The Hall Of Residence 13 is the first stay for first-year undergraduate males at IITK since the year 2018. With an entirely new world awaiting students and a hall of residence entirely for the first-year male students being in place, the state of living conditions and the resident experience has been far from pleasant as per its current residents. Being homed amid the spread of litter and below-par drinking water facilities, regular HC visits, and trouble from mosquitoes; the added unresponsive authorities have left the Y22 boys reeling by the end of their first semester. Residents of the IITK campus frequently talk about the dormitories’ overcrowding, rising electricity costs, and crumbling ceilings in the old halls of IITK. However, the mismanagement inside Hall 13 is rarely brought up. At Vox, we decided to bring this up and floated a survey to gauge the opinions of Hall 13 residents.",
      "Investigating the quality of potable water and also assessing feedback from our survey, we found that an wide majority of 65% of respondents found the water quality to be unsatisfactory. Analysing these responses block-wise, the proportion of students unsatisfied was much higher in blocks A, D, E and F. This comes as an expected consequence as blocks B and C had new RO systems installed in November last year. Assessing the water quality using a TDS meter ourselves in the hall, our team found the following results as of mid-January.",
      "The investigation highlights how adequate potable drinking water sources are not just limited in number, but also scattered across the entire hall. This causes students to line up at a water cooler for longer durations and also travel across the hall for something as essential as drinking water. The numbers can also be contrasted with our last investigation on water quality across the campus which is linkedhere",
      "Students also complained about high salt concentration in water supplied to the washrooms and raised concerns of several dermatological problems arising from this. Suggestions for the adoption of water softeners were also made. Apart from the water issue, complaints of a general lack of hygiene in and around the hall, including an ever-increasing garbage pile on the side lanes of the hall, found numerous mentions in the survey responses.",
      "Hygiene in the messing facilities was also raised as a concern among the student residents. Problems like fly infestation, hair found in mess food and improperly cleaned utensils were pressing issues with the messing in Hall 13. Students also mentioned their dissatisfaction at the quality of food served in the mess and in particular were unhappy with the high prices of extras in the mess, claiming that the amount of food being served was not proportional to the price paid.",
      "Presence of bugs and snakes within the hall premises was also a concern flagged across the survey responses. The presence of dogs, however was not posed as an issue, with around 81% residents being neutral or having no problem with the presence of dogs. Problems arose with toppling of garbage by dogs and further consequences like foul odour and spread of other diseases was highlighted.",
      "Around 79% of students mentioned about having visited the Health Centre atleast once. Out of this, 44% mentioned that they had been to the HC on more than one instance. 72% students had fevers at least once through their stay, and while symptoms of COVID, Dengue and Chicken Pox were low, around 50% of the residents faced digestive disorders during some or the other part of their stay yet.",
      "Regarding the number of washing machines in the hall, more than 60% of the students felt that it should be increased, and 22% were unsatisfied with the availability of warm water. On the brighter side, more than half of the students were satisfied with the availability of warm water in the hostel, and more than 85% of students didn’t face the problem of power cuts. Pingala complaints were addressed in time for the majority, though 16% of the respondents complained about delayed or no response.",
      "Creation of a Hall Executive Committee for Hall 13 has been a long pending task, and the survey highlighted how 60% residents were in favour of having an HEC for the hall to enable student administration for the living conditions and facilities of the hall. The Senate and CoSHA had approved the formation of the HEC back in 2020-21, but pertaining to the pandemic, the implementation of the same was stalled. While news of elections for the HEC to be held around March are doing the rounds, conclusive updates are yet to be received.",
      "The infrastructure crunch plaguing the campus currently has taken all shapes and forms, with the most recent Hall of Residence also facing concerns related to living conditions coming up. The necessity of having proper student accommodation gets highlighted with each passing week on campus, and having students take up responsibility to handle the facilities provided to them in the proper adept manner comes forward as a necessary step. With the end of the first semester for the Y22 undergraduates, the updates with their stay at Hall 13 are awaited upon their return to campus. Keep following us for more follow-ups on the issue!",
      "Edited by: Utkarsh AgrawalWritten by: Aujasvit Datta, Pranav Agrawal, Harshit Sharma, Kaushal Jain, Pratham Sharma, Aadityaamlan PandaDesign by: Sachidanand Navik-"
    ]
  },
  {
    "title": "The HC Check-Up",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [
      "Aniruddh Pramod",
      "Manasvi Jain",
      "Nishanth Shanmukhan",
      "Ridin Datta"
    ],
    "content": [
      "IIT Kanpur, one of the country’s finest flagship residential campuses, housing over 8000 students, numerous workers, faculty members, and their families from all over the country, is naturally not immune to ailments and medical emergencies. The IIT Kanpur Health Center is the central body that looks into the ailments of our residents. With over 15 doctors listed on its website, we also have specialists visiting the center from time to time. Our campus is a community in itself, and the campus community’s health must be well catered to. Following several developments and grievances around the Health Centre, the Vox team decided to investigate what the ground reality and public perception were concerning the Health Centre. Unfortunately, we were not able to get a statement from the HC officials regarding the matter, despite multiple attempts.",
      "In a survey answered by 187 participants, we found out that the most voted option answering the questionHow often do you visit the Health Center?, was that of emergencies. Less than 10% of the respondents stated that they visited the HC more frequently (two to five times a month), mainly to look after chronic illnesses. The most common reasons for visiting the HC were simple injuries, flu, food poisoning, etc.",
      "When asked what the campus felt about the services provided by the HC, over 50% of the respondents claimed to have a certain level of dissatisfaction with the services provided by the Health Center. Let us take a look at what the respondents have to say-",
      "One of the most frequently mentioned problems was regarding the unavailability of doctors, or the delay/waiting time for appointments. In principle, the Health Centre is supposed to ensure that a second doctor is available as a substitute in a particular shift, and that has seemingly not been the case in the way the HC has operated post-pandemic. There have been quite a few complaints about the waiting time or the working hours of the Health Centre, but due to constraints of resources, we were told that the problem boils down to choosing between increasing the working hours or having backups during emergency hours.",
      "About 10% of the respondents claimed that the officials were rude and judgemental and that they had been denied treatment when they approached the HC during emergency hours.",
      "In a recent incident, a student who visited the Health Center psychiatrist stated that he was treated very rudely and impolitely and that the psychiatrist didn’t even bother looking at him, much less making him feel welcome during the visit.",
      "“I had an emergency once, and the emergency contact numbers of the HC were not reachable”, another student told us. “I went there, in a very distressed state, and on reaching the center, I was told that this problem had been going on for 10 days. Apparently, they had registered a complaint too but nothing was being done. After that, I was given an alternative number, not available on the site or anywhere else.”",
      "Many such examples, concerning the rude treatment of the doctors and the staff at the Health Center, were found in the survey. The respondents stated the officials are rude, arrogant, and ignorant, and hinted that they were annoyed by the patients, or were indifferent, to say the least.",
      "However, we also found out that a similar number of survey respondents held the opinion that the waiting time was standard and the services were satisfactory. They stated that the staff was regular, helpful, and punctual, and the ambulance service was stated to be very reliable in case of emergencies.A student additionally mentioned that the HC helped him arrange for an ambulance and the related arrangements in an accident outside the campus.One of the respondents said that the HC even delivered medicines to their room due to the medication being previously unavailable. Another quoted, “We should be satisfied with the health facilities provided by the institute. Not everyone has access to such facilities, and we should be thankful for what we have”.",
      "Coming to the quality of treatments, there were some claims about extreme medications being advised by the Health center. A couple of respondents claimed that the specialists were hasty and overlooked a lot of symptoms before prescribing medication. We also received responses claiming that they had been prescribed a heavy dosage, for instance, one respondent claimed that he had been given three injections to cure dehydration.",
      "However, contrary to the opinions stated above, only about 20% of the respondents felt that way.  In the survey, one respondent claimed that doctors often went out of their way to help with the treatment, familiarised themselves with the doctors back home, and make arrangements with the hospitals outside the campus to make the treatment more accessible. A few doctors were also listed as polite and welcoming, and their treatment was claimed to be more than satisfactory.",
      "",
      "In general, we received a lot of negative feedback based on the quality of treatment, the general conduct of the doctors, the (in)adequacy of technology, and the working hours. Many respondents also complained about the HC pharmacy always being out of stock.",
      "However, an anonymous source stated",
      "“There are a lot of people with preconceived notions about the HC who criticize it for no reason. This happens due to the nature of the field. Bad treatments are amplified and talked about while good treatments are never talked about.”",
      "In the responses, we also received a few complaints regarding the Apollo Pharmacy. To look into these complaints, we interviewed the Apollo Pharmacy supervisor. When asked why the pharmacy was frequently short on essentials such as Odomos, Sanitizers, and Electral, he stated that the quantity needed for these items is never definite. “We keep just enough stock so that none of it expires, otherwise we find that a lot of the stock goes to waste, which we cannot afford. We do not keep a buffer stock. Whenever the stock is depleted we order them, and they’re here in a day or so.”",
      "We were told that an Apollo application exists, through which we can order medicines and have them delivered to the room in the daytime. Apollo24x7  helps you order and pay via UPI, and then directly collect the items at the Health Center.",
      "There were numerous complaints about the failure of the online payment system of the Health Center and their treatment of students.",
      "I practically yelled and slammed their desks and they continued to ignore me as if I didn’t exist.I had gone there to get sanitary pads in the early morning, I paid twice, but their system was not working, and they simply chose to ignore me after that. I went back three times, only to get a different excuse every time, and finally got my refund on my fourth attempt.",
      "Another student said, “I believe that having an alternative to Apollo Pharmacy will create competition in the market. I hope that at least that would act as an incentive to treat the students right and keep the meds stocked up at all times.”",
      "In the survey, we asked students if they were aware of the insurance policy of the Health Center. Shockingly, we found out that over 50% of the respondents were unaware of the insurance policy at IITK. Although there are no complaints regarding this matter, we thought it best to make the student community aware of the benefits offered by the institute.",
      "There exists an insurance policy for the IIT Kanpur students, by which we can reimburse all the medical costs expended in any external hospitals. The Health center takes care of the costs endured by the students when visiting external hospitals. According to a source, 70% of the Insurance Fund is currently getting claimed by the students. The policy is availed by default, even without involvement from the insuree, which means that students can claim it even if they aren’t aware of the specifics of the policy. Interestingly, it was brought to our notice that our institute’s insurance policy was one of the few insurance policies in institutes that also covered the pandemic casualties.",
      "The insurance policy of our institute applies to any hospital in Kalyanpur, however, a cashless transaction exists in only a few. In the rest of the hospitals, students need to pay the amount first and then claim the reimbursement. These hospitals include the Madhuraj hospital, which is mainly recommended by the HC. As far as private hospitals go, the quality of treatment is a little on the spotty side, but it has a better rapport with the HC. The Regency hospital is the largest private hospital and offers a much better quality of treatment, however, it has a much longer waiting time, and it asks for an extra amount for the treatment, which is not included in the insurance. Lala Lajpat Rai Hospital (formerly Hallet Hospital), is the government hospital recommended by the health center.",
      "The Insurance policy gets modified every year. Reforms are suggested and debated by a committee that approves them.There exists an amount of about 1.5 lacks of direct coverage and about 1 lakh rupees in corporate bufferPremium amounts change, and so does the coverage amount. These changes are usually informed to the residents via email. However, we can always get to know more about the insurance on the health center’swebsite.",
      "Coming to the possible improvements to overcome these difficulties, it was suggested in the survey that the HC should work towards increasing students’ awareness of the health-related protocols on campus, including information about the health and insurance policies, the HC rules and regulations, and the HCUC (The Health Centre Users Committee).",
      "Following the aftermath of the pandemic, the functioning of the HC has changed dynamically. While some things have improved, certain aspects of the way of operating the facility have also become inconsistent. The HCUC has also been sporadic in its meetings and the lack of a feedback mechanism in place for the HC has been a point of concern of late.",
      "It was brought to our notice that the HC has been revamping facilities deployed, and technological advancements have been planned to digitize the maintenance of records. These changes should improve the day-to-day operations at the HC and also help in streamlining the experience for campus residents.",
      "To conclude, the Health Center is arguably far from perfect, but it stands to be a capable institute center. The falling standards of the services offered seem to be one of the problems that plague it. We hope that the improvements in the quality of treatment and the services provided by the HC  go hand in hand with the advancements in technology. Hopefully, the near future ahead should bring a more efficient and improvised Health Centre Experience.",
      "Written by – Aniruddh Pramod, Manasvi Jain, Nishanth Shanmukhan, Ridin Datta",
      "Edited by – Sanika Gumaste, Aryan Pandeya",
      "Design by – Praneat Data, Atharv Jiwane"
    ]
  },
  {
    "title": "The Tryst with HSS Courses",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "Tracing students’ opinions on the humanities curriculum at IIT Kanpur, and exploring the necessity for technology programs to have social science coursework.",
      "Several engineering students at IIT Kanpur often wonder – “why study Humanities courses?” especially when the alarm for early morning class jolts them out of sleep of which every minute feels oh so precious! From the perspective of a student who spent a couple or more years getting better at sciences to crack the JEE, this question seems genuine to a certain extent.",
      "Vox Populi decided to float a survey among the student body to assess and investigate potential answers to the above question, and got enthusiastic and insightful perspectives from the set of responses. The UG community proactively filled out the survey and had lots to say about the HSS courses offered,  grading schemes, pedagogies, and much more. Let us comb through the responses we received and see where they lead us.",
      "Understanding the Demographic",
      "First of all, who are the respondents? Even though the survey was sent out to all the students of IITK, all except one response was from the UG community. The lone data point was from a PhD student. An important metric to consider is how many HSS courses students have done.92.5% of all respondents have taken 1-4 courses, with the most prominent faction (35.4%) having done two courses. It is noteworthy that of all the courses done, more than 70% were taken – or rather given – through the lottery system. Nonetheless, people did have reasons to go with the courses they got or accepted, which is what we seek to examine next.",
      "Reasons for Taking HSS Courses",
      "Here we received answers that would already be coming to your mind. Three main reasons stand out: people take HSS courses out of interest, for grading, or the professor. Ideally, we want people to do courses they are interested in, and conversely, we want courses to interest people. However, it is concerning that less than half of the students taking HSS courses had felt that the course would be exciting or had consideredinterestswhile filling preferences. At the same time,at 42.2%, it is still the most cited reason for taking these courses, which is the good side of it. Nonetheless, it is evident that there is still a chasm between people’s interests and the courses they take.",
      "It has to be kept in mind that we can’t lay the blame on either the students or the HSS department. Some students might not pick courses that wouldn’t help them professionally, especially when the courses they can choose from are limited. Some might have had interests in a course but found themselves allotted a different one. Some courses might have failed to arouse interest in the students, while in some, other aspects such as teaching methods or grading schemes might have overweighed the students’ interests. Still, the influence of the interest factor going up is always a good thing.",
      "Let us next look at what is arguably the most discussed matter when the course-choosing season arrives, grading. In the survey, however,only 32% considered ease of getting good grades as one of the reasons for picking the courses they did. Adding to this is an interesting statistic – 35% of respondents were happy with their grades, while 12.6% were not pleased. Considering the amount of discussion around it, the ease of getting good grades stands among the less popular reasons for picking up a course. It might be that we overestimated how much the community values grades. Nevertheless, objectively speaking, we also have to consider the possibility that some students weren’t allotted the high-grading courses they preferred, driving down the percentage.",
      "Next,22.4% of the respondents cited having a “good” professor as a reason for picking a course. The teacher is an integral part of the learning experience. You often learn things from the professor, such as how to communicate your ideas coherently, less use of jargon, and so on. But with the multitude of professors working in the HSS department, how many can one know? Although a significant fraction of people found professors in the HSS department friendly and approachable, usually, what they know about a professor comes through word of mouth with no traceable source. Under such circumstances, a professor’s “good”ness is a subjective matter that is hard to convey. So what people mean by a “good” professor boils down to the comprehensibility of the course or the grading. Considering this, we can say that 22.4% makes a strong case in favour of the more objective criteria.",
      "The next question we asked was relatively straightforward –Which departments in HSS do people prefer?Economics topped the chart with almost 33% of people preferring it over other disciplines. It is helpful for people who plan to explore the finance sector professionally, and it has a reputation for being easier than other courses. Naturally, it becomes the top choice for many students. The ART and ENG disciplines follow with a preference percentage in the 13-15% bracket, followed by Psychology, Philosophy, and Sociology, set around 10%.",
      "Impact of HSS Courses",
      "Now that we have gained an understanding of the demographic, we can move to the second part of our study.How have the HSS courses been for the students who took them?We have a wide array of responses to this. Some people were irritated by the large amount of writing required for some HSS courses; a few others felt there was a lot of jargon in these courses. Such issues can be found in any stream and should not be a defining point in the argument against HSS courses. On the other side, the brighter side (or so to say), many respondents agreed that HSS courses are an essential refuge from usual engineering courses.",
      "In terms of difficulty, almost equal number of students stood on the ends of the spectrum, with the lion’s share staying in the middle. Regarding usefulness, 37.1% of respondents felt that the courses provided fruitful learning experiences. In comparison, 14% stood on the other side of the spectrum, saying they didn’t learn much from the courses. Even though the maximum percentage of students stood in the middle, the fact thatHSS courses positively influenced close to 40% peopleis commendable. Further,over 30% people also reported that they imbibed new ideals into their everyday life. This indicates how truly the HSS department stands to the aim of its establishment – evolving students into better leaders and decision-makers.",
      "The survey concludes with some interesting data that indicates that theimpact of HSS courses extends beyond the set expectations.More than 10% people opted for a minor or double major, or branch change to an HSS discipline. Add in the 5% that decided to pursue HSS for higher studies and the 12% that considered it but didn’t go through with it; we see that the number of people HSS courses positively impacted far outweighs the 23% who felt that the course didn’t live up to expectations.",
      "Attempt to Better",
      "It is fair to say that HSS courses are not unnecessary or pointless, as some might like to claim. There are ways through which the institute can increase engineering students’ overall interest in taking HSS courses. For instance, one way is to introduce the option of taking up minors in more disciplines under HSS for UG students. To increase the number of PG students taking HSS courses, a push towards interdisciplinary research shall prove beneficial. Addressing the issues regarding the lottery system will also help.",
      "The issues we will discuss in the next article within this series are the usefulness of a random allotment system and the necessity of HSS courses in an engineering curriculum. Please stay on the lookout for it to know what more the campus junta has to say!",
      "Credits: Utkarsh Agrawal, Hisham Hadi T, Gauravi Chandak, Aviral Upadhyay, Niliena Celine BijuEdited and Compiled by: Sugandhaa PandeyDesign Credits: Praneat Data"
    ]
  },
  {
    "title": "Cheating Unmasked- How, Why & Where?",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "In July ‘21, our team conducted an anonymous survey (forwarded on the students’ list) to dive deep into the issue of cheating and plagiarism in exams. The survey received 629 responses, with about 40% Y20 respondents, 21% Y19 respondents and 15% Y18 respondents, among others. To present a balanced perspective on the issue, we talked to 9 professors about cheating, their views and policies. Here are the findings from the survey and our conversations with professors-",
      "The survey results say it loud and clear- most respondents have been involved in one or the other form of cheating! However, the means and motivation behind cheating varied. Most respondents claimed that they cheat only in specific courses that they find difficult or uninteresting.",
      "Moreover, according to our survey, cheating is relatively less prevalent among postgraduate and PhD students than undergraduate students. Moreover, while postgraduate students mostly seem to cheat in assignments and projects, UG students cheat primarily in semester exams and minor exams(such as quizzes).",
      "We also asked our respondents about the method of cheating. We find that among those involved in cheating, 80% of respondents discuss with friends, 70% refer to notes or slides of the course during a closed book exam and 55% refer to online resources.",
      "Interestingly, we also found that of the 33 TAs/tutors who responded to our survey, about 20% of them said that they have unfairly helped the students they tutor at least once.",
      "When we asked our respondents about their motivation to cheat, a massive 54.4% respondents said that they cheat because they fear being left behind due to relative grading, since a large number of their classmates are cheating as well. Other popular motivations were to get a better CPI and the lack of utility of the course in their career goals. A noteworthy 19.4% respondents said that they cheat because other obligations and circumstances have made it difficult to focus on academics. The response patterns remained similar across batches, except that a significant share of UG Y20 respondents cheated because they aspired to change their branch.",
      "When asked if they feel guilty about cheating, the response was rather distributed! While about a quarter of the respondents felt guilty but couldn’t let go of cheating as a habit, about 20% found cheating acceptable in the given circumstances. Another 13% said they did feel guilty, but they found the course content irrelevant anyway.",
      "On the other hand, when asked if our respondents would report cheating, the responses were highly skewed! 60% respondents said they’d not report any instance of cheating, while about 19% said they’d report it only if it is a major violation. Similar but less skewed trends were seen among TAs and tutors; About 30% respondent TAs said they did not report cheating instances despite spotting students.",
      "Nearly all the professors who talked to Vox said that the root cause of cheating is our education system, which gives little incentive on learning but more on grades. “We are so grade-centric that learning has gone out of focus. If learning was my main motive, why would I cheat?” said Professor Harshvardhan Wanare from the Physics Department.",
      "“Failure is not perceived as normal in our world, while success is. If success is the goal, the shortest route is bound to attract some. So, one should not be surprised if some people found that opportunity in the online Semester,” said Prof. Achla Raina, the Dean of Academic Affairs.",
      "Professor Amitabha Bandyopadhyay called cheating an ‘act of desperation’, which has only ‘normalised to the extent that it does not induce guilt.’ Prof. Harshavardhan and Prof. YN Mohapatra went on to call cheating an ‘Asian Problem’ (too few opportunities and too many people). Prof. YN Mohapatra also mentioned that the greed for opportunities and the premonition that “everyone else is cheating” further incentivised cheating.",
      "Our survey asked students to identify the measures they think were most effective against cheating. The most popular options were having group assignments and exams, open-book/ open-internet tests and making course lectures more interesting- each of these was chosen by more than half of our respondents. Other popular options were: continuous assessment policies, lenient grading policies and increased interaction with tutors and instructors.",
      "Interestingly, only 19% of respondents think that strict proctoring and invigilation is effective against cheating! Also, a fifth of our respondents took the view that no measures can reduce cheating. Other subjective suggestions included taking oral viva exams, avoiding objective questions and making classes more interactive.",
      "Four professors who talked to Vox (Prof. Amitabha Bandopadhyay, Prof. Jonaki Sen, Prof. Harshwardhan Wanare and Prof. Dheeraj Sanghi) said that, if the class size allows, they’d prefer evaluating students based on vivas and post-lab interviews to gauge clarity in the subject.",
      "Prof. Nisheeth said that he never had weightage for attendance in his offline classes but had tweaked the policy during the online semester. He said, “During the online sem, some people attend classes from villages, with poor internet connection. I, in the comforts of city life, can not comment on their situation. Hence, I tweaked my policy here. The least I can expect from the students is that they attend the lectures. Over my blabbering voice, there is bound to be something that they understand, even if they listen distractedly. “",
      "He also argues for a much liberal policy for specialised courses, but not for an IC course. ”While taking the ESC101 course last year, which recruiters look upon as a measure of the basic coding knowledge, I didn’t promote collaboration among students. However, for specialised courses, which are taken up by students who are interested in learning the course content and are not directly relevant to recruiters, I’ve permitted collaboration among students. In this way, the students will have to study something and contribute in a group,” said Prof. Nisheeth.",
      "Prof.Dheeraj Sanghi also suggested offline regional exam centres for better-proctoring facilities.",
      "When we asked non-Y20 respondents if they cheated to the same extent in the offline semester, only 3.1% respondents said they cheated as much as they do now! More than two-thirds of the respondents had never cheated in an offline semester.",
      "Additionally, we asked students from all batches if they would cheat when we go back to the offline semester. To this, a massive 65% respondents said they wouldn’t cheat at all, and an additional 23% said they wouldn’t cheat unless in a desperate situation like failing. The response distribution was similar for both Y20 and non-Y20 batches.",
      "Most professors believe that plagiarism and cheating have become much more widespread in the online semesters not because the mentality to cheat has changed but because it is easier to cheat now.",
      "“In an online semester, things might have been lax, and thus it has been easier to cheat. In offline mode, we have an army of invigilators, and we take strict measures against it,” said Prof Bandyopadhyay.",
      "Professor Braj Bhushan told Vox that plagiarism had survived through different modes, whether offline or online. “Those who are not able to exhibit better self-control are likely to repeat these actions irrespective of whether one is handling the situation online or offline,” he added. Professor YN Mohapatra voiced similar sentiments, “Most of the students are sitting on the fence. Their decision to cheat or not is determined by their friends and how strict the rules are.”",
      "Several professors connected the psychology of cheating with what is at stake. Professor Harshwardhan Wanare explained with an example, “the thing at stake when you do something wrong on foreign soil is your Visa, and no one wants to hamper their career prospects for a few marks. Thus the same student when they go to a different nation, we see a different being. A much better version of them.”",
      "Prof. Bandhyopadhyay raised concerns, in particular about the freshmen who have not had an offline semester ever-  “Your understanding and analytical growth will be stunted. You will not be as efficient as your seniors in the offline semester. Again, the shift from online to offline will negatively impact anyone who hasn’t taken academics seriously.”",
      "Prof. Achla Raina, the Dean of Academic Affairs, talked about the silver lining, “in the online semester, we have experimented with novel means of evaluation and assessment, some of which have worked extremely well. You will see many of these continue in the offline semesters!”",
      "Prof Nisheeth compares the mindset of IITs to that of the prison system, in contrast to that of an army camp. He says, “there are instances where the students themselves complain about the incidents of cheating and are disturbed that it is happening, but at the same time do not wish to name the students involved. It is like a prison system! The prisoners complain about their problems to the jailer, but they do not want to take up the responsibility to make those changes. They leave it up to the jailers, the administration in this case, to make changes. This is in contrast to an army camp, where a soldier not performing up to the mark is seen as the failure of the entire contingent. So the soldiers take it up to them to help their fellow mates perform well and train harder. ”",
      "Meanwhile, Prof Harshawardhan offers a Panchatantra analogy, “the problem with our educational system is that we seek assessment before understanding. Before a firm grasp of knowledge is established, we uproot the plant to gauge and evaluate its progress, forgetting that doing so inhibits the very growth we desire. There are, presently, more exams than learning goals. Exams are not part of learning, and we need to understand that.”",
      "He goes on to assert, “as a system, we professors are equally responsible. But sanctioning collective cheating in the garb of the pandemic? No, I can not accept that. In fact, this is the peer talk which everyone should be having.”",
      "Prof. Amitabha Bandhopadhyay and Prof. Jonaki Sen asked students to ‘learn the subject for their own good.’ Prof YN Mohapatra goes on to add, “the value of inner life is not understood in this age. Finally, the joy of having done a job well comes not just from being good at it but also from having done it honestly!”",
      "When asked if she had a message for the students, the Dean of Academic Affairs, Prof. Achla Raina said, “Don’t do anything that you might be ashamed of later!”",
      "Writing –Sanika Gumaste,Lavanya Ingle,Dev Barbhaya,Pradeep Suresh,Anushka Panda, Gauri Menon",
      "Editor-Abhimanyu Sethia",
      "Graphics-Vijay Bharadwaj"
    ]
  },
  {
    "title": "UG Freshers’ Survey 2020",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "Disclaimer:This survey was conducted between 30th November and 4th December, i.e. when a Y20 had been an IIT-K student for about 2 weeks.",
      "Through the twists and turns of 2020, after enduring corona and the almost eternal ordeal of the JEE, the Y20 undergraduates finally joined IIT Kanpur. With students from diverse cultures and backgrounds, the Y20 batch is bound to be vibrant with different tastes and ideologies. Vox Populi conducted the Freshman Survey for the incoming undergraduate students receiving 581 responses (approximately half of the batchstrength). Here, we present the other sides of the Y20 batch.",
      "Section I: General Demographics",
      "This section aims at raising awareness and appreciating the diversity of our campus community. From the respondents, about 74% identified themselves as males and approximately 25% as females. To the question on sexual orientation, about 85% of respondents identified themselves as Straight or Heterosexual. 8% preferred not to say, and around 3% identified themselves as homosexuals. The remaining responses (~4%) were distributed between pansexual, asexual, bisexual and queer or questioning.",
      "Upon enquiring of any disabilities, about 95% confirmed that they did not have any disability or learning difficulty. 5% of students marked other options ranging from visual/auditory impairment to physical or mental health disabilities. It is promising to see that students are more aware of such sensitive topics and hold a high acceptance for their preferences and life circumstances.",
      "Section II: Academics",
      "Undergraduate students joining IIT Kanpur always seem to bring forth a sense of optimism and belief in themselves about the institute’s academics. The survey responses showcase this optimism aptly, with more than 50% of the respondents expect that they’re going to a secure a CPI of greater than nine at the end of their freshman year. On similar lines, about 80% of the respondents found themselves relatively better prepared to face the academic curriculum after their transition from the JEE regimen.",
      "One of the most prominent talking points for the freshman is Branch change. Upon being asked if the students were satisfied with their allotted branch, close to 50% students said they were happy but would still want to try and change their branch while about 16% of students were determined to make sure that they got the major altered after the first year.",
      "While some students believe that things get relaxed post-JEE, some believe that the road ahead only gets more challenging. While close to 53% students plan to devote about 20-40 hours a week for academics, 20% of the respondents were confident that they’d be spending north of 40 hours per week in their academic pursuits. With these numbers and the online semester, it seems to be that the laptop screens have taken the place of bicycles as the students’ inanimate friends.",
      "HSS courses are an early surprise to the freshman in their first semester when they expect learning science and engineering. However, the survey highlighted how 80% of students find that the Humanities and Social Sciences courses are quite relevant for IITK students pursuing STEM fields.",
      "After the initial flavour of exams and academics at IITK, it is essential to highlight how about 65% of students responded that they’d never score a 0 in a quiz/exam and close to 80% students said that it’s unlikely that they’d fall asleep in lectures. While 58% of students said they had never cheated on any high school exam or coaching, the other 42% had already had an initial taste of academic misconduct.",
      "*These numbers may change as the semester progresses :P.",
      "The other important aspect of ‘interaction’ at IITK is the interaction with faculty and instructors. Over 85% of students responded that they’d very likely interact with faculty outside of lecture halls and classes.",
      "Section III: Lifestyle and Beliefs",
      "Sleep and screen time are two primary indicators of how the students are spending their days in college. To present a comparison, the survey gauged how these numbers change before and after the JEE period. About 80% of students on an average spent less than 6-8 hours sleeping during their JEE preparation, on the other hand, 70% of students feel that they’d be sleeping more than the 6-8 hours sleeping while on campus. A clear majority of 82% of students said that they are spending north of 6 hours in front of a screen out of which 25% of students were spending more than 10 hours!",
      "An underrated aspect of the online semester has been the household chores absent when the students were on campus. Close to 30% of students said that they were spending more than 2 hours a day managing household duties.",
      "An aspect of life that is not talked about much is the importance of Mental Health. The vast majority of the Y20 batch responded that Mental Health was (if not more) as important as physical health. While 64% of students had never attended any counselling sessions, 91% of students were willing to be counselled in times of stress and anxiety. One of the significant concerns that the survey highlighted was how after the JEE times, the students responded that on an average, about 70% of the students were spending about less than an hour a day on physical exercise.",
      "On a lighter note, the Y20 batch on average had a sanskar quotient of 3.2 out of 5, and while 14% students considered them to be a 5 on 5 on sanskari terms, about 6% were pretty confident that they belonged to the other extreme.",
      "Despite not being on campus, the survey asked how comfortable students would be with a non-heterosexual roommate. While close to 47% of students would have almost no concerns, about 30% responded that they would not be as comfortable as freshmen’s think with the heterosexual roommate.",
      "Section IV: Randoms",
      "After joining an IIT after the grilling years of JEE preparation, students walk into campus with several hopes and dreams they wish to achieve. To gauge these hopes’ fun aspect, we tried to get Y20 to answer some not-so-usual questions.",
      "While 60% of students think it is awkward to brag about the IITK tag in social situations, the other 40% are very determined to flex the IITK tag in every possible way they can.",
      "A fun insight into the fresher’s mind was provided by the question ‘Love vs Arranged Marriage’. Close to 58% voted for Love marriage, but the surprise was that 27% of students believe that marriage is a scam which is more than the 15% who voted for an arranged marriage.",
      "While 83% students responded that they’d find the hostel mess food to be decent, about 13% were very keen on trying the same and answered that they look forward to how amazing it would be. Well, only time can tell how Y20 feels about the food at hostels. A majority of students were most excited to visit the Open Air Theatre (OAT)  and the Airstrip on campus, 10% students also responded how they were looking forward to experiencing Cafe Coffee Day(CCD) on campus.",
      "While 83% students responded that they’d find the hostel mess food to be decent, about 13% were very keen on trying the same and answered that they look forward to how amazing it would be. Well, only time can tell how Y20 feels about the food at hostels. A majority of students were most excited to visit the Open Air Theatre (OAT)  and the Airstrip on campus, 10% students also responded how they were looking forward to experiencing Cafe Coffee Day(CCD) on campus.",
      "Section V: Extracurriculars:",
      "The fresher batch almost unanimously plans to be involved in extracurricular activities through their stay at IITK. Many people were actively engaged in MUN, arts, sports, and debating, among others through their school days. 2 out of 3 students were also involved in math and science competitions at school.",
      "The batch showed immense interest in giving back and serving the society. A significant part of the respondents (63.3%) claimed that they are very likely to do community service through their stay at IITK, possibly through the various cells under Students’ Gymkhana that work actively to address social issues.",
      "The response to the question about the student’s comfortability level in public speaking or addressing a large crowd on a stage resembled a standard distribution bell curve. The most marked option (⅗) could simply be because many students have not yet had such opportunities.",
      "On being asked about any non-existent clubs that the Y20s would want on campus, numerous fun responses came up—ranging from students wishing to have a Spacecrafts and Weapon designing club to have hobby groups that are into music production. Some students also wanted to set up a Sudoku solving hobby group. A few responses also came forward by students who wanted to have a dedicated cell to impart sex education to the campus community.",
      "While the freshers have shown immense enthusiasm in extracurricular activities, they also feel that academics should undoubtedly be given more time and importance than anything else through college.",
      "Section VI: Expectations",
      "This section of the survey aims to discover the average initial expectations of a fresher at IITK. We received reasonably exciting responses, as expected.",
      "Approximately 50% of respondents are confident of being in a romantic relationship through their stay at IITK. A surprising 41% feel that they might sleep through a quiz or an exam. Only time will tell how these statistics pan out.",
      "About 30% of Y20 students plan to enter the corporate world upon graduation while about 21% and 9% want to pursue academia or consider doing an MBA. A relatively large pool of students also intends to take up services in the Indian government (17%) and startups (14%). 3% of students hope to pursue their creative hobbies professionally, and one enthusiastic respondent plans to make an arc reactor post IITK. The question that followed also suggested that while students have a rough idea in their heads about their career choices, they’re still quite open to explore and identify a career that suits them the most.",
      "Making big money is on the bucket list of most students that enter the institute every year. About 50% of students expect a package north of 20 Lakhs per annum, and 27% students among them aim for a paycheck of more than 30 Lakhs. Approximately 2 out of 3 freshers plan to stay back and work in India rather than settling abroad.",
      "About 43% of respondents say they would want to live with their parents after they graduate, and 30% of students plan to stay alone until they start a family. This statistic might shift after the independent hostel life.",
      "The batch also set a high standard of financial management wherein 70% of students claim they would manage their finances quite well while on campus, resisting canteens’ temptations.",
      "Section VII: Social Life",
      "The initial days of the orientation and the family time spent with your wingmates are the first ways the students improve their social life and interact with diverse people and make new friends. The online semester has undoubtedly impacted this aspect of the undergraduate journey, and the survey brought some of these crucial concerns forwards.",
      "More than 50% of the students responded about how the online semester would severely negatively impact the freshmen’s social interaction. Another shocking inference was that 90% of the students were not aware of all of their wingies at the time of the survey, out of which 17% were not even aware of all of their bhais/behens.",
      "A common talking point with first-year students is their confidence and their social skills. Y20 on average responded that they would be about a 3 out of 5 in terms of being extroverted and socially confident and that out of 5, they were about 2.7 in terms of how likely they are to start a conversation with someone of a different gender. At the same time, about 26% of the students had already been involved in a romantic relationship while it might be that the remaining 74% have come to campus with hopes of changing this status. This is because about 66% of respondents agreed to have slid into someone’s DM on social media apart from their wingies/SGs.",
      "More than 58% of students responded that they spend about 0-2 hours with their friends. In terms of social media, while about 7% said that they didn’t want to be on social media, about 35% responded to spending north of 2 hours on social media daily.",
      "Section VIII: Myth and Facts",
      "Most myth and fact questions were relatively trivial, but we did throw in some open-ended questions to see what this batch thinks about IITK. A common understanding among the students through JEE and evident from responses in the survey is that IITK academics are the toughest among the IITs.",
      "About 40% of students think that college life is less stressful than school life. “Life is set after getting into IIT” still seems to be one of the popular opinions as of now. We genuinely hope that it comes true for those who believe it. Before addressing the article’s final question, some clarifications are: There is an app called ‘Puppylove’ (It is active during Valentine’s Week). There are gender-neutral washrooms on campus (About 80% freshers thought otherwise).",
      "To conclude the article, we pick the most crucial question in this vertical, will campus open in 2021 or not? 70% of the Y20 batch is quite optimistic about the ongoing conditions and is confident of entering the campus this year. The remaining 30% think that they’ll welcome their juniors in the online mode.",
      "2020 was a year of its kind, and the Y20 batch too it seems, is following suit. We hope you can look back at this survey by the time you graduate and look back at your initial and final responses to some of the questions.",
      "Credits: Aryan Pandeya, Akshat Goyal, Devansh Parmar, Raj Varshit Moora, Ankur Banga"
    ]
  },
  {
    "title": "Quarantine Survey",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "March 7, 2020. The mid-sem recess had just begun and it was the fortnight preceding the much anticipated fest of the year, Techkriti. While many of us left for our homes, a lot of us decided to stay back. The initial mention of the Coronavirus had started to come up in our conversations but little did we know that things would follow suit in such fashion. The following unprecedented lockdown substantially deterred most of us while curtailing the ongoing activities and subduing all of our anticipated plans.",
      "With Techkriti being called off for the year and the mid-semester break extended, it was the start of a new paradigm in our lives- Quarantine 2020. As days stretched to months, the initial confusion was replaced by gradual acceptance. So far, each one of our lives have been impacted in a myriad of ways, and it’s safe to assume that the post-COVID19 society will not be the same as before.",
      "",
      "We at Vox Populi conducted a survey to get a response of how the undergrads of the IITK Junta fared in their trying times and what kept all of us occupied. The questions ranged across a variety of topics, from personal routines to prevailing issues and health. The questions weren’t exhaustive by any means but provided a bare-bones structure to gauge the general feelings of our IITK brethren.",
      "Though the adversities of this pandemic have forced most of us to retreat from our regular lives and from our very own IITK campus, it has given us a chance to finally reconnect with our loved ones at home and take some time out for ourselves as well. An important aspect that the survey covered was our routine and homestay. The responses depicted a varied range of lifestyles and have shown the diverse ways in which most of the IITK students seem to be spending their time.",
      "",
      "The most sought after way of spending time in the quarantine has been sleeping. Around 58% of people find themselves sleeping for a sound time of 8-12 hours, whereas about 37% sleep around 4-8 hours daily.",
      "",
      "The next major chunk of time has been spent on social media: with over half of the junta spending 2-6 hours on it, every single day. Facebook emerged as the most favoured, followed by Instagram and WhatsApp. A number of respondents also used platforms like Reddit, Quora, Medium, Behance, Telegram and even Stack Overflow as their go-to social media sites!",
      "",
      "There came a wave of social media challenges in which a number of us participated; the most notable being the WIN_INDIA fitness challenge, which recorded maximum participation from the campus. A lot of our respondents also succumbed to the societal pressure of making the Dalgona Coffee. (We hope that the coffee was worth the effort you put in!). A number of other challenges also floated around social media but had minimal participation from the students. On the question of picking up any hobby/skill, there were some fairly intriguing responses such as astrophotography, blogging, making documentaries and vlogs, and some regular but resourceful ones as well like learning new languages, instruments and various technical skills. Being connected with our friends and family has been important for all of us in the pandemic and thanks to the Internet, it is now a feasible idea too. Everyone seems to still be in touch with their peers via texting, voice calls and even zoom calls for the entire friend circle!",
      "With the availability of Coursera for all of us, over 75% respondents have taken up online courses, with Computer Science being the most sought after subject, followed by courses in Finance/Business and Sciences, and Core Engineering. A good proportion of students took up courses in Economics and Humanities as well.",
      "",
      "The quarantine certainly gave us a lot of time to binge watch new shows and tried-and-tested favourites. And as opposed to the usual murmurs, this time Netflix and Amazon Prime Video had more audience than pirated content. With Mystery and Thriller shows being the favourite of the campus junta, a close second are the age-old classic sitcoms. Not to be forgotten, the re-telecast of the (g)old Indian Mythologies kept a majority hooked in the quarantine break. A lot of us also spent time on Youtube following vlogs and other videos as a source of relishing and leveraging leisure. At the same time, a few also disapproved of bingeing shows and pursued other avenues for entertainment. A few of these included learning origami and craft work, production designing and even game development. Over 160 students had a makeshift haircut for themselves in this quarantine and that sure must have been entertaining post the haircut, we hope you get your usual look back soon!",
      "",
      "The survey also focussed on the mental health of the junta and the welfare of those around them. However, it comesinto notice that over 73% of people have taken this as an opportunity to be productive. While the proportion of people having no qualms about what’s ahead was significantly low, more than half of the respondents were sceptic and stressed about the future. This was attested by almost 70% of people accepting that they found themselves getting angry/frustrated on a frequent basis. The prolonged lockdown has significantly affected our social connections as well, but we seem to have adapted to this new routine.",
      "",
      "While half of the people found themselves at an end away from their friends, the other half felt they were doing well enough at their homes with family.",
      "The survey also showed the intricacies of prevailing issues at numerous places. Several cities have faced the brunt of the pandemic and also of the lockdown in effect. Around 47% of our respondents found their city on high alert with a regular upsurge in the intensity of the pandemic. Surprisingly, 67% found no issues so far in their hometowns, the remaining enlisted issues like electricity and connectivity problems (15%), insufficient medical facilities (11%) and even lack of amenities (8%).",
      "",
      "Additionally, there were concernsoverunreasonable crowding and disobeying of rules in certain areas. Over 52% found that the safety measures weren’t up to the mark to sustain workplaces and offices.",
      "",
      "With the closure of the semester now in-order, the relief over cancelled end-sems is tinged with the bitter-sweet feeling of missing the campus. This is brought out by 62% of respondents who preferred to spend the quarantine at the hostels had it been logistically feasible. From having bulla sessions at the mess and canteens, night outs at OAT to the walkthrough to Hall 10 Chowpatty, all of us have a certain sense of nostalgia attached to some part of the campus. As extrapolated from the responses, the nostalgia even extends for the campus wi-fi, the sports routines, the library and our hostel rooms!",
      "All of us miss something that we’ve left at the campus, from the tangible: trimmers, clothes and close belongings, to the intangible: friends, enthusiasm, freedom and most importantly, a part of ourselves on campus. Perhaps, we didn’t realise how the mid-semesterrecess would grow up to become the longest recess ever."
    ]
  },
  {
    "title": "COVID19: UG and PG Academics Survey",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "Disclaimer:None of the solutions or suggestions mentioned below are in any manner representative of the views of Vox Populi and are solely based on the responses collected through the Google Form. This survey is not reproducible without permission and due credits. (Contact voxiitk@gmail.com for queries related to the same)",
      "Also, this is to clarify that Vox did not take this survey on behalf of the Senate Subcommitee for Academic Calendar 2020. And the decision-making body had not used the survey as a primary resource in its discussions.",
      "———————————————————————————————————————————————————————",
      "The COVID-19 pandemic and the unprecedented lockdown that followed has led to a lot of uncertainties for the campus community. What happens to the joining dates of jobs? What about internships? What about this semester? There are questions bothering us all. While an Academic Senate appointed sub-committee is working on the solution, we tried to understand the student opinion on the same. We conducted an online survey that attracted 3180 responses covering all spheres of the campus community. Here, we present you the findings.",
      "Current Semester Plans",
      "Coursework",
      "There are two major aspects to coursework- mode of continuation of teaching and the potential options for grading in case of online content dissemination.",
      "Teaching Concerns",
      "When we asked respondents to choose one or more favorable options from among 6 options, we got the following results-",
      "[infogram id=”dc59c5ee-217d-46c5-aff9-3e0eb1dd3581″ prefix=”X3M” format=”interactive” title=”FavouredPlans”]",
      "At a glance, waiting for the institute to reopen is the most preferred option for PGs and third most preferred option for UGs. However, approximately 73% of students (2332 students out of a total of 3180 respondents) are in favor of at least one option with online content dissemination. This implies that online content dissemination was cumulatively preferred by a large margin over ‘waiting for the institute to reopen’, for both PGs and UGs.",
      "However, a number of respondents remarked that any sort of online content dissemination must be supplemented withchannels like Piazza or Acadly and mini-projects/assignments.",
      "Grading Concerns",
      "To figure out a new grading policy if online teaching happens, we asked our respondents to choose favourable options from among the following 5 options-",
      "Undergraduate students",
      "Preferences on grading showed a very diverse distribution.",
      "With 33.2% UGs in favor, giving S/X grades based on performance so far was the most preferred option amongst UGs. However, a number of students raised concerns over the criteria for branch change if S/X grading policy is followed.Conducting exams when Institute reopens followed as a close second with 32% votes.24.9% of students favored having lettered grades based on graded assignments. However, some students claimed that grading on the basis of assignments wasn’t fair due to poor economic, internet or medical conditions in some homes.",
      "Prorating on the basis of performance so far was favored by 22.7% of students. Graduating students who fear that they’d fail if given grades as per performance so far, raised concerns about their jobs and higher study plans getting affected due to such a policy. Also, students enrolled in courses that require minimum attendance for passing claimed that prorating would be unfair in such courses as even though their attendance is not beyond threshold till half-semester, they planned to cover it up in the next half. Some students remarked that if prorating is adopted, then the opportunity to drop courses must be given.",
      "An exceptionally large number of concerns about prorating were received from PHY103 students claiming that due to the extremely low averages and marks received in mid sems, prorating would make little sense. No wonder, with only about 10% Y19s favoring prorating (59 out of 589 Y19 UG respondents), the percentage of UGs preferring prorating was significantly skewed due to PHY103 scares.",
      "Some novel suggestions received included-",
      "Postgraduate Students",
      "For PGs, on the other hand, conducting exams once institute reopens and giving letter grades based on performance so far were the most preferred options with 29.8% and 27.9% respondents in favor, respectively.Interestingly, for both UGs and PGs, conducting exams after summer term ends turned out to be the most unpopular option.",
      "Grading Lab Courses",
      "Undergraduate students",
      "When we asked undergraduate students their opinions on grading lab courses, prorating was the most preferred option, with 23.3% students preferring prorating and an additional 22% students preferring prorating with a minimum of D grade.",
      "[infogram id=”a686945e-33e3-4b9f-bf8f-e2cf59b5308b” prefix=”wfA” format=”interactive” title=”LabCourses”]",
      "Other interesting suggestions we received include-",
      "A number of respondents believe that “Learning is more important than grading.” Thereby, they suggested for labs to be continued as per regular timetable when the college reopens.Most students suggested against a blanket grading policy and asked the institute to recognize the diverse nature of courses and finer nuisances associated with each course. Rather, a course-wise plan considering the differences in the extent of work and time involved must be prepared.",
      "Postgraduate Students",
      "Unlike undergraduate students, the PG responses were well distributed among the different options. Completing all labs in one/two weeks after institute reopens was the most preferred option, chosen by 26.6% of 620 respondents. Making them S/X courses followed as a close second with 22.6% responses.A peculiar case of ME231A course was pointed out by a respondent who claimed that half the students enrolled have done their labs in the first half of the semester and the other half was supposed to do the labs in the second half. Hence, none of the suggested policies would work for such a course.",
      "Internet Connection Concerns",
      "One of the primary concerns of the Institute with adopting online content to teach has been the lack of good enough internet connections for all students.To know the ground reality, we asked our respondents about their internet connections, and we found out thatonly 9.3% of 2789 respondents claimed that they cannot download any material or cannot study online. On the other hand, an overwhelming majority of students have good enough internet connection to download slides/PDFs.",
      "[infogram id=”9988a262-49b2-499c-9556-589c94cb9e11″ prefix=”rpu” format=”interactive” title=”InternetIssues”]",
      "However, only about 34.1% of students (both UG and PG) have internet connection good enough for streaming lectures.  If the semester is to be continued online, it could be continued through slides/lecture notes or short video contents rather than live lectures. Some students suggested having audio lectures along with slides.A number of respondents from remote areas raised concerns over online content due to unreliable internet services and frequent blockages. Also, multiple concerns regarding laptops, notes, and material being left on campus were received.A student gave an interesting suggestion to give projects and assignments to students in groups so that people with low access to the internet can take the help of others.Another respondent remarked that most people have good internet speed but limited data usage and hence, shorter videos can be streamed.",
      "Research Work",
      "The other component of academics at IIT Kanpur which majorly concerns postgraduate and PhD students is research work.When we asked postgraduate students, what kind of work their research involves, 22.6% of students have experimental work only and hence, they cannot continue work from their home.",
      "[infogram id=”ef7c7adc-3427-4226-a014-8c349046f836″ prefix=”k86″ format=”interactive” title=”RsearchWork”]",
      "However, even the other students (who have either computational/theoretical work only or a mix of both- computational and experimental work) are also unable to continue their work reasonably from home. A majority(53.6%) of students are unable to continue their work from home due to a lack of resources. Other reasons for not being able to continue work from home include- lack of interest(7.9%), inability due to household chores (6.3%) and health issues (1.7%).  Only 30.6% of students replied in affirmative.",
      "Hence, not only is returning to campus essential for PG/PhD students to continue their work, it is important for them to get back soon to prevent their experiments from getting extended. Few responses said that they work with drosophila/flies which need proper maintenance and food supply in the labs and hence they need to get back soon, otherwise, it would result in an extension of their experiments.",
      "Summer Semester Concerns",
      "The summer period is an ideal time for fresh graduates to prepare for academic applications, for examinations like UPSC, MBA, GATE amongst others. 40 of the 321 UG Y16 respondents agreed that an extension in the semester will mean they would lose these opportunities they had planned for.",
      "58 of the 450 respondents from the graduating batch mentioned that they required the summer term to complete their graduation requirements. In addition, 55% Y17s and 16% Y18s have finalized summer internships which might be severely impacted.",
      "[infogram id=”c0bf3730-b847-4a29-806a-16aa9902fe4e” prefix=”qKs” format=”interactive” title=”ConcernsWithSemExtension”].",
      "For the first-year students, summer is a good time to try around different club projects, take up courses or even self-study courses. 328 of our 591 UG Y19 respondents said that they had planned to take up courses in the coming summers.",
      "[infogram id=”00c93cb9-43ab-4269-af96-917d674e4b06″ prefix=”1aD” format=”interactive” title=”SummerStay”]",
      "The survey also brought forward the concerns of a number of MBA students, where they brought to light the fact that given the short duration of their course, the summer internships are valuable.. They suggested that case analysis submissions could be taken up online and online platforms could be used for doubt clearance so that the summer internship period is not compromised.",
      "About 84% of the PG respondents had concerns relating to their research work and their thesis work which they would have completed this summer. Cancellation of the summer semester might mean an extension of their degree. The delay in academic proceedings could end up being a major financial issue for several students and hence, concerns were expressed regarding stipends for the remainder of the semester.",
      "Job and Internship Related Concerns",
      "If the semester were to be extended into June and July, 180 of our graduating respondents would have joining date clashes and 395 of our respondents would have clashes with internship dates. 596 students have job or internship offers that haven’t been rescinded yet.",
      "[infogram id=”8922bca2-91b2-4a37-bb50-7a7490a48e0c” prefix=”HSz” format=”interactive” title=”Abroad”]",
      "Around 65 of these students were scheduled to travel abroad. A semester extension to June-July would mean a clash with these dates, said students. Most coveted research programs for undergrads like MITACS (Canada) and DAAD (Germany) have been canceled, while others have been put on hold until further notice.Due to a mix of COVID-19 and other economic factors, some top summer recruiters, including a Day 1 recruiter, have rescinded their offers. However, some companies have already started looking into work-from-home options for their interns.  The extension of the semester would affect the students interning at these firms.About 46% of respondents (939 out of 2047) wanted the semester to proceed online for its remainder and have graded assignments in case letter grades are to be given or have online classes alongwith S/X grades in case of prorating being done.",
      "Suggestions Received",
      "We received a number of actionable and novel solutions from our respondents. Here are the excerpts-",
      "Credits: Abhimanyu Sethia, Aryan Pandeya, Farzan Byramji, Milind Nigam"
    ]
  },
  {
    "title": "MTech Fee Hike – A Survey of IITK students",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "",
      "On 27th September 2019, the IIT Council had decided to hike the tuition fee for MTech programs at all IITs, to about 2 lakh rupees from 20-50k (currently), over 3 years. Along with this increase of fee, the Council had also decided to scrap the financial assistance of 12400 rupees per month given to all students qualifying GATE. The Council instead proposed income-based scholarships for the PG students, similar to the ones offered to UG students. However, the currently enrolled students were to be exempted from the hiked fee.1On December 11, however, the decision of the fee hike was deferred.",
      "Two primary reasons have been given by the government to justify the fee hike-one, todiscourage non-serious studentswho drop out of the MTech program midway to pursue jobs/competitive exams;two, to ensure that IITs offer only those programs which have demand in the marketand thereby, ensure immediate placement after completion of the course2, in line with the changing objective of MTech degree.",
      "The decision invited nationwide student protests3, raising concerns aboutthe discouragement to serious MTech studentsdue to fee hike. Vox Populi conducted a campus-wide survey on the issue to understand what IITK students think about the issue and check the ground reality of the concerns raised by the government.",
      "The survey was conducted online over Google Forms for 5 days. It was responded to by 421 IITK students, of which 41.5% of students were current MTech/MS students, 27.3% of students were BTech/ BS/Dual degree students and 27% were Ph.D. students.",
      "Of our 421 respondents, 66.5% of students felt that the fee hike was completely unnecessary/ unjustified. Also, when we asked them if the MHRD promised income-based scholarships would be sufficient to relieve the financial burden of students in need, an overwhelming 75.1% of students responded in the negative.",
      "[infogram id=”0c278647-7d41-4e3c-9d4f-e396e38a1885″ prefix=”jLe” format=”interactive” title=”1_justification “]",
      "The MHRD and IIT Council claim that a large number of M.Tech students (as large as 70% in some streams, according to Director, IIT Delhi) drop out of their course as soon as they get a job. This has been a major point of concern as ‘the country’s precious resources and IIT seats are getting wasted due to dropouts.’ (quoted from a post of Director, IIT Delhi).",
      "When we asked our MTech students about their decision if they get recruited by a PSU midway in their MTech program, an overwhelming37.6 percent of students said that they would drop outof the M.Tech program to pursue the job.",
      "[infogram id=”546bd04e-3463-461f-9350-9a811c57e07c” prefix=”2EY” format=”interactive” title=”2_PSU Recruitment”]",
      "Although about 2% more students said they would forego their job to continue their MTech program, 37.6 percent is a big enough dropout rate to raise concerns and hence, the motivation of the IIT council and MHRD seems justified.",
      "The IIT Council expects a higher fee to reduce the dropout rate as the student starting a program has a stake in completing the program. Low dropout rates in the more expensive MBA programs in IITs apparently supports the argument.",
      "However, our findings say otherwise.",
      "Of the 164 MTech students (who responded to this question),84.1% of studentssaid that their decision of dropping out (or not)wouldn’t be affected by a fee hike.",
      "[infogram id=”27b8ff20-a009-4c74-97c0-a4f6a440d2a5″ prefix=”4tF” format=”interactive” title=”3_decision change”]",
      "This isn’t surprising considering that a job at PSU would earn the student 50-80k per month. Since the fee for MTech is to be paid semester-wise, even on dropping out, the student would lose only the current semester’s fee, which would be compensated with only about a month’s income. (even with the hiked fee)",
      "Hence, while the concern of the IIT Council may seem genuine, a fee hike (to about 2 lakhs) doesn’t seem to help the problem.",
      "In a Facebook post4, the director, IIT Delhi writes that the objective of the MTech degree has changedfrom being a bridge course for a Ph.D. to become a means-to-get-a-job. This is because most institutes (including the IITs) are offering admissions, without a Master’s degree, to their Ph.D. programs. Therefore, the Council emphasizes the need for IITs to align their Master’s programs with the market requirements.",
      "Since the IITs will have to attract high-fee-paying students now,the fee hike is expected tomotivate the IITs to make their MTech program industry-relevant.",
      "When we asked our MTech students about their objective behind joining the MTech program, we find, in concurrence with IIT Council’s observations, that 53.4 % of students joined the MTech degree to get a job (private or PSU).",
      "[infogram id=”821c1892-56ee-465c-84c6-11f09d206a26″ prefix=”ARq” format=”interactive” title=”4_Intention behind MTech”]",
      "This combined with 16.9% of students, who joined the MTech to pursue entrepreneurship, underlines theimportance of industry-relevanceof the MTech program.",
      "When we asked our MTech students to rate their curriculum on industry-relevance out of 5, we received a mixed response (an approximately normal distribution about the median, slightly skewed towards 5).",
      "[infogram id=”e30848d9-4f1a-48a2-80b7-da79c21b9235″ prefix=”eNS” format=”interactive” title=”5_rate curriculum”]",
      "Hence, most MTech students areneither very satisfied nor dissatisfiedwith the industry-relevance of their program. However, given the increasing need for MTech to be industry-relevant, even an average rating of 3 on 5 is not acceptable and must be improved.",
      "On finely observing the comments of MTech respondents, we find that while branches like Computer Science have a very industry-ready program, other branches like Aerospace get very narrow employment opportunities.",
      "On the other hand, some MTech students think that the industry is outdated, rather than the curriculum. “Unfortunately, the Indian industry in wireless communications works on backdated tech, our M.Tech. equips us far better actually,” wrote one of our respondents.",
      "Another popular opinion has been that IIT Kanpur’s MTech curriculum is too research-heavy and must be made industry oriented‘like other IITs’. Some MTech students suggestedinternships in government establishmentsto ensure industry touch in their program.",
      "Even though most MTech students aren’t very satisfied with the industry-relevance of their program,61.9% of studentsthink that the fee hike isnotat all going to help make MTech more industry-relevant.",
      "[infogram id=”929f6696-1407-4eb5-99cd-d97b64432077″ prefix=”e40″ format=”interactive” title=”6_fee hike improvement”]",
      "(It must be noted that the question was framed as ‘how much do you think the fee hike can improve the dynamic nature and industry relevance of the MTech program?’ Hence, one might argue, that the relationship between fee hike and improving industry-relevance might not be clear to a respondent who hasn’t read about the issue and hence, the lower ratings)",
      "Hence, here as well, while the concern of the IIT Council seems genuine, most of our respondents do not think that the fee hike is going to help the problem.",
      "After various protests arose across the country over the inability of economically weaker MTech aspirants to afford the hiked fee, the IIT council clarified that needy students will be provided necessary financial support5.The Council resolution also mentions that scholarships similar to the B.Tech students will be provided. “No eligible student in the B.Tech programs has ever been denied admission in IITs because of her/his poor financial background,” wrote Prof. Ramgopal Rao, Director, IITD in a Facebook post.",
      "However, this is in sharp contrast to the recordings of our survey, which showed that about three-quarters of the students think that these income-based scholarships won’t be sufficient for relieving the financial burden.",
      "The problem with income-based scholarships was also pointed out by many students. “Income-based scholarships don’t take a family’s situation into account. Suppose a family earning 6lpa has to support the education of 3-4 children, then the student won’t be able to afford the education, as he/she wouldn’t be getting any scholarship,” wrote one of the surveyees.",
      "Many M.Tech. students also said that the stipend helped them to take independent decisions regarding their higher studies, which would not have been the case if the stipend was scrapped and the fee was hiked. For then, they would have to depend on their families for financial support.",
      "About85.2% of MTech students,who took our surveysaid they would needsome kind of financial help(e.g. an educational loan) to afford the hiked fee.",
      "One might argue that the MTech program would continue to attract serious students despite the hiked fee, as they can get their education financed by a loan. Many analyses have drawn comparison to the MBA programs in IITs and IIMs which hardly see any attrition despite them being highly charged.",
      "However, when we asked our MTech students if they’d be willing to invest the money in their program given the return on investment in the MTech program,only about 16% of students were willing to invest the money,about27% were unsure and the rest were unwilling.",
      "Our findings clearly puncture the analogy drawn between MBA and MTech programs as apparently, students are willing to take loans for an MBA due to better return on the investment, however, that is not the case for MTech.",
      "Our study has established that the motivations behind the fee hike address real concerns, however, the fee hike doesn’t seem to solve these concerns. So, we mull over any alternative measures which can be taken to meet the objective of the fee hike.",
      "While most of our respondent students suggesteda moderate fee hikeand said that a 900% increase in the fee was insanely huge, our findings have shown that even a 2 lakh fee is not enough to reduce dropouts due to jobs. Hence, a moderate fee hike would be even more redundant in meeting the objective of hiking fees.",
      "Many respondents also believed that to help the dropout problem, IITs could make the studentssign a bondorpenalize the students who left the programs in between. In a similar suggestion made by Professor Dheeraj Sanghi (erstwhile DoAA, IITK), he writes thata deposit of Rs. 1.2 lakhs be taken from all students, and returned on completion of degree on time6.",
      "Some of our responding students also said that first the MTech curriculum must be made more industry-relevant, if this has a positive impact on placements, only then the fee should be hiked.",
      "A lot of respondent students suggested that to decrease dropout rates, instead of a fee hike,the PSU recruitment must be aligned with the PG admission calendar.However, some argue that even if this happens, the students would be eligible for recruitment the following year so they would then quit after 14-16 months in their M.Tech. rather than after 2-4 months, therefore not helping the problem.",
      "One of our respondents came up with the idea of unifying PSU recruitments and MTech admissions on a single portal, as both happen through GATE. This can be used to ensure that a student chooses only one of them. However, students might still take up private jobs.",
      "A constantly recurring theme across the comments of most of our MTech respondents has been that theirMTech curriculum has motivated them to pursue Ph.D. and research. “Most of the Ph.D. students decide to go for a Ph.D. while doing MTech,” wrote one of the respondents. These observations raise some important questions- Is making MTech industry-oriented necessarily desirable, given India’s feeble research culture? Would a fee hike in MTech discourage research in India?",
      "Along with the fee hike, the government has also decided to remove the stipend of the MTech students. However, our respondents put forth that the stipend wasn’t given for free but for working as teaching assistants for about 8 hours a week. Why was the stipend withdrawn? With the withdrawn stipend, how would most Professors get teaching assistants for their courses?",
      "Is fee hike helping the problem of dropouts and industry-relevance of the MTech program? Are there any other measures to resolve the problems while not discouraging serious MTech aspirants?These questions demand a great level of thought and planning from the policymakers.",
      "",
      "Writers:- Abhimanyu Sethia, Aayush Priyadarshi",
      "Editors:- Yash Kuwade, Avisha Gaur",
      "Citations:",
      "1. Press Release of MHRD, GoI-https://pib.gov.in/newsite/PrintRelease.aspx?relid=138688",
      "2. Clarification Issued by MHRD-https://pib.gov.in/PressReleaseIframePage.aspx?PRID=1586619",
      "3. News Report by The Indian Express-https://indianexpress.com/article/education/iit-students-plan-to-protest-against-mtech-fee-hike-6110770/",
      "4. Facebook post-https://twitter.com/ramgopal_rao/status/1178263704942415873",
      "5. Clarification issued by MHRD-https://pib.gov.in/PressReleaseIframePage.aspx?PRID=1586619",
      "6. https://dsanghi.blogspot.com/2019/10/subsidy-on-mtech-programs-to-be-reduced.html"
    ]
  },
  {
    "title": "SLEEP CLOCK: Are We Sleeping Enough?",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "Although the sleeping habits of Bruce Wayne have always remained a mystery, one can very easily argue that The Caped Crusader had a delayed sleep phase condition. While Bruce stays out fighting crime, an average college student brews a cuppa, staying up late till the proverbial break of dawn. That’s what most college students in India and even across the world might relate to, where going to sleep at 2 AM or 3 AM is pretty common. Quite sadly, in the real world, not sleeping enough or sleeping late than usual might have some consequences. To pursue this issue, Vox recently conducted a comprehensive survey to track the sleep demographics of campus students and to cover the reasons behind the irregularities in sleep schedules. We amassed 782 responses, that comprised of 485 UG/Dual Degree students and 297 PG/PhDs. Given the differences in lifestyles of these 2 groups, the division helped us analyze the survey data more vividly.",
      "General Trends",
      "",
      "The average sleep time of students for the whole student population clusters around 5-7 hours per day (60%). 64.9% of PGs and PhDs get a sleep of 5-7 hours/day, as compared to 54.7% of the UG/Dual Degree population. Considering 7 to be the magic number of hours one should sleep for sound physiological and mental health, it turns out that 66.4% of UG and Dual degree students are not sleeping enough. PGs/PhDs are in a much worse situation, with 72.2% of their population sleeping below 7 hours a day. A considerable chunk of the total population (8.2%) is getting sleep of fewer than 5 hours a day, inviting dangerous repercussions on their mind and body.",
      "While not sleeping enough is a huge problem, if one is not sleepingearlyenough, they are highly likely to skip classes and miss breakfast. While the former deters academic performance, the latter can only make mornings more unproductive. Ideally, to get 7 hours of sleep, and to grab breakfast the other day (Assuming classes start at 8 AM), one should sleep at 12 am the latest. For this general case, a big portion falls out.",
      "Is IIT Kanpur to blame here?",
      "",
      "A good heuristic to answer the above would be to compare sleep schedules of students before and after joining the Institute. The results show a significant decrease of 6% in the number of people sleeping at least five hours a day. Interestingly the UG/Dual group is affected more adversely as compared to the PG/Ph.D group, with a decrease of 8% as compared to 3%. Notice that within this 5+ hours range of sleeping time, almost half the people navigated from the 7+ hour schedule to 5-7 hours of sleep, courtesy IIT Kanpur. Finally, the most important statistic here is the Transitional Probability, defined as the number of individuals who reduced their sleep time by 2 or more hours divided by the total number of individuals. Interestingly 98.2% moved across sleep schedules to cut down their sleeping time by 2 hours. This probability, when calculated for 4 or more hours, came out to be 63.8%.",
      "",
      "",
      "So what actually takes most of our sleep-time?",
      "Well, on average the whole student population spends most of the night time hanging out with friends, studying and watching movies/TV shows. In general bulla sessions are more prominent in the case of UG/Dual Degree population replaced by extensive workload and studies in PG/Ph.D. The point to ponder upon is that there belongs a considerable number in the population(12.9%) who agree that they spend time doing nothing. This is significantly more than the percentage of campus population spending time in clubs and fest related activities(10.8%).",
      "",
      "It is likely that these delayed sleep schedules can adversely affect other areas of life. So we also asked the student community about the aspect of their life that has been affected the most because of their irregular sleeping schedules. The distribution was almost equally divided into social and academic factors, showing that we are not doing any good to any of these spheres of life by not sleeping enough.",
      "Days of Sleep Depravity",
      "A chronic sleep-restricted state can cause fatigue, daytime sleepiness, clumsiness, irregular appetite, etc. It adversely affects the brain and cognitive function. In general, a considerable portion of the student community feels that there are 2-3 mornings/afternoons(36.3%) in a week and 4-6 mornings/afternoons (20.5%) when they feel have not slept enough. Among the possible consequences of sleep deprivation, deficits in attention and working memory are perhaps the most important and the student’s community faces this a lot in general from feeling sluggish every morning to not being able to perform efficiently to their fullest in day to day activities.",
      "[infogram id=”untitled-infographic-1hxj48jrwjkq2vg?live”]",
      "",
      "The Exams",
      "A lot of things suddenly change when exams are around the corner, and as intuition would predict, these changes affect our sleep health too. To examine the magnitude of this problem we calculated the number of people in our two major sleeping time windows, and they were found to decrease to one-fourth and two-third of their original values respectively. Given that exams require students to stay in their best mental composure, clearly sleeping for less than 7 hours could prove to be detrimental. Recall that a major chunk also(about 50%) feels that academics have been affected negatively, due to their sleep schedules, so maybe burning the midnight oil right before exams is not that good an idea.",
      "",
      "Saving the best for the last, we asked students how they felt about their own sleeping schedules and if they thought could improve, and 57.43% of the population responded with a “No”, that they are not satisfied with their current clocks and would love to change it. A positive noteworthy point here is that if we can somehow shift our timelines by two or maybe three hours, we have almost solved the problem. But this involves a sharp change in times at which campus activities take place, which usually start after 9pm. Other factors like sleeping, hangout/bulla sessions or watching TV shows, can be shifted in a similar manner. These changes might seem too much for the existing batches, but freshers have a fresh start ahead of them, and with the right cooperation from people involved, we might just improve the situation slightly.",
      "",
      "Credits: Jaya Shrivastava, Pulkit Deshmukh"
    ]
  },
  {
    "title": "Mental Health at IITK : A Study",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "“I wish I become that kid again, who had a passion for everything in life, who could study hours a day and enjoy every bit of it. Now here, I spend 50% of the day lying on my bed, only dreaming of a better tomorrow. Sleep is my drug. I have got a strong urge to fly, but I’ve got nowhere to fly to…” – An anonymous respondent",
      "————————————————————————————————————————",
      "In an attempt to gauge the extent of prevalence and awareness of mental illness in our campus, Vox Populi conducted a survey on mental health during the summers of 2018. The survey received an amassing 1105 responses comprising of both the undergraduate (UG) and the postgraduate (PG) student community. We bring to you the responses of our study in this article.",
      "Mental illness, according to Wikipedia, is“a behavioural or mental pattern that causes significant distress or impairment of personal functioning”. The symptoms and results may be varying. It may be something as mild as a change in sleep cycle to something as dangerous and urgent as suicidal thoughts. But the first thing that needsto be understood in this regard is that itisa disease and may need professional help and attention just like any other disease.",
      "[infogram id=”graph-1-1hxj488k0my74vg?live”]",
      "About 43.3% of respondents opined that mental illness is indeed a disease. Mr Shoukath Ali, an institute counsellor affiliated with the Counselling Service, says,“Spreading awareness about the existence of mental health problems is very important. People need to realise that mental health problems are as normal as physical problems.”We can move towards solving the problem only when we have established it. It needs to be understood that mental illness is also a disease, like any other physical disease, and can be cured with professional help.",
      "We next tried to understand how prevalent Mental Health Issues are on campus. We asked our respondents to rate the prevalence on a scale of 1 to 5. Here, 1 meant it is extremely uncommon and 5 meant it is extremely common.",
      "[infogram id=”graph-2-1hxj488kqwed4vg?live”]",
      "The average of the 1105 responses obtained was 3.85, an alarmingly high number. Prof. Sandeep Shukla, Head, Department of Computer Science and Engineering, believes this statistic is fairly accurate and says,“Mental Health issues are definitely on a rise, so much that they can be called a potential epidemic.”However,Prof. Nandini Nilakantan, Head, Institute Counselling Service, has a different opinion. She says,“Short-term depression, anxiety and stress is faced by almost all of us but talking on a prolonged level, I seriously believe 3.8 is too large a number. I feel it’s a hype and a misunderstanding of the term mental health issues.”",
      "",
      "Thus far, it has been established that mental illness as a disease does exist on campus. Our next major concern was to identify the major causes of mental health issues on campus. For this, we split our study into two sections, namely PhD and Non-PhD. The PhD community is predominantly occupied with research work, while the Non-PhD community has more coursework thus leading to different lifestyles and different problems. We asked both of them about the major sources of distress in their lives.",
      "Let us first look at the Non-PhD students.",
      "[infogram id=”graph-3-1hnq411vpmm943z?live”]",
      "Unsurprisingly, the problem that stands out is academic pressure, with as many as64.3%citing it as a major cause of mental distress. Often it is the pressure of expectations and the inability to perform to your anticipated best that gets over people. Adityaa Bajpai, UG Coordinator, Counselling Service, says,“Students feel that they are expected to do well. Under this pressure to perform academic performance stands in their face like a wall, while it is just a hurdle that they need to figure how to get around.”However, Prof Achla M Raina, the Dean of Academic Affairs (DoAA), opines,“Academic pressure is just a punching bag. The actual problems are bigger. Blaming the academic pressure is a weak, incomplete and less open-minded line of thought. Students need to realise this that they need to put in the minimum effort as well.”On a similar note, Prof Nandini Nilakantan adds that a lot of faculty members like herself have already watered down the difficulty of their courses which, in her words,“itself is a disservice and unfair for students who want to be challenged, especially in an institute like IIT.”",
      "The other highlighted issue was that of peer pressure. Seeing people around you perform better than you can at times be hurting. In view of Nilotpal Pathak, Coordinator Counselling Service,“Given that in most of the situations we are competing against each other, a bit of jealousy is natural but only further detrimental to our own well being.”He adds,“I think that is the problem with a lot of us – we do not have respect for others’ struggles. The guy you see doing well is probably going through some other problem you are unaware of.”",
      "Another major issue of concern is loneliness. About46.5%of respondents admitted that they feel lonely on campus. The reasons may be varying. One such issue is the language barrier that hinders one’s interactions. When you are not from the same linguistic group as your peers you don’t gel in well with people around you. In an interaction with us, S Nirmal Kumar, a Y16 batch undergraduate student says, “I am from Chennai. Though many millennials there know how to read and write Hindi, only a handful of them could speak and understand it. When I came to IIT Kanpur (and by extension, North India) for the first time, I felt great difficulty in understanding what other people said. I almost felt like an alien. I was fearful, thinking about whether I made the right decision or not.”The lack of acceptance in society for people who are non-conforming in gender and sexuality can also be a cause. It can potentially drive such individuals into seclusion. A story written to us reads,“I feel depressed because I am homosexual. I thought that I’ll lose all my friends and family and eventually will be left all alone. I have to work so hard so that nobody suspects. From inside I feel so lonely and depressed. I feel like I’m not accepted here.”",
      "As high as42.4%of respondents admitted having been through Existential Crisis. This, as Nilotpal says, is a bigger issue than most people would agree. He says,“Most of us have at least had bouts of this feeling, in my opinion, though some less severely than others of course. And in my experience, it does not necessarily result from some kind of failure either- it could result from the smallest of things (or not)- a feeling of having lived the same day over and over for three years, a reluctance to be a part of the cut-throat competition that is the world outside, doubts about your own capability, doubts about the point of all this effort, about what you really want to do …..”.He further adds,“Pursuing abandoned hobbies for some time each day helped me a lot. Dwindling wing feeling and rising individualism as the years pass is one of the primary reasons why this feeling is more common in non-freshers in my opinion (apart from the obvious fact that they have been here longer)- so hanging out with friends more could also help.”",
      "[infogram id=”graph-4-1hxj488kqzkd4vg?live”]",
      "For the PhD community, the biggest issue that rises to the fore is the student-faculty guide relationship. As many as48.8%of the respondents agreed that they have had issues with their faculty guides. Nishant Agarwal, former PG Core Team Member, Counselling Service, says,“Thesis guides call students on an urgent basis and some of them make students do their work instead of doing the research. Also, they have the power to stop their stipends if they say no or underperform or are not proactive in their approach.”",
      "There are claims about lack of support, about mistreatment, about odd working hours and many more. A story written to us read,“Please treat me as a human, not as a slave…for whom there is no Sunday…they call us at any time for work. Please do the counselling of professors, it would be really helpful.”A Y11 PhD student writes,“My guide … retired from campus and joined somewhere else. Now he doesn’t want to give me time to meet him, he asks everything via mail. My acting guide says he has got nothing to do with my research. I requested DPGC and HOD for help but all they said was it is your PhD, you need to solve it yourself, we can’t do anything in this regard.”",
      "Lack of preliminary knowledge is another big issue as agreed to by44.8%respondents. Students lack knowledge of basic sciences like mathematics. Many times their research is halted by the inability to decode the mathematics behind the equations. Nishant says,“The issue is more among students who have done their graduation from private engineering colleges where the environment is not as competitive as IIT Kanpur. They face many difficulties in understanding the subject.”The academic programmes at IIT Kanpur have been considerate of the issue. Basic science courses have been made compulsory for students. But, clearly, as our data shows this has not been sufficient to address the situation and needs more attention.",
      "Another pressing issue is the individualistic culture amongst the PhD students. As Nishant says,“The involving research activities leave students with very little time to socialise. The primary reason of isolation is their lifestyle. Most of the students prefer working in the night. As a result, their life cycles change. The unhealthy lifestyle inhibits them from spending time with their friends or batchmates. They eventually give up on socialisation and loneliness creeps in.”",
      "Uncertainties of future, pressure from family, marriage or relationship issues are other major factors that affect the life of a PhD student. A stipend of Rs. 25,000 that they get might well be good enough for a lavish life at IIT Kanpur but certainly not outside.“I have some of my friends sustaining on as low as (Rs) 1500 per month sending rest of the money to their family”,says Nishant.Adding to their miseries is the air of uncertainty around their future. Recently, more students have started to register for the placements on campus. This new trend is because of the lack of postdoctoral opportunities around. People are forced to take a job elsewhere while applying for postdoctoral positions.",
      "Another highlighting issue was the long duration of the PhD programme. Excessively long periods of research programmes become painfully frustrating at times. It gets even more difficult for female candidates. They are forced by their family for marriage. There have been instances when female research scholars were forced to leave their PhD in 5th year and forced into marriage. Richa Mudliar, a Y16 PhD says,“The situation in foreign universities is different where students are working on problems established by professors. But, here we have to do all the work on our own with little support from the professors. This lengthens the PhD programme in our country.”Prof Shukla in regard to this said,“In foreign universities, the mentors are paid for guiding, whereas here that isn’t the case. That’s where a bit of incentive lacks. Also, it’s not that always everything will be done by the guides. Hard work and dedication is also required from students.”",
      "Student-Guide relationship is a major concern for the PhD students and the institute is constantly coming up with plans to improve it. Prof Achla Raina believes that the faculty-student relations need intervention. She says,“Pinning the blame on either the student or the guide is not a solution. Students should have the confidence and trust to open up and report problems that they are facing. Resolution of conflict is necessary and if mediation is required then there are no two ways about it.”The Counselling Service has recently started a new programme for PhD students where sessions are organized with the director and HODs regarding the research-based perspective followed by a session with a counsellor and 7-8 senior PhD students who would share their experiences.",
      "A Y16 batch PhD student writes,“We educated people always talk about the exploitation of labour class in India. But we never realise that the same kind of exploitation is being faced by research scholars in India. The attitude of professors is like – What? They say they are getting less stipend? Tell them even if the stipend is decreased instead of increasing, the PhD seats in IITs will not be empty.”Clearly, we have a long way to go towards building a healthier campus. If we are to maintain our reputation as an institution where cutting-edge research takes place, we need to ensure that our research scholars are free from unnecessary stress that hinders their effectiveness at their work.",
      "Identifying mental health problems as a disease, understanding its causes and recognising it around us are surely important steps towards combating mental health issues. But all of it ultimately depends on the support system that people have at their disposal. The success of a support system lies in its approachability and the trust people have in it.",
      "We attempted a similar analysis of our support systems. In an attempt to gauge the sensitization in our campus about mental health problems, we asked our respondents if they had sought help when troubled with mental health issues.",
      "[infogram id=”graph-5-1hnq411vp89e43z?live”]",
      "While nearly half of the respondents approaching someone for help is a good sign, it is the other half that needs to be addressed. Mr Shaukath says,“People shouldn’t be stigmatised and stereotyped that people who are facing mental health issues are weird or not normal. The stigma surrounding counsellor visits must reduce before more such students are able to muster the courage to talk about their problems.”There is a need of an environment where people feel comfortable to talk about their problems.",
      "But, what stops people to approach help? We asked the respondents who did not reach out for help about what actually inhibited them.",
      "[infogram id=”graph-6-1hxj488kqe5d4vg?live”]",
      "The two prime reasons were ‘the feeling that nobody could help’ (53.3%) and ‘lack of trust in the system’ (35.7%). Another very saddening truth was the existence of fear in the minds of people. It could be in various forms, either of revealing your state, or of being judged, or even of not being taken seriously. Much of this can be accredited to the stigma associated with mental health issues. We, as a community, are no doubt responsible for not having built a system considerate enough. But the situation becomes even worse when Counselling Service is discredited with claims of non-confidentiality. A Y16 student writes,“An issue that is supposed to be within CS is being discussed on the mess tables and CCD and what not. C’mon, seriously? Is this the way the person is going to be helped?”Statements like these, among others, pose serious questions at our face that need to be addressed.",
      "Next, we tried to understand the impact the present system has had on people. We asked those who sought help if at all it made a difference.",
      "[infogram id=”graph-7-1h7v4pkz08ek6k0?live”]",
      "The most saddening revelation was34.4%of the respondents saying‘It made the situation worse’, certainly not what we as an institute would have desired. Another27.6%of respondents were of the view that it did not help at all. Put together, this62 %of our respondents put forth serious questions before us. The system that we refer to here includes not only the Counselling Service but all of us. The subject of study could be a friend who approaches us when in need and we failed to help him.",
      "To gauge the effectiveness of the institute’s established support system, we questioned the respondents who approached professional help in the form of the institute counsellors and visiting psychiatrist about their experience. A rating of 1 means very disappointing and 5 means very satisfying.",
      "[infogram id=”graph-8-1h0r6rknw5j34ek?live”]",
      "The average of the512responses we received was an abysmal2.10–  a number that needs to be looked at and thought upon as we move ahead. Mrs Sharmistha Chakraborty, former Institute Counsellor and an integral part of the Counselling Service until her retirement last year, concludes,“The very fact that people have started conversing about mental health in IITK and that so many people have responded to this survey is testimony to what CS (Counselling Service) has achieved so far. This in itself was not an easy journey. However, the revelations of this survey do indeed call for introspection on behalf of the CS and the institute.”",
      "Written By:Aditya Sonthalia,Shreyash Ravi,Yash Kuwade,Akash BhardwajandSoumyadeep Datta",
      "Infographics:Shreyash Ravi",
      "Featured Image:Snehil Saluja"
    ]
  },
  {
    "title": "PhD funding crunch",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "Well-conducted research is vital to the success of global endeavors. Not only does research form the foundation of program development and policies all over the world, it can also be translated into effective global programs. With so much at stake, it is vital that for our institute to encourage research. It is important to ensure that the PhD students, who do research as part of their academia, are well taken care of. Reality tells a different story though. In an attempt to decipher what it means being a PhD student in the campus, we went around surveying people.",
      "“The status quo of the funding for international conferences for PhD students is really of serious concern”, said a group of PhD students we came across. All it does is sums up what being a PhD student means in campus. The culprits they could identify were the way the funds have been handled and the dip in the Alumni Fund in the last few years. To dig deeper into the facts of it, we played with the result of a survey conducted by Students’ Senate regarding improvement of PhD program at IIT Kanpur.",
      "When asked “How satisfied are you with the current support provided by the institute for attending conferences?” Of the 38.7% people who filled the survey, nearly 2/3rdwere of the view that things need to change.",
      "",
      "Till few years back, the institute used to reward the students who got their work published in reputed journals. It goes without saying how good an appreciation it can be for a person. But the dipping funds made it impossible for the institute to continue with it. Nearly 90% of the people agreed that the scheme should be brought back, and rightly so.",
      "",
      "But how important are the conferences as a whole?",
      "Prof. Gouthama says that the most noticeable characteristic of such conferences is the professional environment they serve. He talks of the exposure to a new world, the sessions, the proceedings, the interactions, which can only be experienced by attending them. This sheer professionalism is great for future prospects. He further adds, “Not only is it all about the exposure but also about the connections you build which help you in the future.”",
      "As of now, nearly 50 travel grants are are awarded to students for attending conferences which otherwise would be quite expensive. Just in case you wonder what thequiteis, the 50 travel grants the institute awards end up costing the institute nearly 35 Lakhs.",
      "In its present form, a departmental committee selects those fortunate 50 out of a bunch of 1600 Ph.D students, which has not always been so. Dr. B V Phani, DoRA says, “15 travel allowances were originally sanctioned for conferences, additional 15 for workshops, totaling 30. This was originally given in writing by the board. 5% of an 8 crore corpus (sustained by interest), 40 Lakhs at most, was decided to be allocated for the purposes. On average 60-70k to each, so around 20-25 lakhs were given. But at that time they gave it to whoever asked, about 130 people per year. With time, the corpus declined, and by the time I took the chair in 2015, the corpus had depleted badly, only 1.5 crores were left.”",
      "The depleting funds saw the suspension of this service. Several reformative measure later, now we have a merit based system which according to the Director’s order is :Student Cash Award –100 StudentsStudent Research Award –50 StudentsThis amounts to a sum of 35 Lakhs.",
      "The DoRA office was excluded was excluded from the selection procedure and a sum of Rs. 1,40,000 was allotted to each department which is to be used as per their discretion. Thankfully, the reward for publication was reintroduced with a budgetary allocation of 10 Lakhs (10,000 each for up to 100 publications).",
      "Another grant system that has been going on is theReturnable Advanced Mode. Under this system, the students were given the money but they had to return it later (free of interest). This is same as the wayHEFAgivs loans to IITs. They have to give in writing when they are going to return it. This system has certain benefits. As the money was finally coming from the students, they have the freedom to choose the conference or the airline (otherwise, you have to take an Air India flight only and submit the ticket), among other things.",
      "To make things better, Prof. Phani, in the first year of his service, decided to reach out to 2000 students (and their guides), who were the beneficiaries of these funds and asked them to donate for future students. But even after 3 listings and pushing through the guides, a mere 70,000 could be collected after 3 months. Even online campaigns were attempted but all proved futile.",
      "To understand the state of the issue, we went around similar reports from IIT Madras. IITM encourages research work and provide financial assistance limiting to 1,50,000. PhD scholars who can submit their thesis in a given timeline are awarded a Pre-Doctoral fellowship of Rs. 45,000 for six months. In the year under consideration, around 45 students could reap in benefits of the program.",
      "Now an obvious question that might pop up is, why is there a shortage of funds in a premier institute? Isn’t the government supposed to encourage research and provide for funds? Why do we need to approach alumni for donations? Elaborating on the same, Prof. Phani says, “The government says it wants to concentrate funds for newer IITs as they need it more. When we argue of being short of funds, they charge back at us saying‘You have 32000 alumni, why can’t you raise funds fromthere?’ Even when we argue that the alumni are not bound to pay back, government insists and says that we are not picking their conscience because we are getting the money from the government.”",
      "",
      "So the question that remains is, do the alumni voluntarily chip in? As Prof. Phani explains it statistically, “Now, on average, each of our 32000 alumni earns 20 lakhs. If even 1% of that came back to us, it would amount to Rs 64 Crore every year. But the amount we have received in the span of 20 years is a meager 60 crores. Even faculties from their projects have generated around 200 crores over 20 years. While the alumni readily donate huge sums to foreign universities (one instance of $130 million and another of $50 million) they hesitate in doing the same in India, which probably needs the money more.” He accepts the efforts of the institute in this regard. Talking about the reunions, if 1800 people could come here and stay here for 3 whole days, there must be some feeling there. It is the unawareness among them of the institute’s need that is costing us.",
      "Pratyush Rai, President, Student’s Gymkhana, while accepting the current state says, “It is only the alumni network that can solve the problem. If Outreach Cell works with the institute administration, it could be a proactive step. We need to connect to the alumni because it is they who can help solve the issue. As the alumni connect more to the students than the administration, we need more and more people strengthening the Outreach Cell.” While Prof. Phani though had different views. He says, a problem as deep rooted as this, can’t be solved by the students alone. Though he urged the student community to contribute and assist the administration change things.",
      "The situation requires all the office bearers and others who could contribute their bit to help improve the scenario for if left unattended for long, it could lead to some harsh consequences.",
      "Written By :Hemant Kejriwal,Akhilesh Tayade,Akash Bhardwaj",
      "Edited By: Harshit Bhalla"
    ]
  },
  {
    "title": "IITK Survey: The Kota Juggernaut",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "Vox Populi had conducted a survey to take a glimpse into Kota’s coaching culture which was answered by 212 students of IIT Kanpur who had previously studied at a coaching institute in Kota. In this report, Vox presents to you some interesting findings from the survey.",
      "Kota, a small city in Rajasthan, once known for its industries, makes national news every year for sending thousands of students from different parts of the country to top engineering and medical colleges.",
      "Kota and, in general, the coaching industry has taken deep roots in our education ecosystem which has been troubling the government for long now. To tackle the problem, the Ministry of Human Resource Development (MHRD) is coming up with a mobile app and portal containing free lectures from IIT faculty on various subjects and previous years’ question papers.MHRD has taken some steps in the past too which failed to make any difference to the rise of coaching industry in Kota. What is attracting students from all over India to the coaching institutes in Kota?",
      "",
      "Almost two-thirds of survey respondents came to Kota to escape the conventional schooling system – which they considered either inadequate or a deterrent to the primary goal of “cracking” JEE. Saim Dawood Wani, a student of the freshmen batch (Y16), opines, “Only a meagre number of students in Kota come from large cities and towns. Many of the children who go there after matriculation (or before that) have had little exposure to ‘quality education’, a rare commodity in our school system. As a result, they end up developing a high regard for Kota ‘style of coaching’.” The proven track record of Kota students in competitive exams also plays a significant role with 22.6% citing success stories of relatives and acquaintances as their reason for moving to Kota. Surprisingly, advertisements of mass selections seem to be only a minor factor(6.1%) compared to others, and so does parental pressure(1.9%).",
      "It has long been argued that poor quality of education in Indian schools pushes students to leave their homes and join coaching institutions in Kota. Survey findings support the claim as 94% of the students stated that coaching institute teachers are better than school teachers",
      "",
      "This leads us to another question, that is how IITK professors fare when compared to Kota faculty? Three-fourths of the respondents believe that the faculty in Kota’s coaching institutions are better at teaching. Well, professors may be renowned stalwarts in research but then, teaching is a different art.",
      "",
      "Let us now take a sneak peek into the life of students at Kota. The survey shows that a majority (66%) of students joined Kota’s coaching institutes in class 11.",
      "",
      "The students who joined Kota’s coaching institution after completing 12th standard stood at 17.9%. 11% of students entered this competitive environment even before they had enrolled in 11th standard. 28.1% of students from Kota joined coaching before 11th standard which was found to be around 4 times the percentage of such students from other cities (7.8%).",
      "",
      "The concept of dummy schools is an open secret today and is also validated by the survey. Only 28.3% coaching students in Kota were regular to school. 28.3% may also look more than expected but after taking out the students who went to Kota after completing 12th (84% of whom were regular school-goers during 12th), the figure comes down to 16.6%, clearly showing that conventional schooling, unfortunately, has taken the backseat.",
      "Kota’s coaching culture, once considered as a breeding ground for academic excellence has faced a lot of criticism in the recent past due to the high level of stress on students which has led to increased suicide rates and the damage it has supposedly done to conventional methods of schooling and education.",
      "",
      "A majority (59%) opined that stress felt by the students in Kota is more than what an average IITK student feels, while the house was pretty much tied to whether stress is more in IITK or is equal in both places. Only 20.3% students felt that IITK is more stressful for students than Kota. Thus, for the majority, IITK does seem to be a more relaxed environment. Mayank Sharma, a student of the freshman batch(Y16), tells us, “The stress levels are almost equal. In Kota, academics is the sole contributing factor to stress, coupled with financial difficulties for some families. Over here, apart from academics, we also have to take time out for extracurriculars and other engagements.”",
      "",
      "Talking about suicides in Kota, 20% of students who answered the survey, personally knew someone who had committed suicide in Kota. On being probed about the reasons behind suicides, parental pressure was cited as a major reason by an overwhelming 66.5% respondents. This pretty much echoes the sentiments of the District Collector of Kota in hisopen letterto parents. The estimated success rate in Kota maybe10% against the national average of 3%,  but still it is a very small number, which parents need to understand rather than harboring false hopes of assured “success” once they admit their wards to coaching institutions.",
      "What according to you is the ‘major’ reason behind the suicides committed by students in Kota ?",
      "",
      "In the words of Mr. R.K. Verma, owner of Resonance Eduventures – one of the top five institutes in Kota, the problem starts in schools,“Bachchon ko schools mein phaltu mein, phokat mein numbers de dete hain…(In Indian schools, children get good grades without much effort). One lakh kids got 10 CGPA all over India in last year’s 10th boards. Parents will then tell you ‘ki mera bacha toh bahut intelligent hai(my child is very intelligent)’. But it’s another thing altogether to crack IIT. So when the kids come to Kota, those who got 90 percent in 10th board get 20 percent in our tests.Bachche se sehen nahin hota hai. (The children are not able to bear this.)”",
      "Lack of stress handling ability was also voted by over 50% students. Another factor appears to be general loneliness which, in fact, can be deadly because the student lacks the required emotional support. Drugs, narcotics, broken relationships are other contributing factors. It is also important to note that singling out one particular reason would be a bit unfair and usually 2-3 factors may add up to force the students to take such drastic steps but seeing how much the ‘Parental pressure and expectations’ factor leads the other factors, it calls for deep introspection from the side of Indian parents.",
      "Saim Dawood Wani narrates his first-hand experience. “The main reason, I think, is not being able to meet up to others’ expectations (or for that matter your own expectations).There was this boy in our hostel who was taking a gap year (he had an AIR around 8000 in the last JEE Adv) and was enrolled in Allen Career Institute. He would keep whining about not being able to study up to his expectations. He spent the entire year brooding about a failed relationship and his ‘supposedly bad’ performance in JEE Adv. Towards the end of the course, with JEE around the corner, he grew increasingly disheartened, having realized he had wasted an entire year doing nothing. On more than an occasion, he had told us that he was contemplating suicide. Concerned, we had him meet Allen’s Student Counsellor. I still wonder what the counselor did to him because he almost choked himself to death that night with a bed sheet. Fortunately, the disaster was averted and his parents flew in the next day. On advice from a psychiatrist in PGIMER Chandigarh, he spent the next few months leading up to JEE on hill stations in north India. He secured an AIR in 2100’s in JEE this year and is studying Mechanical Engineering in IIT Roorkee.”",
      "",
      "The burnout of the students has been another major allegation against Kota’s coaching culture. Interestingly, exactly half of the students reported signs of being worn out by the stress they had faced at Kota and a certain disillusionment regarding academics. Mayank Sharma says, “I feel like I am worn out after having studied there day in and out. It’s just that my brain finds true solace after going through those two years.”The other half, however, were either toughened by their struggle at Kota to the extent that they are prepared to tackle any stress or have realized that this is a new life altogether and put their past life behind them completely.",
      "",
      "When asked whether their creativity has been affected by the Kota struggle a majority (80%) of the students feel that their creativity had been affected to some extent during their stay in Kota. This is a major cause of concern. Kota and Hyderabad have often being satirized as being a “factory of IITians”, merely churning out products perfectly tuned for JEE and ill-equipped with life skills.",
      "",
      "The perception that the coaching institutions influence the choice of IITs/NITs and the branches to be filled at the time of counseling does not hold much merit according to the responses of the survey. 54.9% students said that their coaching institution had no influence at all on their choices. Even in the students who reported that their choices had been influenced by their coaching teachers, a majority said that they only had a minor influence.",
      "",
      "To conclude, most of the IITK students seemed satisfied with their experience in Kota and believe that going to Kota was worth it, although this survey must be taken with a pinch of salt as there is an inherent bias in the respondents that they successfully qualified JEE.",
      "",
      "",
      "However, one point is clear again, nothing will come of nothing. Most have given equal credit to coaching and their own efforts for their success in “cracking” JEE. However, and rightly so, IITK students are cautious about recommending Kota to future JEE aspirants. They prefer to first gauge the merit of the student concerned and accordingly decide whether he is fit to sustain the ordeal or not.",
      "BySoumyadeep Datta,Siddhartha SaxenaandKarandeep Sharma",
      "Special thanks toSaim Wani(Y16) andMayank Sharma(Y16)"
    ]
  },
  {
    "title": "Sexual diversity in IIT Kanpur:  A reality check",
    "date": "2025-07-03T11:08:59+05:30",
    "date_text": "July 3, 2025",
    "authors": [],
    "content": [
      "Last semester, Vox Populi rolled out the LGBTQ+ Campus Climate Survey to students of IIT Kanpur. We received an overwhelming response of more than 750 people of the campus.",
      "",
      "LGBTQ+ (short for Lesbian, Gay, Bisexual, Transgender and Queer) is the umbrella term for the various sexual and gender diversities, approximately 12% of the campus junta.",
      "When we talk about about LGBTQ+ awareness we find that 65% people consider homosexuality to be normal. The other perceptions range from disorder, unnatural, a special gift to ‘no-opinions’.",
      "Exploring similar question about the difference between ‘Sex’ and ‘Gender’, half the population understands that these have different connotations. Indicatively, ‘Sex’ refers to the biological and physiological characteristics whereas gender is majorly based on behaviour, roles and expectations which exist in the society.",
      "This leads us to the effect of societal expectations: 68% agreed that societal expectations influence their habits and behaviour. 29% of the males think their career choices have been affected by the aforementioned expectations whereas 40% of females feel likewise.",
      "Another interesting observation was that though majority (53%) of us will get offended if some-one terms us gay/lesbian for behaviour deviant from traditional gender role expectations but on the contrary half of us have also labelled someone else gay/lesbian for so-called ‘odd’ conduct (or as a form of verbal abuse).",
      "When it comes to conducive environment for people to open about their gender and sexuality, majority of the people (56%) think that their non-straight friend will find it difficult to be open about their sexuality. But then, 60% people won’t bother if their roomie is not straight.",
      "Speaking withVox Populi,Manish Gautam, an alumnus of IIT Kanpur and a member of UNMUKT – gender and sexual diversity community with its roots and presence in IIT Kanpur – said, “This is alarming and requires a retrospection on what is that stopping them. Is it their internal stigma, reinforced by the expectation of society or confusion about their own sexuality? It is because of the fear of being ridiculed or of a physical attack? It surely needs a wider discussion”",
      "Interestingly, only 23% of the people think that the current resource groups are capable of resolving the issues of LGBTQ+ community in the campus. Now, another interesting fact is that only 24% people know about UNMUKT in the campus.",
      "“This is not surprising. UNMUKT, started as a facebook page in 2013, did not have any base in campus then. There were just 2-3 people who tried to organise activities such as talks or open discussions. In the meantime, they got busy with their own studies/research. Also, we did not have ample means to publicise it before it became a Gymkhana wing. But there is a need of having such group in an education campus where issues on gender and sexual diversity may not be seen as important as academics or other student activities. Further,  one of the aims to start UNMUKT was to establish/create/encourage an amiable environment where people can talk about these issues freely without fearing that they would be prejudiced”, said Manish.",
      "Recently, UNMUKT has been recognised as a wing of the Community Welfare Cell of Gymkhana. In conversation withVox Populi,Ashutosh Ranka, Head, Presidential Council, said – “ Various IITs already have such kind of organisations, Saathi (IITB) and Stree (IITD), and we needed a resource group related to gender and sexual diversity. UNMUKT already existed but to organise awareness and social campaigns at a greater scale, it was essential that it gets official recognition.”",
      "[infogram id=”lgbtq_survey-5689″ prefix=”uy6″ format=”interactive” title=”LGBTQ+ Survey”]",
      "ByBhanu Pratap Singh TanwarandKaran Deep Sharma",
      "Special Thanks toVaidehi Menon, Stree, IITD and The Scholars’ Avenue, IIT KGP",
      "Related stories",
      "From Tolerance to Acceptance"
    ]
  }
]